[{"funny": 3, "user_id": "wnzfuir72IZFg5RAPOwWCQ", "review_id": "klVqdjXPM2aM8Y0RsDCPoA", "text": "Unfortunately, Yelp does not allow negative stars. I was very much looking forward to going to Modern on Melrose as my sister had raved about the selection and several purchases she recently made here. I was all set to help her select more furniture for her new home until I experienced a combination of disbelief, shock and horror. \n\nI was inside the store when I heard a man loudly say \"If you're going to start a sale, finish it!\" It took a few more seconds of loud voices before I realized an argument was taking place between two employees and not two customers, as I initially thought. The male and female employee continued to loudly argue, back and forth. Feeling very uncomfortable, I started to look for my sister. There were about four other customers and we all ended up outside as we all felt very uncomfortable in the store. \n\nAs I was walking out of the store to go out back, I heard the male employee say, in a tone that was beyond anger but instead violent, \"Don't you ever tell me to shut up! Ever!\" Shortly after, he walked past all 5 female customers, who had gathered out back, turned to us and angrily said \"Bitch!\" Not knowing what he was going to do when he returned, we decided to leave as we did not feel safe. \n\nIt is one thing to feel uncomfortable, it is completely unacceptable to not feel safe. The interaction between the two employees was the most unprofessional thing I have ever witnessed. The male and female employee were so caught up in their own negative interaction, neither of them offered any customer service. And after their argument ended, the female employee offered no apologies and still no customer service. \n\nToday was my first and last time in Modern on Melrose. How terribly sad for this store. I sincerely hope the owners get a handle on this and educate their employees as to what it and isn't acceptable behavior.", "business_id": "2LfIuF3_sX6uwe-IR-P0jQ", "stars": 1, "date": "2013-11-17", "useful": 4, "type": "review", "cool": 2}, {"funny": 5, "user_id": "B7ecAeAIrXg7sgmabS38pg", "review_id": "RAzbLYbgw3tNv8Tu0R7qmQ", "text": "Hmmm, what to say about Mint.\n\nOkay, if you are a girl and looking for clothes here, I'd say pass. Unless of course you have a tiny waste and are maybe a size 0-4 on a good day. If you are looking for funky earrings, it might be worth a stop, but the majority of their earring inventory was kinda weird and a little too 80's inspired for my retro taste. If you are looking for stellar quality (and priced accordingly) funky retro furniture, then definitely pop in here as their selection is really cool and there were a ton of pieces that I easily would have purchased. As for the rest, I'd say hit this store up every once in again and see what they have to offer and if they start carrying bigger sizes in dresses, lemme know :)", "business_id": "0czfEgv9KAD4VlIa7ANPWQ", "stars": 3, "date": "2007-12-15", "useful": 5, "type": "review", "cool": 4}, {"funny": 4, "user_id": "je5k8a3qIOM0VJE5MaxsfQ", "review_id": "dfL5TyVib8uZgxaNMwx7Aw", "text": "I remember really enjoying browsing through Mint (and their furniture friends Red) before, I love mid-century Modern (but what casually reading Dwell but highlighting Ikea pseudo-art bitch DOESN'T?) , I like interesting jewelry, I think the space is really intense, like I am in a dream of some sort.\n\nBut I went recently...and I just didn't like it. Sure, these are collectible pieces, goregous condition, the space is well cared for, I don't expect to afford these museum worthy pieces, especially at 11grand for a chair and ottoman (oh god, I hope the ottoman was included in that price....), but the affordable pieces of bracelets, earrings, clothing...um, it was a lot of the same items I saw here over a year ago...actually more like TWO years ago.....so, the inventory isn't very turnovering or fresh...so I guess Mint isn't so fresh?\n\nOverall, I was underwhelmed, I didn't feel particularly welcomed either time I was here, and the stock continues to center on polyster 70s clothing and BCBG tops (?) making an uneven style feel and chilly ambiance.  \n\nDefinitely not worth a stop.", "business_id": "0czfEgv9KAD4VlIa7ANPWQ", "stars": 2, "date": "2009-02-01", "useful": 3, "type": "review", "cool": 1}, {"funny": 7, "user_id": "i8hCMZN-0bHENsHZKHpC-g", "review_id": "6GBjCBVtPGsnQ67neAAkjw", "text": "Was boozin and cruisin with my canine comrade. Went all the way out to Hudson via Brecksville/82. Looking for anything to Yelp. Nothing. Not even in the strip mall I used to hit in Hudson on my dry cleaning route back in the day. There was a deli, but it opened at fucking 11! Who even wants to go to a deli after 11? Weak. Breezed through Peninsula. Winking Lizard? Bah. Ended up backtracking through Brecksville and I remembered an old friend. London Pickle Works! Was it still there some four years after I stopped in while house shopping? Yup. Incidentally, investing in a condo down there probably would have made more sense than buying a house in Lakewood. Live and learn.\n\nCozied up to the bar and ordered a Killians, plus cheesesteak to go(for pooch). Like the Unicorn, food was amazingly done before I could chug my brew. I could get used to this kind of service. The bar was all old men. Matt, I don't know how you do it. They were watching Fox news for chrissakes!! Total was eight dollars! Holy shit. I dropped a three dollar tip on that barmaid's ass. How could I not? A real meal at fast food prices, at fast food speed, served by someone not under house arrest with work privileges. Busted open the styro box. Big sandwich with mushrooms, onions, cheez and beef sliced so thin I swear it was a Steak'um. I never ate those as a kid, but I remember one time my friend had one in his bedroom where we were playing NES. He didn't want it, so we threw it all around the room. Fries were awesome. Also got a pickle. That's eight dollars with the beer, just to recap. Great value, nice location, old men. I won't wait four more years to come back.", "business_id": "4P-vTvE6cncJyUyLh73pxw", "stars": 4, "date": "2011-05-25", "useful": 7, "type": "review", "cool": 6}, {"funny": 3, "user_id": "24hyqUROHABynDLYTUpqkQ", "review_id": "vbuArRtzxYv6c359wj07mA", "text": "This place is weird.  So we were greeted by the hostess in front who looked like she was wearing butt pads.  No skinny Cambodian-looking girl would have an ass that sticks out ten inches from her back unless she stuck a basketball in there, seriously.  Then she told us to go upstairs because that's where the real restaurant is at and we were again greeted by another Asian hostess. While walking upstairs, you would feel like you're in a bank's safe box room because seriously, that's what it looks like, no joke.  Fun to play with, but weird.  Am I missing some sort of cultural significance here? \n\nThe place is dark with small tables, chairs and booths.  It took them ten minutes to hand us the menus after being seated which I thought was incredibly appalling because I'm sure they didn't forget about us.  They have candles on the tables which made it kinda uncomfortable because it seemed too romantic for our own goods (We were hungry and randomly walked into this place).  I ain't gonna lie, the food was good!  We ordered some noodles which tasted like mixed flavors of Chinese and Italian.  Surprise, surprise, it came in a tiny portion that can easily be confused as an appetizer.  WTF mang.  There were just too many selections on the menu (sarcasm) so I ordered an eye roll.  For more than a dub, it's not worth it.  But compared to other rolls I've had at other sushi places, this roll melted in my mouth with just the right amount of flavor, MmmM.  As long as its good, I like it.  \n\nI liked how our waiter came back to refill my friend's drink a couple times without being asked.  I like attentiveness.  I like staffs who pretends to be genuine as good as they're faking it.  Having missed our menus for the first ten minutes, the service is above average. \n\nEven if money grew on my orange tree, I wouldn't come here again though.", "business_id": "4uiijOUDzc-DeIb2XcKW_A", "stars": 2, "date": "2010-01-26", "useful": 0, "type": "review", "cool": 0}, {"funny": 4, "user_id": "fJ_qSZH_akvWzHUPMqab1g", "review_id": "d3zJSWMBlpBaYKXYKmTHTw", "text": "I feel compelled to update again.\n\nYES, THE HAIR IS STILL COMPLETELY OBLITERATED.  Some people wonder if electrology works for permanent hair removal, and it certainly does!  I almost was tempted to post a picture of my eyebrow area, but then I felt it'd be weird to have a Yelp cover page of a random swath of hairless brow.", "business_id": "78iZO7fwyQ_Bhq63p4uXxA", "stars": 5, "date": "2013-09-27", "useful": 3, "type": "review", "cool": 1}, {"funny": 4, "user_id": "wOGfOjBaP-lCS1NW_En2LQ", "review_id": "hnEB3NkryrZfG1_Tu58zdw", "text": "If I give Draft House Big Dogs 5 stars, the Big Dogs on Sahara deserves a 4 star review at least.  The beer is brewed at the Draft House location on Rancho, but its just as fresh here.  In fact, when the special brews run out at the Draft House, you can often find them here or at the Nellis location for another week or two.\n\nThe bar food is good too.  The menu is slightly different, but pretty much the same as the Draft House.  The only thing is that sometimes the restaurant has slow service on weekends.  This never used to be a problem, but lately when I have gone it has been.  However, after a few Dirty Dog IPA's, this is easily forgiven.  \n\nTry the cheese curds, and the philly cheese steak sandwich.  The fries are awesome too.  Overall, this smaller version of the Draft House has the best beer brewed in Las Vegas (at their Rancho location), and pretty darn good bar food.  This is a regular hang out for me and my coworkers.", "business_id": "1Lbq92b6B9z1FYk5mS2R9Q", "stars": 4, "date": "2010-12-09", "useful": 7, "type": "review", "cool": 5}, {"funny": 3, "user_id": "UYcmGbelzRa0Q6JqzLoguw", "review_id": "mLjXr-_-jz7Zmz_KvgEaEQ", "text": "On the look out for a new place to try for Sunday football specials, we decided to finally try Big Dog's. \n\nWe sat at the bar to be able to view a few of the games and were greeted warmly by the bartender. She was very friendly and helpful, guiding us through all the specials and giving her recommendations. We decided to start with a couple of pints of Leglifter beer and some hot wings. The beer was their own brew and a pretty good deal. The wings had a nice flavor and we enjoyed them quite a bit. We decided to order some more and went with the honey hot flavor, which were our personal flavor. Spicy, sweet and delicious.We also upped the ante with some Patron margaritas they had on special. Very strong, but still pretty good. \n\nOverall, the food isn't amazing but it was pretty good and the service and the deals were pretty good. Not the best place to view football, unless there are only one or two games you want to see at a time. They only have a few TVs scattered around and it's not easy to see all the games simultaneously. I'll definitely be back to try them again some time soon, though.", "business_id": "1Lbq92b6B9z1FYk5mS2R9Q", "stars": 4, "date": "2012-11-12", "useful": 6, "type": "review", "cool": 6}, {"funny": 5, "user_id": "QJI9OSEn6ujRCtrX06vs1w", "review_id": "uoo7pR86JYX02AlQvJ4RTg", "text": "For the past two Sundays, I've come here to hang out for a couple of hours while my Son is at a Church function.  I enjoy watching the Sunday night football game here and enjoying a drink or two.  Last night I decided to grab a bite to eat.\n\nI was dining by myself and wanted some finger food.  After browsing the menu for a few minutes, I decided to go with the Nachos ($10.50).  To wash it down, I had an Iced Tea.\n\nI watched the Giants/Bears game while I waited for my grub......it didn't take too long before it came....the waitress delivered the Nachos and they were a friggin' mountain of Nachos!  (see pics) Seriously.....I'm not opposed to large portions, but damn this thing could easily feed 4 people!  I was a little pissed because I didn't want to eat that much and the waitress didn't say anything.....also the menu didn't mention the gargantuan size of the Nachos either.  I reacted by saying \"Damn, that's a friggin' mountain of food!\".....she replied \"I know\"......well if you knew, why didn't you say something when I ordered it?!\n\nThis is where I am torn....do I knock off a Star because of this?  or not?  I personally feel that it's the server's responsibility to inform customers of stuff like this....especially when they see someone is dining alone and portion size is not mentioned on the menu.\n\nBack to the food....the Nachos were topped with melted Cheddar Cheese, Jalapenos, Guacamole, Sour Cream, Onions, Olives, Tomatoes.  The thing was so massive that stuff was falling off the edges of plate....another faux pas from the server is that she didn't offer me a smaller plate to eat my Nachos.....she expected me to pull pieces off this mountain and have it fall all over the table like a pig.  I tried for a few minutes but felt like a slob so I asked her for a plate, which she brought over right away.\n\nThe Nachos flavor wasn't spectacular, it was bleh.  The Cheese wasn't gooey....it was melted, but seemed to be sitting a little while because it was already coagulating and it was difficult to eat the Nachos without using a fork.  Also, it was top heavy with the toppings....meaning after the 1st layer of Nachos, there was nothing but bare chips in the lower sections.  What's the point of this dish then?  I don't know.....I felt bad because I didn't even come close to finishing it and it wasn't worth taking home......what a waste of food.\n\nI took off 1 Star because of the bad service.....still a great place to catch a game.  I've eaten here many times in the past with great experiences, but was an inactive Yelper at the time so those experiences are outdated.\n\nWill I return?  Because of my favorable history with Big Dog's, I will give them another chance.....next time I'm asking the server how large the portion is.", "business_id": "1Lbq92b6B9z1FYk5mS2R9Q", "stars": 2, "date": "2010-10-04", "useful": 10, "type": "review", "cool": 6}, {"funny": 4, "user_id": "pMefTWo6gMdx8WhYSA2u3w", "review_id": "EiiK6ayw26wEOb3bF8scqw", "text": "Seeing as there are reviews for Dine on L3 (Yorkdale mall) and Urban Eatery (Eaton Centre), I figure I would review the new food court in Square One which is going by the name of \"Food Central\".  It has the same concept as Yorkdale and Eaton Centre, as they give you real cutlery and dishes as opposed to the plastic ones.  \n\nCompared to Eaton Centre, and Yorkdale, this is a lot smaller, but there is still at least 20 places to choose from including some of the newer entries into the food court wars (Big Smoke Burger, Amaya Express, SU&SHI, Shanghai 360, Chipolte, Szechuan Express) plus the older ones (A&W, KFC, Manchu Work etc.).\n\nOverall, it's not a bad place to eat if you are on your lunch, can't decide what to eat or are just hanging out at the mall, but not worth a special drive (it is a food court after all right?)\n\nAlso, compared to Yorkdale, there's no special sit down restaurants close to the food court besides Earl's.", "business_id": "3Phhm4suJ-9fVakKXJSMxg", "stars": 3, "date": "2013-09-08", "useful": 6, "type": "review", "cool": 4}, {"funny": 3, "user_id": "TbhyP24zYZqZ2VJZgu1wrg", "review_id": "k9Th_Y14GNvDamuR5z8VEQ", "text": "I've been to Mt Everest countless times over the years for their cheap buffet lunch (believe it costs $10.99 now but back in the day it was only $8.99)\n\nTried out dinner here last week for the first time. \n\nI find the menu slightly overpriced. Most of the curries were $15 and that did not include rice or naan. Given this is the ANNEX and the decor/ambiance of this place is quite underwhelming, I think they are overcharging by a few dollars. Other similar type places with much better food (Banjara) have a more reasonable price point.\n\nMy date and I ordered the Dinner for Two special ($36.99) which was definitely the most bang for your buck. You get a platter of tandoori chicken, boti kabob and chicken tikka (two pieces of each), a lamb curry, mutter paneer, peas pulav and 1 order of rice and 1 naan. Some kind of rice pudding for dessert too.\n\nFood was pretty tasty, didn't blow my mind but was definitely good.\n\nService was bothersome for me - very spotty at this place. At times they were over topping off water every 5 minutes, and at other times we could not flag them down to get extra rice or the bill, etc.\n\nLunch buffet is still a great option!", "business_id": "0BJK4_RQnNiiXJcYPEgG3w", "stars": 3, "date": "2011-08-28", "useful": 5, "type": "review", "cool": 4}, {"funny": 3, "user_id": "ZS_SiPpiLocKfYNjRZTeww", "review_id": "OHQu1vhzCu_sr7vorsJIow", "text": "We waited for-ever.  Accompanied by a Nepalese friend we were here to try the Nepalese section of a mostly Indian focused menu.  \n\nThe Choyela chicken appetizer was fantastic; nice to try a different spice flavor than the usual Indian spices we're now accustomed to.  Khasi Ko Maasu goat was the Nepalese non-vegetarian entree I went with.  The menu de-emphasizes meat and lists it second; how dare they.", "business_id": "0BJK4_RQnNiiXJcYPEgG3w", "stars": 4, "date": "2010-12-08", "useful": 2, "type": "review", "cool": 3}, {"funny": 14, "user_id": "73DZUFYAXuycbJ_eEAox1Q", "review_id": "BNnYDdVMPHwHL80r4DfikA", "text": "With as imposing a name as Mount Everest, you might think that this Nepalese restaurant would be a place of epic food proportions. But instead of table-sagging selections of meat, rice, and heavy sauce, we left here after dining feeling full but not overwhelmed by the experience. It's a good place to come for creative and well-crafted North Indian food that will not leave a mark or make too heavy of an impression.  \n\nThe dishes we ordered included a delicious portion of Aloo Tama Bodi (\"Potatoes, bamboo shoots, and black-eyed beans cooked with mountain spices.\") and a vegetarian tasting menu for two. The naan was excellent, as other reviewers have mentioned. The service was efficient, friendly, and elegant. The wine was an Argentinian Pinot Noir from Patagonia, pleasantly different from the norm. It fit well the food that was familiar but with a slight variation in presentation, spice, and flavor that made things interesting without being too intense.\n\nI kind of liked the balance here. Nothing was overdone. Everything was savory and satisfying. It made for a very pleasant meal. And that's something to celebrate.", "business_id": "0BJK4_RQnNiiXJcYPEgG3w", "stars": 4, "date": "2011-02-11", "useful": 21, "type": "review", "cool": 19}, {"funny": 3, "user_id": "XEHZoTDWjw3w-gcQyYIe4g", "review_id": "AYwtdNJNAZvpM6kxqJeMxw", "text": "Maria was super nice and inviting. 5 stars for service and ambiance. This place was clean. The rest room was clean. \n\nThe chips and salsa were excellent, hot and chunky salsa. \n\nFood: I had the two soft taco meal with rice and beans. I mixed the tacos one with Chicken and one with Beef. The beef was carne asada on two small corn shells. Topped with pico. The chicken was chopped into cubes and was \"day old\" at best. It was not fresh. Topped with pico.\n\nThe rice was good but I have had better, the beans were ok but really lacked flavor. \n\nThe \"lunch\" was about 10 bucks and I felt cheated. Maybe I am not a Jalisco style fan?", "business_id": "29XtLRA0y7Nfi4eZF-ZI4A", "stars": 3, "date": "2009-12-10", "useful": 4, "type": "review", "cool": 4}, {"funny": 6, "user_id": "kCVPl2RumlSgSDx9PMfXDA", "review_id": "36sONrBJ8lFV6fDbxpC9iQ", "text": "So....You say you want authentico?? My family secret shhhh! This place is owned by a lady named Maria. We have dubbed this place just \"Maria's\" we have been going here for year's!! When the white folk's around me say let's go to Valley Luna I have to school them on what's real food. This food is pure Jalisco and it is what it is! If you want some good home style cookin' in this part of town I would stop in for a bite! You better believe that this place gets busy for dinner so plan accordingly or don't go at peak times for those who don't like crowds. This is a nice little place w a bar and tv's. My sibling's would live here if they could my sister swears by the green chili burro, not for the weak as it brings the heat. I don't eat meat so I get the norm cheese enchiladas, chile relleno, etc all super in my book. I will take pics soon in the meantime here is a recent write up about the place http://www.azcentral.com/ent/dining/articles/2008/03/20/20080320elconquistador.html\n\nP.S. Closed Monday's", "business_id": "29XtLRA0y7Nfi4eZF-ZI4A", "stars": 5, "date": "2008-04-23", "useful": 11, "type": "review", "cool": 7}, {"funny": 3, "user_id": "Q9mA60HnY87C1TW5kjAZ6Q", "review_id": "QiQlUN1Y51aG_gtuIiAmZg", "text": "This just in! This dirty dirty chain 'za (but come on... the crust is like deep-fried) location now has $7 walk-in specials before 4pm Mon-Wednesday. You know you want to hit it. \n\nNow I'm going to go wash my soul...", "business_id": "5ZQmIhBVOelUScK9UbSUqA", "stars": 4, "date": "2012-08-10", "useful": 0, "type": "review", "cool": 0}, {"funny": 26, "user_id": "zFYs8gSUYDvXkb6O7YkRkw", "review_id": "PE77K89-ELRxd2FuM8MocQ", "text": "\"Picks you up. Calms you down.  Coffee is the lifeblood that fuels the dreams of champions.\" ― Mike Ditka, Kicking & Screaming\n\nWaltzed into Hazelrock on Opening Weekend and I think I ruined someone's video/picture.  Oops?  I came here because my dearest friend told me to so I did!  I had snooped on their website and blog the week before so I knew I *had* to try the Ferrero cookie on top of some other goods.  Between the two of us, we had a cookie, a lemon bar that was recommended by the friendly barista with the cool hair, a macchiato, and an iced tea.  \n\nThe first sip of the espresso sent me straight onto Cloud 9.  It was rich, fragrant, and creamy.  It made Addiction stir and I was hooked by that vixen.  Girl, I will never give you up again.  The iced tea helped clean the palate as well as that super tasty and tart lemon bar.  Could this be fresh lemon juice?  If it was concentrate, it fooled me.  As for the Ferrero cookie, it was everything I imagined it would be and more.  It was crispy on the edges and soft and delicious in the middle.  Nutella and a very generous amount of hazelnuts decorated the top.  It got a tad too sweet with the ample amount of hazelnut spread but I imagine it being perfect with a foamy latte.  I wish they drew a tiny leaf in my espresso...\n\nThe coffee shop itself is very hipster industrial chic --- wood, steal, a bike, a marquee arrow, a mattress sans the cover and fluff, and glass bottles as lighting. It was very cool.  I like the concrete floors and all the reclaimed wood.  I could imagine a young Joyce sitting here with all her other art student friends, the WP Carey business majors working on their stuffy group assignments on the leather couch and arm chairs, and the regular Tempe resident grabbing a cuppa before work.  It's a large space with lots of chairs, stools, and tables for all. \n\nAnd if the drinks and pastries aren't enough to lure you in... they also sell snow.  SNOW!\n\n\"Way too much coffee. But if it weren't for the coffee, I'd have no identifiable personality whatsoever.\" ― David Letterman\n\n#Preach  #GiveMeThatBeanWater\n\n*** Featured in The Weekly Yelp, October 14, 2015 - Coffee Talk", "business_id": "0x2qB4R790SX3W4W8FQuWA", "stars": 4, "date": "2015-05-18", "useful": 37, "type": "review", "cool": 33}, {"funny": 22, "user_id": "M9rRM6Eo5YbKLKMG5QiIPA", "review_id": "Q71GCnterKVFlARdlVvcMQ", "text": "First visit was just OK.  Felt like I was sitting in a garage building.  The coffee and pastry bar sits in a corner far from the entrance doors.  Owners/management: please put up better menu signs to allow first-timers and those who do not know what's available to choose, instead of feeling pressured to order something fast at the cash register- the menu was on plaques placed right in front of the register.  There were a few pastries on display, but the ones that caught my attention were on one of the guest tables.  Looked like bruschetta, but with nutella and chunky nuts.  Apparently, these were being tested for an upcoming breakfast offering.\n\nI liked the cold brew tasting-- four cold brews of your choosing, for $6.  You then get to choose a 12 oz. pour of cold brew, or opt for any pastry/dessert from the case.  I chose Ethiopian, Apple Jack, Blackberry-Lavender, and Coconut.  Funny how the two I thought I'd enjoy the most (the last two) would be my least favorites!  I'd definitely order the Ethiopian cold brew again, and perhaps the Apple Jack with cream.  The blackberry-lavender was too tart, and I could only detect the berry, which was unfortunate, since I love lavender-scented anything: chocolates/truffles, ice creams/gelatos, shortbreads, soaps, and lotions, etc.  The house-made tiramisu was just OK.  Actually, I didn't eat much of it at the time, since I already had enough milk fat and sugar from the salted creme brûlée coffee here, and I ended up throwing away the leftovers at home that night, since most of the takeaway cup was filled with waxy cream filling.  The female rep here told the new guy that he must stress that everything here is made in-house, from the cold brews steeped with herbs, spices, and fruits the night before, to the hazelnut-chocolate spread and the caramel syrup and melted chocolate used in coffees.  \n\nI wished I'd gone with the huge chocolate chip cookie with the house-made hazelnut-chocolate spread, instead of the tiramisu...  I may come back for a second visit, but not before I check out all the other coffee shops I've bookmarked for years.\n\n#770", "business_id": "0x2qB4R790SX3W4W8FQuWA", "stars": 3, "date": "2015-08-14", "useful": 39, "type": "review", "cool": 36}, {"funny": 6, "user_id": "bpgbVPJcG-wQ4cNBcPPIxw", "review_id": "007u5zSRxQhZaF-vFcWQEA", "text": "Cheryl B told me about a new coffee shop that's pretty close to where I live, I'm always up to checking out new places, so off we went to try out some coffee and sweets.\n\nThis place is spacious! Love the light fixtures, they are too cool, the wall deco is great too, I'm sure most would just come for the sweets & coffee, but this place has a nice relaxed vibe to it that you just want to go head and have your coffee there, and just relax for a minute.\n\nAfter checking out the pastries on display I went with the chocolate vanilla bean cupcake and a salted brulee latte. The cupcake was heavenly, the buttercream frosting was just the right amount of vanilla, and the cupcake was moist and perfect. The winner though was the Salted Brulee Latte, oh that is a great latte, the torched of the sugar on top with the warm rich coffee below, it's a cup of heaven I tell you!\nGlad to have found a new coffee spot in my hood, I'm sure I will be back plenty of times", "business_id": "0x2qB4R790SX3W4W8FQuWA", "stars": 4, "date": "2015-06-01", "useful": 10, "type": "review", "cool": 9}, {"funny": 7, "user_id": "kc-rnN-ndnFTdHG4TfIgeQ", "review_id": "0iy3eeueTKOVIqowMwNBOw", "text": "If I would rather repeatedly shoot myself in the junk with frozen paintball pellets than go to a certain bar, then you know it must have a lot going for it.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2008-05-31", "useful": 3, "type": "review", "cool": 3}, {"funny": 7, "user_id": "Oay68SoCl5BcM4XAbt47zw", "review_id": "CSNU9cNiCQXIw_brGVsXbw", "text": "We can't stop here... This is cougar country!\n\nSeriously, this is such a cougar's den. Not just that, but this place has the biggest infestation of douche bags. You need a gas mask just to cut through the Axe, bronzer, and fumes of hair gel that linger throughout the air. If you want a visual of what this place looks like on the weekend, take a gander at: www.hotchickswithdouchebags.com . Click it. It's a real site and it's what this place and its patrons looks like. If you model your style of dress and behavior after VH1 reality shows, drop in for a swig and some high-fives from your fellow date rapists. If not, just pray in thanks that Scottsdale is where it's at and everything you love is where it is.\n\nThere's a live band that plays and I'm not a fan, mainly because it's not my type of music. They play alot of butt rock and the like... basically stuff you'd expect a cruise ship band to have jam sessions to in about 20 years.\n\nThe only reason I'm giving this place 1 star as opposed to none (if that were an option) is that the staff is pretty good. They tend to see that everything is going good and do a good job of bringing what you've ordered on time. Lastly, I feel bad for alot of the waitresses. How they put up with a crowd that takes pointers from episodes of Rock of Love and Tool Academy, I will never know.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2009-02-17", "useful": 5, "type": "review", "cool": 5}, {"funny": 6, "user_id": "zRRurs5wB7er42zvPktv9w", "review_id": "-G7dT6DCFsncKryYrjZGHQ", "text": "Barcelona has the worst way of letting people know that they're closed until mid-September!\n\nEverything was still up like they are still open, website, myspace, all with no indication of their closing. So yea, if you really want to piss me off that's the way to do it, be misleading and secretive about your business temporary closing. \n\nSupposedly, we were referred to PCL and someplace else, and were told to tell them that Barcelona sent us and they'd \"take care\" of us. Unless I'm getting free bottle service to make up for this blunder, I'm not interested!", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2009-07-04", "useful": 5, "type": "review", "cool": 5}, {"funny": 5, "user_id": "dIIKEfOgo0KqUfGQvGikPg", "review_id": "iQu5pgsbv_8aUMy4AQmMXA", "text": "Sutra no longer offers 50% off on Tuesday nights... but Barcelona does.\n\nSo, that's where we found ourselves meeting some friends tonight for dinner and drinks.\n\nIt was a beautiful evening, so we sat outside on the patio.  We went back and forth on using the heat lamps provided.  Chelsea was our server and she was sweet as can be but perhaps a tad bit on the ditzy side.  The guys seemed to admire looking at her (bustier) every time she leaned over the table, and I was nervous something was going to pop out.\n\nAside from that entertainment, the food was decent.  It was not amazing.  I had the chopped salad which was pretty good and big enough to share, followed by the sea bass (no surprise there) entree.  Jared had an 8 oz filet and Zack had a ribeye.  We all shared spinach and sweet potato fries as sides, and the guys each had dessert.  I didn't have any (ahem - wedding diet), but they seemed to be orgasming over the chocolate lava cake... the cheese cake and berry dessert also went over well at the table.\n\nWith the 50% off Tuesday special, this was $30 per person with tip.  For the amount of food we got, this was a deal, but had we payed full price? Not so much... \n\nIf I return, it will be on a Tuesday night for the 1/2 off special.  Other than that, I'm not really interested.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2009-04-01", "useful": 9, "type": "review", "cool": 6}, {"funny": 4, "user_id": "q5zFC4BW1xnIILAZNwbk1g", "review_id": "9urazmzLDBfGJBCKDTXPwQ", "text": "Oh, blessed Scottsdale. If only ye were as slick as ye has imagined. Therein lies the problem with Barcelona and her patrons.\n\nI've long heard this place was THE place to see and be seen in Scottsdale. I knew that wasn't true and had no plans ever to go there. But a birthday party for a fine young man fueled my trip on a Saturday night.\n\nThankfully, we arrived shortly before 10 p.m. --- ahead of many of the plastic millionaires and their shiny chariots. Being the lame, tongue and knuckle dragging fools we are, of course, men had to shell out $10 while women were spared. Once inside, we could see where it was all heading.\n\nIt's an older crowd at Barcelona than, say, whatever club on Mill Avenue in Tempe. But that's not to say they are grown-ups. In fact, it is a lot more like high school than anything else. The uncool cool people prance around while spiced up oldies make communicating with anything other than hand gestures and swirling hips worthless. The black-suited security guards talking into their sleeves every few seconds also offer a real --- if not short-lived and ultimately comical --- feel that this place is actually hip. \n\nIn a word: Underwhelming.\n\nMake no mistake about it, though, Barcelona is beautifully appointed. Leather chairs and sofas make for comfy private lounges for the lucky (or wealthy) few who occupy them. The sprawling patio is an excellent place on a late summer evening in Arizona. Multiple bars make for relatively speedy service. And the overall gargantuan size of the place makes the crowd seem less, well, crowded.\n\nBut alas, this is no place for me. By the looks of the joint, it's no place for diners either. Middle-aged partiers with bulging eyeballs and well- yet artificially endowed gold diggers, on the other hand, are apparently welcomed with open arms. Cha, cha, cha.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2006-10-01", "useful": 1, "type": "review", "cool": 1}, {"funny": 23, "user_id": "UmXzwFM2OkZHWJ5cJZlqkg", "review_id": "WbHGFXE7-nIoXfW2e8ZmCA", "text": "Lions and cougars and manthers! Oh my! Yep. I might as well have been on a safari....the cougars we're thick as thieves. We were here for an event and this joint was jumpin'! Thankfully, it must hold 10,000 people...it is enormous. Lots of different rooms, patios and lounges for the cougars to make their attack. I had VIP service so I can't complain about that. The food was a buffet and was actually quite good. Of course I could have eaten a dish rag and been happy as I needed something to soak up the free Patron. Yep. Free Patron. The crowd was typical for this neck of Scottsdale. Hello stereotype! Could you be any more accurate. I had fun mingling, people watching and leaving. Yep. Leaving. We made a quick escape after I was called a fag in the bathroom by some gelled up, steroided out cardboard head dude. Sorry, just cuz I tried to share a urinal with him. Jeez! What's up with that. Some people are so territorial! I'd go here again, for an event, but never, never for a night out. Adios Barcelona!", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 2, "date": "2009-04-28", "useful": 19, "type": "review", "cool": 19}, {"funny": 4, "user_id": "Iovy9ItislQQuQQVYHR1ng", "review_id": "akIoRd3R26HYQw56b8mOdw", "text": "All I have to say is......W.....T......F?\n\nScene: 6 people in their early to mid 20's walks into Barcelona. Half of them from New York, the other half from San Francisco (or San Fran as the folks in Scottsdale likes to say). Their mouths have dropped and they sit in udder amazement. A band from 1994 gets up on stage and tries to get the crowd of 40 year olds going.  With every song played, the folks from separate coasts, just stand there in complete shock....and then THEY DRANK because THEY HAD TO!\n\nThis place is oh so bad! OH SO BAD!!! Go if you need a good laugh.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2007-12-15", "useful": 1, "type": "review", "cool": 1}, {"funny": 3, "user_id": "CAshvtJZZSHySUQHqzlKgg", "review_id": "L5nMOOBT4Mmpuf5ZB85nMw", "text": "Damn, if this is not the perfect place to meet women. I read some reviews about cougars, well I like milf's. For one, for this fantasy to come true it better happen soon as, I am 36 years old, and the age I prefer to date for long term decreases by the minute. Anyway, this place has people of all ages that is what I liked best. I do wish they had a place of this caliber in the bay area then I wouldnt be single. Then, again, I never met a girl friend at a bar. Anyway, Arizona women are better than Miami. The jury is still out on Texas which most of my guy friends seem to say are the top of the states. Arizona women are amazing.  Okay, back to barcelona if you want to indoor lounge they got it, want to hang out outside got it, want to dance on the dance floor got it. Whatever type of person you are, this is a great place to go if you are the type who can make your own fun.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 5, "date": "2007-04-19", "useful": 1, "type": "review", "cool": 1}, {"funny": 5, "user_id": "sYQyXDjGaJj7wfaqz5u8KQ", "review_id": "bND4TPVQNyx2M75QUQAXqQ", "text": "Barcelona is pretty swanky, there's no doubt about that.  The decor is upscale, with a cascading fountain running down a wall of pottery, jars and other items right when you first walk in the doors.  This is definitely the secret hiding place of sugar daddies and their 21 year old girlfriends, as well as 50 year old women that have been botox-ed to the point that they now look like painfully taut 35 year olds.  Despite all of this, I like Barcelona.  The dance floor is always packed and they play pretty good music.  Personally, I'd rather listen to a good DJ than a semi-cheesy cover band, but hey- I can't win them all.  I made the mistake of coming here for their New Year's 4-course dinner and I still regret it.  The food wasn't good enough for the price and I almost lost an eye when our waiter tried to open our bottle of champagne.  All in all, I think Barcelona can be a fun night spot but I prefer Old Town Scottsdale night clubs to this one.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2007-01-22", "useful": 3, "type": "review", "cool": 1}, {"funny": 16, "user_id": "YORJi2JtQg5Mo4nmKOXzag", "review_id": "TwoZuk6hjydWxjF1W8Kwdg", "text": "So, up until tonight, I've primarily used Yelp as a dating website. A girl thinks my picture is kinda cute. I write reviews that demonstrate I passed high school English. She writes/compliments me... I'm cocky/funny. I offer to explore downtown with her. She turns me down. I try the next girl. Same result. But the intent is always there. After this review, I doubt I'll have to worry about succeeding with any woman who ever reads this review ever again. \n\nSo check it out. I'm a male slut. If I meet you in person and I lay my lines on you and smile in this certain way that I've discovered makes women look away and blush, you'll definitely give me your number and probably go home with me within one more encounter. That's my M.O. It works. If it ain't broke... \n\nI'm not altogether proud of the man I've become but I'm not going to stop either. From what I've gathered from movies and television, my life is fairly wonderful. Unless me writing about it causes some cosmic/karmic shift and I get disfigured in a car accident tomorrow and lose my mojo, I have several strong years of carousing left in me.  \n\nOk, all that said, I've been reading on Yelp about all the \"cougars\" who frequent this lovely establishment. I define a \"cougar\" not by age, but as a woman who knows what she wants (me). So my buddy, who's also a man about town and similarly successful in this field, and I decide that this is our new watering hole. We've been there twice in the last two weeks. Guess how many woman we've taken home or who have taken us to their homes in the last two weeks? Four. Guess how many we've given The Business to... The same four. Guess what our batting average is... .1000\n\nUsually, I need to take a woman out one more time before The Business is exchanged. Sometimes more if she's particularly prudish. Barcelona is where The Business is the understood currency. I like The Business. So if you're reading this and you think I'm scum, I used to be you. I've \"evolved.\" If you're reading this and you're a woman who knows what she wants, shoot me a message. And if you're reading this you think I'm lying because you didn't get laid last time you went there, I am willing to show you how. But you'd never take my advice because you don't believe me or think you'll succeed next time on your own or think I'm an ass for writing this and you don't want to meet me on principle. I don't blame you. I feel dirty. But just a little. Mostly smug.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 5, "date": "2008-06-16", "useful": 8, "type": "review", "cool": 8}, {"funny": 3, "user_id": "Df2qZ03Mjgl1NqprgWXcgA", "review_id": "8xAfq9aXNcc8wN6uP3QIRQ", "text": "So the guys are a little older.  What dont you people understand about free drinks?  I walked into this place on Friday night and was offered a shot of patron before I even got through the entry.  \n\nGod Bless Barcelona.  \n\nThis place has been reviewed so much so I'll stick to the basics:\n\nIts huge.\nLots of comfortable couches/tables/standing room.\nDance floor thats really really packed.\nCover band.  Think Zowie Bowie but lame.  \nOldER crowd, but not creepy-old and not too-poor-to-buy-girls-a-drink old.  \nGreat table/bottle/VIP service\nAWESOME, spacious, asthetically pleasing, modern bathrooms with an attendant.  No lines.\nNo cover for girls, $10 for dudes.\n\nIn summary, aside from the really bad band (if you can even call them that, they just sig over popular music...music that I like, but the singers are so cheesy and weird it freaks me out), I loved Barcelona.  Definitely worth the 15 minute road trip north from Old Town.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 4, "date": "2007-08-20", "useful": 2, "type": "review", "cool": 2}, {"funny": 5, "user_id": "DWbcEKJDBR6vPaNxb00sgw", "review_id": "pXJazWRqNQ3qUwdlFAVLLw", "text": "No doubt that this is Scottsdale's ultimate cougar den. I ended up here two nights in a row because it has a huge outdoor area, it's easy to move around, and hey if a cougar wants sink her teeth into me, and she hasn't escaped from a geriatric home then I wont hold it against her.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2009-05-01", "useful": 6, "type": "review", "cool": 4}, {"funny": 5, "user_id": "WPw0LDmsT5HLc5itX8YLVA", "review_id": "UYNrrxJf3FLeisyo0m4_-A", "text": "This place sucked. First of all, as an out of towner- I have never seen so many old fake orange women in my life. I felt like I was in an episode of The Real Housewives of Orange County: Scottsdale Edition. I am just bitter because I came here for a joyous occasion of a wedding VIP party, but I was denied access at the door because I was wearing tennis shoes. Gimme a break, my shoes weren't some  salvation army shoes. They were quite expensive \"plaid original chucks\" that had character and style. They still denied me in after I complained saying I have never had a problem in LA, SF, NY, VEGAS but clearly Scottsdale I do.  \n\nAnyways, after the $10 cover charge, they gave me a ticket for a free fish taco or something. Sick. I don't want to eat fish tacos at 11pm. This place reminded me of Cheesecake Factory after dark. Everyone is old. They don't have a DJ, instead they have a band that does bad covers of bad songs like \"Wind it Up\" and \"Glamorous\". \n\nWorst part? I saw old guys wearing phat farm tennis shoes and mandals. How the hell are mandals allowed at a club but trendy kicks aren't?\n\nAvoid this place at all costs unless you want to get picked up by a lonely horny housewife of Scottsdale. The themesong to this place should be Nelly's MANEATER.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2007-03-23", "useful": 2, "type": "review", "cool": 2}, {"funny": 5, "user_id": "045lA8joqI1vPm0wLgZPKw", "review_id": "8JqLUP07OyXNl_UYHZSe2g", "text": "I have actually never eaten here and from what I've heard I'm not missing out. \n\nI haven't noticed as many cougars here as everyone else. I tend to see more barely legal females with men who could be their fathers or grandfathers. But anyway, I always have a great time at this place. Yes, the dance floor gets extremely crowed, but the band is great!\n\nMost of the guys here adhere to the following dress code: Spiky hair, orange tan and Ed Hardy or Affliction t-shirts.\nMost of the girls here adhere to the following dress code: Spiky heels and not much else.\n\nIt's a great place to people watch.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2009-03-05", "useful": 4, "type": "review", "cool": 3}, {"funny": 5, "user_id": "Q9NlyapDA97_NA0qaq8w0A", "review_id": "f2S4qKbSPn6L0ZjQWSFtVQ", "text": "Don't quite think it's bringing sexy back....\n\nWhat can't I say about this place that hasn't been said before?\n\nFood:  they have a new chef, so apparently they heard others talking badly about the food.  I actually really enjoyed the food and our server was awesome.  Ridiculously expensive?  Yes.  Good to my tum?  Definitely.  We decided to try a little of everything so in our menu was the Seared Ahi, Chopped salad with bacon dates, Tenderloin empanadas, Mozzarella and heirloom tomatoes, and sweet potato fries.\n\nAhi was seared perfectly.  It had a slightly spicey musky sauce with it.  Very yum unless you don't like raw-ish fish.  Bacon dates are my new favorite.  Mmmm.  Empanadas were good, but you didn't really get much of a meat flavor.  Caprese was wonderfully fresh.  Sweet potato fries....god yes.\n\nPrice per dish around $9 to $14.  You're looking at about $25 for an entree.  Drinks were relatively decent in price...but $12 for a glass of wine.  My favorite Reisling is $12 per bottle, for crying out loud.\n\nThis place is AWESOME for people watching.  Young things with massive...melons of flesh, meat-head men trying to look cool, 50+ women trying to outdo the young things, and 50+ men ogling everyone creepily.\n\nThe singers on stage were quite cheesy.  Great choice in music, but I'd much rather listen to the DJ version than a upscale karaoke.  No dude, you're NOT bringing sexy back with those aviator shades and check shirt.  And whoa...the female singer...honey, you need someone else to do your extentions.\n\nWierd mix of dress code:  from prom date to stained t-shirts.  Ugh.\n\n$9 for a pack of cigs (I don't smoke, but I heard) and you can order a drink in the bathroom.  Wha?  So you can drink and pee all night long and never have to leave the room?\n\nFunny, funny place.  I'd probably go again mainly for the abundance of people watching.  This place doesn't get more than three mainly for the cheese factor and the prices.  At least sugar daddies abound at this place.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2007-08-26", "useful": 2, "type": "review", "cool": 2}, {"funny": 10, "user_id": "VfZ62dxri2CxsSBXgrzqsg", "review_id": "3t7j4w2pG2JiY-Znacqblg", "text": "I wish I could give this zero stars, in the sense that this place is not negative or positive, it just Is. Barcelona is the simultaneously the most awesome and the very worst club I've ever been to.\n\nThere's some sort of Zen shit going on in this space where I should have been having the worst time of my life, but instead I was madly in love with this bar and its motley crew of inhabitants. \n\nThe \"band\" is wildly entertaining yet I also want to open up on them with a flame thrower.\n\nThe men are equal parts hot and cheesy.\n\nThe drinks are strong but taste awful.\n\nI would go here once a month if I lived in Scottsdale, as a sort of barometer for...something. As long as I know a place like Barcelona still exists, I know that the universe still holds mysteries that I'm not ready to comprehend.\n\nBut you'd have to be fucking nuts to eat here.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 5, "date": "2008-10-09", "useful": 3, "type": "review", "cool": 4}, {"funny": 3, "user_id": "9xCdyIxzfV6J-Out6XR2FA", "review_id": "PdvZX0tILXa5DHTydPmJeg", "text": "Massive Scottsdale scene - fake rich guys and plastic women.  Went here for a business meeting and we both ordered steaks which came out extremely rare and had to be sent back.  The waiter forgot other stuff and the food was mediocre at best considering the prices.  The restaurant is run very strangely ... bouncer type guys with ear piece walkie talkie things come around every 15 minutes to make sure everything is going OK ... but in a harassing way.  This place may be heaven for some, but if gaudy large scale club atmospheres with an annoying crowd ain't your thang... stay away.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 2, "date": "2006-12-11", "useful": 2, "type": "review", "cool": 2}, {"funny": 5, "user_id": "uqJ0kCrmZOEZzbt4qV3ODA", "review_id": "WmB7c0AVaPmhctggsaBP8Q", "text": "Oh Barcelona, I visited you with low expectations - and you didn't disappoint.\n\nA lovely young woman of my recent acquaintance invited me here recently for the purpose of attending a birthday party for a friend of hers. Neither of us would have come here otherwise. \n\nIf you're thinking about going, don't do it. If you care for the deets, read on. If not, stop reading here and.... go somewhere else. Please. \n\nWe show up at about 8 for drinks and dinner. I wasn't in a drinking mood, my date's Appletini was pretty Appley but the amount of liquor was tini. Must be why they call it an Appletini. Hm. Highlight was the bread brought to the table - the pretzel rolls were the highlight of the evening. How sad is that?\n\nNow... the place is called Barcelona. Barcelona is a city in Spain. THe closest thing to a Spanish dish on the menu us Paella, otherwise it's a steakhouse menu with a few obligatory pasta dishes. Totally uninspired.\n\nI ordered the ribeye, medium rare. It came out medium, and the glaze and whatever else they put on it were awful, save the two onion rings. I doubt this was USDA prime beef. It just wasn't that good, and the room was so dark that it was hard to see what I was eating. The shoestring fries side were a pleasant surprise - a giant mound of crispy potato. \n\nMy date had some kind of pasta with shrimp dish. The shrimp were overdone, the pasta was, ok. Denny's pasta is OK, too, and let's face it, so is Chef Boyardee... So don't read too much into the complement. \n\nBarcelona. Spain. The place doesn't look that Spanish on the inside. There is a giant mural on the ceiling, dim lights, it reminds me more of Las Vegas cheese than Spain. \n\nWhile you dine, there are two Scottsdouche (or is it Douchedale?) types crooning back and forth to each other on stage. Is this where failed American Idol contestants try to relive their moment of glory? I don't know. They made a reappearance later, singing along with a DJ to a selection of bad 90's pop music with the occasional 80's party jam. \n\nThe crowd is douchey. The food is awful and on the pricey side. The service, spotty. \n\nIf you're coming for the thing Barcelona is famous for, you'll find a lot of it. If not, stay away. Far, far away.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2009-03-09", "useful": 5, "type": "review", "cool": 4}, {"funny": 3, "user_id": "8lL-554wLEOxCrroFa4aeg", "review_id": "ifFGkAOOftxh5EFoHBfFmw", "text": "I must admit, I'm a tiny bit embarrassed that I LOVE this place.  When a group of us girls get together, pull out the party dresses, and break out the spray tans this is where we go!  First off, the place is huge with a large patio, so there's always somewhere to walk around and grab a drink (unlike PCL and SIX....too small and you only have room to stand there awkwardly until you've had 3 or 10 drinks).  The band, Envy, is the best thing about the place.....the 2 good looking guys and the cute girl put a ton of energy into performing top 40 stuff.   \n\nOn top of that, the people watching......wow.  There's a big age range from 20's to 50's, and yes, the cougars are on the prowl and there are creepy guys a plenty.  That's part of the entertainment!  \n\nI haven't eaten here, so the 5 stars is definitely for a Friday or Saturday night out.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 5, "date": "2008-10-05", "useful": 2, "type": "review", "cool": 2}, {"funny": 3, "user_id": "85gI4BQZ9zMtqkQ33niGWw", "review_id": "vwNs1sfbrwmE_UUQTQVxig", "text": "if Michelin Guide reviewed and rated cheezy pick-up bars targeted for 30+ suburbanites, instead of fine european restaurants, barcelona would earn 'trois' stars! \n+many bars staffed with former hooters waitresses \n+live band playing the best of Wham! (sorry Wham!) \n+big dance floor \n+DJ while band is on break \n+just-right lighting so that beer goggles engage early \n+indoor and outdoors areas offering many opportunities to seek out new 'friends'", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2008-12-17", "useful": 4, "type": "review", "cool": 4}, {"funny": 4, "user_id": "8s57wy5KkaqsnOzH4I_upg", "review_id": "J4bnwveuNb0dxoxWedisZg", "text": "Ok, so the atmosphere is great here in terms of being upscale, but there are some negatives.\n\n1.  Cougars on the prowl - lots of hot, old women who are on the prowl for younger guys....they are full of botox and silicone.  I guess this isn't always a negative, as it does help boost ones ego, but sometimes the way that they are desperate is sort of lame.\n\n2.  BBQ - If you're sitting outside on the patio, prepare to smell like BBQ chicken after you are done.  I don't know who designed this, but it was pretty poor engineering.  You don't build a BBQ in the middle of the lounge, so that your patrons get smoke in their faces.\n\n3.  Fancy Cars - Sure I love Ferrari's just as much as the next guy, but the fact that they put them in the front is sort of lame....like they're trying too hard to make themselves look uber-cool.\n\n4.  Lounge singers - they have had the same lounge singers, singing the same songs for years.  I thought that the girl was hot, but she's more of a Monet (good from afar, but all messed up when looking up close)\n\nAll in all, I give them a 3 for entertainment value (humor).  This isn't exactly the best nightclub in the world though.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2007-03-29", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "UVxY0iyPaqY7s4BSFtt-xA", "review_id": "_Yq4KPS7_UFTGcOaTzsuxg", "text": "Snotsdale at its finest! This place is a large bar/night club that was built by Danny, of Danny's car wash fame, who made millions keeping cars clean against the dust storms and monsoons of the Valley of the Sun, and needed a good place where he could go dancing with his woman. \n\nIt actually is a restaurant, too. The food is Ok. The Paella is huge and not bad. They try real hard to make this place the chi-chi joint for the hip resort/snowbird crowd. It is huge, with several dining areas and bars, a large patio, and a small stage and decent dance floor. They usually have live music on the weekends and intersperse with Disco DJs. On weekends you have cowgirls walking around with their \"shooters\" holsters and shot glasses thru the 4 bars. A lot of the waitresses (not just here, but in most of Snotsdale's higher end joints) are part time ASU coeds trying to make a buck to buy more short skirts and halter tops at the mall. \n\nEveryone at night is pretty much trying to create an impression beyond their true reality, whether it is the young diggers or the old farts. If you are from Dallas or Calgary, you will probably like this place for its unapologetic panash for conspicouus consumption.  \n\nThe food and drinks are overpriced; the eye candy plentiful; and reality is far, far away. Bring your Cheesehead friends from Wisconsin in November and they will be impressed.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2007-09-01", "useful": 3, "type": "review", "cool": 3}, {"funny": 6, "user_id": "0ygVMZZAaw2DKBGptbuWNw", "review_id": "PK22124GDh6PpslqgJOkOw", "text": "I had stopped by The Blue Moon a few years ago during a drive across country.  I had gotten a $20 day pass,  and had a pretty good time by the pool with my friend.    At a time, there had been some porn stars frolicking in the water, they were making hamburgers (the staff, not the porn stars),  and the place had a sort of 80's, West Hollywood-camp charm.\n\nRecently I headed to a trade show in Vegas, and for the first time my hotel room wasn't being paid for by my job, so I decided to try out the Blue Moon.\n\nPROS:  \n\nFor me, I like that it's off the strip. (Less traffic, not as many obnoxious tourists, etc.)  Also the biggest selling point for me is your proximity to your car.   (you are definitely going to want to rent a car if you stay here, in my opinion)  I absolutely hate the self parking rigamaroo  and subsequent trek through throngs of casino-goers and  miles a dreary, carpeted passageways just to get to your room that is the norm at most of the big hotels.   here you just open your car door and step inside.   it's an old TravelLodge,  so you get the idea of the setup.\n\nSince it is a gay-owned and operated business, there are a few feel-good points awarded for staying here, and supporting the community.   stuff is generally very nice and the owner is attentive, and seems to get what people want.\n\nThere is a nice breakfast spread in the morning including  2-hour coffee, which is a bonus.\n\nThere is a steam room and  kind of seedy  porn watching area,  if you're into that.\n\nCONS:   \n\nDon't go there expecting to meet a porn star.   I'm sure it happens, but this isn't the cast's quarters for Chippendale's, lol.  \n\nIf you want to have guests at the hotel, you sort of have to go  down and let them in at night.   not a big deal, and it makes sense from a security standpoint, but is not as freewheeling as some other places.\n\nIf you are used to staying at the Bellagio,  and need to park next to a Bentley  to get yourself through the day,  skip this place.   as I said, it is campy and fun,  not glamorous or chic.   but at the end of the day, ask yourself... what is Vegas really all about?", "business_id": "8KWWHywMjN-154i_Qi0deQ", "stars": 4, "date": "2010-01-14", "useful": 8, "type": "review", "cool": 4}, {"funny": 3, "user_id": "QQoZeJszS2mWhMRcs5og4Q", "review_id": "GjcERxzREIVo7YIDkTqgHA", "text": "If you are looking for an all men's gay hotel in Vegas, this is your one option and it falls into that tough category of:  because it's gay, we'll stay there to be with our people.  So, we did.  Our first time.  Thankfully, we paid the Sunday night rate and we got that value.  The place as a whole is a little rough around the edges.  Other guests we talked to love the place and return.  We probably wouldn't.  It's the little things: no luggage rack for suitcase, no towel bars for bath towels (install a couple of hooks?), exposed wires on the walls (and extra bunched on the floor) for accent lighting, a foaming soap dispenser at sink and shower (really?  like a truck stop? I'm all for conserving on little bottles and soap bars - install a three-way liquid soap dispenser and that way you can also offer your guests shampoo and conditioner - which they don't now.  $16).  The back stairs that lead to the pool over look areas of junk.  Trash by the pool equipment etc.  So easy to just throw that stuff away.  It's in plain sight of guests and just adds to the attitude of general lack of care.  So, picky?  Well, maybe.  But, these very simple little things are what sets apart hotels and makes for a guest wanting to return.\n\nNow, the good stuff:  the Sunday pool party was very busy and fun.  Maybe 40 men (mostly au natural) sunning and frolicking.  Guests seemed to have a great time (bring your own cooler).  Breakfast was really excellent (a big pleasant surprise!).  Bed very comfortable and linens all nicely clean.  Very friendly and helpful staff.  Free WiFi worked well in the rooms.  Large steam room was nice.  Video room was popular.  And, with the day pass system, you get to mingle with some local boys, too.\n\nSo, for the gay boys who like to roll with the boys, have a great time!  We'll pass next time.  But, then, we live in Palm Springs and get plenty of gay all the time.  For others not in that position, they'll have a different perspective.", "business_id": "8KWWHywMjN-154i_Qi0deQ", "stars": 3, "date": "2013-07-16", "useful": 8, "type": "review", "cool": 2}, {"funny": 3, "user_id": "Dblp5OGCcUWTRnE-KVwcXw", "review_id": "S8Jg8rkG4AyxtVj6cASoGQ", "text": "Okay - went for the first time - and - well - It took me about 24 hours to really appreciate this place.\n\nIt is not right on the strip but holy cow you can drive up a side street - take a left and drive right into the Wynn and park.\n\nFor those of you used to lots of luxury - this is not your place to go.  I am a bit spoiled - but I appreciated the slow pace and the men's only atmosphere. \n\nI enjoyed the relaxing atmosphere and the slow pace.  \n\nThere are only a few things I would ask that they do.\n\n1) have each room set up with a book that details the locations and areas of the different things for the hotel.\n\n2) there needs to be an monthly updated calander in the each room\n\n3) there needs to be a better list of gay clubs and venues as well as the times and locations,.\n\n4)Towels need to be replaced and all the lights in the rooms need to work.\n\n5) The coffee in the rooms needs to be free.  2 bucks for in room coffee is a pain in the butt.  Raise the room rates a smidge to help cover it. \n\nThis in an older hotel and I understand that - for those of you who can,..get a suite on the pool side of the hotel.  It cuts down on noise.  You can also peek at your car in the lot.\n\nStaff is great - be prepared for the fact that most of us who can afford to vacation have worked our lives and are not so excellent looking,..LOL!\n\nAll in all - I would encourage you to try it - get the parlor suite - pool side view and dont go in with attitude. The convience to get to the strip is awesome if u have your own car.", "business_id": "8KWWHywMjN-154i_Qi0deQ", "stars": 4, "date": "2011-01-19", "useful": 6, "type": "review", "cool": 0}, {"funny": 12, "user_id": "wQ0sfn7h5n99Hhpbyg-TYA", "review_id": "EMqJ3_3SxxBI2VOVaATfyA", "text": "Okay, let me state the pros up front just to be fair. \n\nDavid is the owner and he does answer the phone, and gets up to the front desk fairly quickly when you walk in.  \n\nBe aware that the day pass is only good until 8pm, then light's out honey, on your way home if you are visiting without having a room there.  \n\nThey do have a very nice pool with a waterfall shower, and privatized (walled-in jacuzzi).  It is clothing optional, so try to be nice to those who are over-endowed :)\n\nAlso, to be fair, the whole place looked clean.  \n\nFinally, decor and music are totally gay chic, good for him. \n\nTo be fair, I didn't stay in the hotel part, so you'll have to check for yourself on their quality.  Hopefully that matches the price. \n\nOkay now the cons.  First it is really hard to find if you're not local.  Cab drivers haven't heard of it so bring the mapquest with you. \n\nDavid is kind of a jaded indifferent queen in my opinion.  Okay to be fair, yes it takes one to know one.  But he did something no retail queen should.  I asked him where the towels were and he said oh by the blue tins at the pool - of course when I get over there all the towels in the bin are - you guessed it...WET. \n\nOkay, could happen, he could be busy while supplies don't last, but then he got all huffy about having to get me a clean one.  \n\nAlso, David, honey really do SOMETHING to upgrade that locker \"room\".  It looks like it should star in a scene of \"OZ\" - the one about the prison .\n\nAlso, he has that cell phone plastered to his ear.  And not the incoming calls asking questions about the place either.  I really don't like it when retail queens make waiting paying customers seem like we are interrupting their hot gossip session when they are behind the counter. \n\nI know, he and others will say - it's  his place, he can run it the way he wants.  Well, attitude can be everything, and he needs to work on his.  We do keep him in business.  After leaving the interactions with him I only felt slightly welcome to come back, us customers can be SUCH a nuisance when he is trying to have a juicy cell phone conversation.   \n\nIt's nice that he provides internet, although it's screaming slow to load, and definitely not Comcastic.  \n\nFinally, if you plan a massage, they are by appointment, so schedule ahead, their massage guy is really hit and miss.", "business_id": "8KWWHywMjN-154i_Qi0deQ", "stars": 3, "date": "2008-06-10", "useful": 14, "type": "review", "cool": 4}, {"funny": 3, "user_id": "bpgbVPJcG-wQ4cNBcPPIxw", "review_id": "thagXgeH2Cjaqz4p9Fg3Kg", "text": "Its Friday night, and it's a 1st date night, so I got to pick the place, and I had already confessed my Yelp obsession, but really is it an obsession when you are continually finding the best of places within your area? Yelp hasn't led me wrong yet...but anyways, I had wanted to try Matka, was starting to see the reviews and thought oh it's time to check this place out! When I suggested it he said yea sounds good.  That right their gave him some points, cuz it's normally my girlfriends that I talk into going with me to try new ethnic cuisines.\n\nSo got their around 6:30pm, Date looked cute & fly! We walked inside and saw we were one of the 1st people there, the owner, who was present was very friendly and helpful with everything. The place is very cute on the inside; I think we were early, because we had decided on trying out the dinner buffet to try a little bit of everything, and the owner asked us to give him a few mins to get all the serving spoons out. No problem we stayed at our table and sat and talked,  then owner said its ready! Oh yea baby I was starving and ready to go!\n\nI tried a cauliflower dish, don't know what it was called but god it was good! Spicy, smoky and just delish, had a potato dish too, think its called aloo methi? Man that too was packed with little bit of heat, but not in a bad way, those 2 dishes might even get me to be a vegetarian for maybe a hour or so, um maybe not because I then spotted the butter chicken in that creamy orange sauce and the chili chicken with big slices of jalapenos and though who can live on veggie alone! Both the butter chicken and chili chicken are white meat and so very delish, also had some of the vegetable biryani and nana bread too.  Meal and Date were perfect! It was a good night!\n\nAlso side note, my date tried the goat biryani and thought it to be spicy and told the owner, who tried it and said yea it's on the spicy side, will make up a new batch right now, now to me that's excellent service!   \n\nI hope to see Matka stays around because I sure do plan on coming back!", "business_id": "3wJ4kJsJhayyfJ30HsS04g", "stars": 4, "date": "2012-04-30", "useful": 3, "type": "review", "cool": 3}, {"funny": 8, "user_id": "QuZbJquRtbY9O9JrB9NpxQ", "review_id": "9vKj0Wus0sia5yUa1h59sg", "text": "The Mill Avenue Farmer's Market is the bantam weight of farmer's market's in the valley.  \n\n\"Weighing in at 113 pounds, in this corner of the valley we have MILL mill AVENUE avenue FARMER'S farmer's MARKET market!  Let's get ready to haggle!!\"\n\nWhen we arrived around 9:45 am there were about 8 stalls, one with produce.\n\nDiminutive comes to mind.  \"The Mill Ave. Farmer's Market was reported to be rather diminutive, with only a smattering of stalls and little produce to be found.\"\n\nPetite.  The Mill Avenue Farmer's Market would need a little padding to run with the college girls, know what I'm saying?\n\nPee Wee.  The Mill Avenue Farmer's Market had a very good game today at the Kiwanis Rec Center and is now celebrating over Gatorade and granola bars in the picnic area.\n\nYou get the idea.  We left to get some coffee and returned about a half hour later to find 3-4 more vendors.  There was a honey vendor, hummus, cookies, produce, a couple sandwich places, flowers...and the one place with produce.\n\nI'll give it some time as they are new.  I'm hoping in a month or so they will have a better turnout of vendors.", "business_id": "19jV_YngqOH0h40IxItUKA", "stars": 2, "date": "2010-01-31", "useful": 10, "type": "review", "cool": 8}, {"funny": 4, "user_id": "pKn_H1nkgrwJS6TuHODsvQ", "review_id": "sv0Z8cKcYLWrtfSs5uLQcw", "text": "The \"Little Engine That Could\" should offer a lesson to the Tempe Farmer's Market. Because it isn't what is claims to be. Aside from the token produce stand, the token honey stand and the token olive oil stand, this place really doesn't have a leg on which to stand. That's a shame. But, that's a college town. \n\nWhen I found out this farmer's market has been existing for about four weeks, I was truly disappointed in the turnout, because a dozen vendors do not a farmer's market make. While there is a great potential for this to be a great destination, I question whether or not Tempe--downtown Tempe at that--is an appropriate location for such a market. I'll keep my judgment to myself in the meantime and continue to shop here. At least there are alternative shops abroad.", "business_id": "19jV_YngqOH0h40IxItUKA", "stars": 3, "date": "2010-02-01", "useful": 8, "type": "review", "cool": 6}, {"funny": 3, "user_id": "QjEHA4t7BovzKVeH8TzT2A", "review_id": "cUkR2ngp87w0XPE4WNV6HQ", "text": "I absolutely HATE that I can say this... but, I remember the days when Mill Avenue had a different feel to it. There used to be fewer chains and the vibe was much more bohemian, making it more or less the only part of the Valley with any personality. Several years later, visitors to Mill Avenue really just go to a simulacrum; a soulless husk of an Old West-ish main drag. Don't be fooled by the \"historical buildings\" on the street, as a number of them are over a century old, but quite a few were built architecturally designed to look old. I can appreciate the aesthetic value of it, just as I can appreciate the attempt to make a walkable neighborhood. Unfortunately, only this synecdoche of Tempe is walkable: the majority of visitors have to drive to get here (not good for a bar-hopping/drinking-and-driving destination) and the lack of amenities would still make it difficult to live and work here without a car, unless they shop for groceries at the corner CVS. Its proximity to ASU is likely to keep it a popular destination, as is Downtown Phoenix' laziness and willingness to let Tempe take prominent events (i.e. Oktoberfest, New Year's Eve,) but all in all it's worth avoiding.", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 1, "date": "2010-11-21", "useful": 3, "type": "review", "cool": 3}, {"funny": 6, "user_id": "sm_UfNstcaknjAY1h1rvPw", "review_id": "P7PZpJKJwPWlu2fOQm9zog", "text": "Best Feature: Ambiance\n\nI'm gonna have to be brutally honest with you, Mill Avenue is not the coolest place in Tempe.  In the old days, Mill was more of a bohemian paradise, with hippie street performers, people walking in the street and a cookie shop that opened it's doors and wafted the smell of cookies through the air.\n\nToday, the Mill Avenue District (Isn't \"District\" a bit lofty of a word to describe a two mile strip on one street?) has been more commercialized.  Now, that's not necessarily a bad thing - look at 3rd Street Promenade in Santa Monica, that's commercial and fun.  But Mill is home to several bars, 3 clothing stores and a mixture of expensive and inexpensive restaurants.  If they had truly thought out their expansion, they would have branched out a while ago and made an \"arts district\" a \"shopping district\" etc.  As it its now, they have no idea what it's supposed to be, but they slapped the \"Mill Avenue District\" name on it to give people the feeling they're living in a real city.\n\nMill's real problem now is that the buildings are too expensive for anyone not representing a giant company to afford.  Even if they somehow afford one, the rent and the lack of people buying things usually drives them in the ground (Swell Clothing RIP).\n\nHowever, Mill is not without it's merits.  If you ARE looking for a place to get drunk, it's very convenient, especially for ASU students.  Slices is a great no nonsense pizza by the slice joint.  Occasionally, there are events like the Arts Festival, which end up being fun.\n\nOverall, Mill is better than nothing, but it's got a long way to go.", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 3, "date": "2008-05-17", "useful": 7, "type": "review", "cool": 5}, {"funny": 7, "user_id": "qD51vvp5Zf5DgPEGy7yfDQ", "review_id": "OVMd2dAjr0LE7uHrujZfUA", "text": "What is with the noisy birds?  And the homeless?!?\n\nIt's like Berkeley in a rainforest.", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 3, "date": "2009-01-23", "useful": 4, "type": "review", "cool": 4}, {"funny": 6, "user_id": "l-B4axUNxQ9FVVxeQm8t2A", "review_id": "e4aVQyuLf9IJfwcQChZIFA", "text": "Mill Ave was packed with local stores and had a quirky, fun college town feeling in the 1970s when we moved here. Locals (my family included) went there all the time. Then our city fathers decided to \"improve\" Mill Ave by \"yuppifying\" it and chasing out local business and pursuing national chains. The death knell was when they built Tempe Marketplace. \nFYI--parking spots are metered and parking is very tight. The City of Tempe also shuts down Mill Ave for events like the arts festival and for ASU games, so you really never know if you can even drive through the district. Our family avoids this area.\nThe new plan for attracting customers to Mill Ave is to spend MILLIONS for a slow motion trolly that will block/impede the right lane of Mill Ave in both directions from Southern Ave directly to and around Michael Monti's restaurant. Can you spell BOONDOGGLE???", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 1, "date": "2012-08-14", "useful": 5, "type": "review", "cool": 3}, {"funny": 3, "user_id": "-0IiMAZI2SsQ7VmyzJjokQ", "review_id": "xDGTRDVxDGNt-01KVjn_qQ", "text": "Mill is where we end up going when we can't think of anything else to do at night. \n\nIt's a college town main drag. Expect bars, head shops, overpriced clothing stores (Urban Outfitters, etc), chain restaurants, the occasional hole-in-the-wall, off beat eateries, and hordes of drunk 20 somethings shouting and vomiting on each other. \n\nIt's the small businesses like Old Town Books that keep it interesting. They maintain a small selection of books outside, after hours, and you shop on the honor system by sliding a dollar under their door if you take one.", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 3, "date": "2012-10-31", "useful": 6, "type": "review", "cool": 3}, {"funny": 4, "user_id": "TeHp5f1KY_7Mh-swUWSjuA", "review_id": "dhDZaWHLD1XUSgTeO5dKEQ", "text": "Many date nights on Mill Ave while trying to make the most of Phoenix night life scene.  Located in Tempe and close to the University.  It's a snippet of the kind of night life I'm accustomed to.  But if you happen to find yourself in Phoenix and wondering what to do or where to go.  Start here.  There's a variety of restaurants and bars to try.  It's walkable and beats sitting in your hotel room watching t.v.  You'll be in college area territory so things can get interesting.", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 3, "date": "2016-01-20", "useful": 9, "type": "review", "cool": 11}, {"funny": 3, "user_id": "v65s1beaC6UmT_beUJ0Jmg", "review_id": "blMeGTwmqNqzLUnQ7MNOLg", "text": "I visited Mill Avenue yesterday afternoon after a long period of avoiding it, mostly because of the parking situation and the aggressive panhandlers. It's been a while, I thought, and many of the corporate chains that ruined the street are fleeing as fast as their trucks can carry them off. It's worth a shot. \n\nI attempted to park in front of the now-vacant Z-Gallerie, only to find that meters had been installed. Of course, nobody carries change nowadays, so I followed the blue sign that read \"Public Parking\" and wound up in the virtually empty parking garage. I spent less than an hour on the street, and when I was leaving the business I'd come to visit, I asked about having my parking pass validated. \"We don't do that any more,\" I was told. \"They took our equipment. Anyway, the first hour's free.\" Back at the parking garage, I was surprised when the attendant in the booth, without a word of greeting, said flatly, \"Two dollar.\" \"Two dollars?\" I asked him, explaining that the first hour was free, at least according to a business owner on the street. \"Two dollar,\" he said again. I had no cash, and told him so. \"Two dollar. Two dollar,\" said the parrot in his little cage. I asked him where I could get cash on the street and he said, exasperated, \"Is two dollar!\"\n\nI backed up (unsurprisingly there was nobody behind me), parked, and, already running late for an appointment, walked to the kiosk at Bank of America, was asked for spare change by a kid lounging on the sidewalk, crossed the street, re-entered the parking garage, drove up to the booth, and again presented my parking pass to the attendant, who now said, without irony, \"Three dollar.\" Evidently it cost another dollar to walk across the street to pay the already extortionate sum of two dollars. Wordlessly I handed him a twenty and, ignoring the faint smile on his lips, left Mill Avenue, this time for good. \n\nThe last time I visited Mill (more than a year ago), I received a $40 parking ticket after having lingered too long in Borders -- another business that I see has pulled up stakes and fled for a more profitable street. At the time, though, Mill Avenue was bustling. People wanted to be there. Yesterday the street was virtually abandoned, the storefronts mostly empty, the few people I encountered seemingly killing time between classes at ASU. In short, it was devoid of life. And for this they charge to park? For this they make things as difficult as possible, both for visitors and for the businesses nobody wants to visit anymore? And why would they, when they can visit the same chain stores selling the same items in any mall in America? But as usual, it's the independent businesses who suffer -- the ones who were forced out during the first wave of Mill Avenue's corporate takeover, and the ones there now, who are fighting for their lives.\n\nWhat they've done to this once-charming street is a travesty.", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 1, "date": "2009-04-01", "useful": 4, "type": "review", "cool": 3}, {"funny": 3, "user_id": "3cC726zwgerKNNasnidAww", "review_id": "mDhbI9ryxeKxx5PTFkOOFA", "text": "I'm 30.  That makes me at least five years too old to be on Mill Avenue to bar hop on a Saturday night (unless you're a transient).  Although I have to admit that I enjoy stopping by every few months for the nostalgic value.  It brings me back to my college days at ASU even though most of the places I frequented back then are gone.\n\nMill is a great place to go get something to eat.  Maybe even hit up a bar or two after a football or basketball game.  But if you're no longer of college age.  You may want to avoid it at all costs.", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 2, "date": "2010-09-13", "useful": 3, "type": "review", "cool": 2}, {"funny": 4, "user_id": "Q4Qfu-3vYtL1LRm2X1b0Gg", "review_id": "fHxlJcqovuYTCgTBdPauJA", "text": "Too bad this Mill Ave. district reviewing isn't separated into different eras.  I preferred the pre-Millenial Ave. days, such as the early 90's right when the expansion started and it was \"the place\" with fresh shops that were all OPEN, and fewer of those annoying homeless people asking for money or tampons.   This was when the Coffee Plantation was locally owned, had coffee carts on campus at ASU, and the coffee was actually somewhat good.  Mill had so much traffic of people cruising that the police had crude anti-cruising measures set up to reduce the traffic.  Even though I never ate at Long Wong's and a few others that are gone, it is sad to see them not there.  No... SLICES and THE LIBRARY don't cut it for me.", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 2, "date": "2009-08-10", "useful": 5, "type": "review", "cool": 5}, {"funny": 3, "user_id": "RBZ_kMjowV0t6_nv2UKaDQ", "review_id": "i6ZSyXE7mccSe5U3rgvtZQ", "text": "I have to give Mille Avenue a positive up for the mere fact that they might be the only district in the Valley that have adopted parking meters with an option to pay by credit card! It's great. I can't count the number of times that I need to park in a meter but lack the change needed. However, with these meters, all I had to do was swipe my card and poof! I was able to put time on the meter.", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 3, "date": "2012-01-24", "useful": 8, "type": "review", "cool": 3}, {"funny": 11, "user_id": "YpGt3hdq5adPlEFn9fQ2Zw", "review_id": "d_OuJwxagiHTmAMybnxadA", "text": "You're getting old. Your college days are over, and you have a crippling fear of \"douchebags\" or lightly dressed women who remind you how much weight you've gained since graduation. You tiptoe through the mainstay restaurants like Rula Bula while avoiding Sun Devils at every cost. Then you post unflattering reviews on Yelp while secretly knowing you've enjoyed every trip.\n\nMill Ave falls somewhere in between posh outdoor strip mall that tickles every fancy to unnavigable, clogged road, full of drunkards and the cops who babysit them. Either way, I'll be having a blast. Think to yourself: Where else in this town could you stumble out of the bar at 2AM, find yourself in a hookah bar until 4AM, then grab some cheap eats and chat until 6AM, when the booze starts flowing again. It's a cycle that can last as long as your wallet or organs do.\n\nSeriously though, there's no place I'd rather be taking a stroll in the middle of the night. Paired with all the epic times I've had here with or without getting hammered, I'm afraid this is as good as it gets in these parts.", "business_id": "0xbfoylmBOjoKKYDwawTkw", "stars": 5, "date": "2011-04-20", "useful": 10, "type": "review", "cool": 7}, {"funny": 6, "user_id": "bLbSNkLggFnqwNNzzq-Ijw", "review_id": "JpOj7ebLwM6lqCLb6W3kog", "text": "This is the closest smog spot for me- exterior isn't anything fancy, and no one was here when I walked up. Check in the adjacent gas station convenience store and someone will be right out...\n\nThere are posted notices about a discount for using cash, but no posted prices? The employee who helped me was friendly, but a bit odd. He rather discretely whispered to me that he was going to charge me $20- which was the regular price printed on the form, so I'm not sure what the deal was there.\n\nNot the best area. A homeless guy was standing around telling me I was pretty and making me extremely uncomfortable before the Smog guy shooed him off. Over and done with in under 5 minutes though, and he gave me some helpful tips about registering my car.", "business_id": "2hHtmzmY4glqGYYGr2MQjQ", "stars": 3, "date": "2015-08-26", "useful": 2, "type": "review", "cool": 2}, {"funny": 3, "user_id": "_jjbwHWLFA5GjWFWGLj4ZQ", "review_id": "tfITstL4oNokLtqf8vccSA", "text": "5 & Diner.  Why do I keep coming here?  No, seriously.  Why?\n\nOkay, it's the sweet and sassy waitress.  She can sell me anything.  Even dessert, when I am not hungry.\n\nThe food is mediocre.  I recommend sticking with breakfast items.  On this last visit, we ordered dinner.  The pot pie was okay and included a big dinner salad for about $8.  Not bad.  \n\nI somehow ended up spending $40+ for two adults and two kids on my last visit, even though kids were supposed to be 99 cents with the purchase of each adult entree.  \n\nPart of the inflated check was that the aforementioned waitress upsold the dessert to us at $3.99 per slice of cake or pie.  Let me review that dessert now.\n\nCarrot cake?  Nearly inedible.  With two people splitting a piece, 1/3 of it got eaten.  It tasted like it had been in a freezer.  DH, who loves carrot cake and could eat a whole sheet by himself could barely swallow a bite.  The 9 year old girl who ordered it said... \"this does not even taste like carrots.\"  I thought it tasted like a dry spice cake that had been frozen for a few months and then defrosted on the counter overnight.  \n\nCherry pie?  YUCK.  I split a piece with DD on her insistence.  I ate two bites.  I have to admit I am no pie connoisseur, but this was NOT good.  It was too-sweet, canned cherries in a tasteless crust.  Every cherry pie I have had before has had tart cherries.  I don't know how they got these that sweet, but it was just disgusting.  If a 4 year old who is usually never allowed sweets cannot finish off dessert, there is a problem.\n\nStill, the atmosphere is cute.  The decor is interesting for the kids.  \n\nBut if I ever remember that the food is blah, I will avoid this place.  I just don't ever seem to remember it until I am sitting there eating it!", "business_id": "6Rrlg6hnM0ir7ijhKG2ybA", "stars": 3, "date": "2012-06-12", "useful": 4, "type": "review", "cool": 0}, {"funny": 3, "user_id": "0lCYr2gf5EPIFwlepq4h_w", "review_id": "qJQYn_0nxoG7_cD_3PHJ3w", "text": "Well, don't go hungry. Me and 8 of my friends went here for girls night. The point is share the food tapas style but when you get tiny morsels of food (from $12+ a plate) its barely enough for one person to enjoy. (4 pieces of fish the size of quarters is $16??) Please. The service was good, and the ambiance is contemporary and inviting, however it's not the kind of place to indulge in, just feeling like snacking and paying $70 a person for basically an appetizer. If you feel like a tapas style night, there are a half dozen other places I could would rather go.", "business_id": "8yjGIa9pv2AWaWqxlt4DDA", "stars": 2, "date": "2010-02-17", "useful": 2, "type": "review", "cool": 2}, {"funny": 4, "user_id": "qewG3X2O4X6JKskxyyqFwQ", "review_id": "Jdtx1_E-VGnzarUIpsciag", "text": "These are two perplexed stars because several people that I respect have given Cana lots of stars. My preliminary explanation is that people love sugar cane in their drinks; they love it so much that they are driven in a sugar frenzy to giving 4 or more stars. I can respect this. I didn't have any sugar cane drinks. I had a glass of wine and some food.\n\nThe atmosphere is dark and sexy and suave, and I do love a good atmosphere, but at Cana you pay for the atmosphere. The food was expensive for tapas. We had a ceviche, which was decent. I had no real complaints there, but some of my friends did not think it was the freshest. Then we had an $11 chicken flatbread. For $11, I expected some mega-chicken and assorted toppings, but there were maybe 9 little cubes of chicken and close to no mango that was promised on the menu. Not cool. The yucca frites were not too special, and the \"crispy\" $12 shrimp were not crispy at all. They were a bit soggy. Plus, most everything came to the table not hot. I hate not hot tapas.  \n\nI am willing to grant that perhaps I came on an off night. There was a manager type who appeared to be running dishes, when generally that is a task reserved for the waitstaff. If I am at Town Square and someone wants to go back, I wouldn't be a party pooper. However, for now and based on the other reviews, I would say go to Cana for the drinks, but eat at Firefly. The food at Firefly is 50% cheaper and 100% hotter.", "business_id": "8yjGIa9pv2AWaWqxlt4DDA", "stars": 2, "date": "2010-03-19", "useful": 12, "type": "review", "cool": 5}, {"funny": 9, "user_id": "0tC5OOTuwvPGnnqhPCoRSw", "review_id": "xIFUKn4l8oL882wmBnNjKQ", "text": "Chapman's is a nice little convenience store in a neighborhood across from a boarded up house in Lorain.\n\nThe two people I've encountered working there are the friendliest people you'll meet. The young man is the cashier and the older lady works the kitchen. They make a great team.\n\nThe kitchen serves up hot, made to order pizzas (also available by the slice), subs, fried chicken, and jojos at very reasonable prices!  Fellow Yelper, Darren R has been raving about the delicious Fiery Gauntlet sub for a while and he has reason to because that sammich and the Italian sub I've tried have been really tasty!  They come loaded with savory deli meat and cheese sliced fresh in house with fresh, crisp lettuce, tomato, and onion finished with a smidgen of creamy Italian dressing, nicely toasted on a seasoned hoagie roll...all for around $4-$5.49.  \nI've had the pizza by the slice and it's pretty good at $1.69 for one slice or $2.99 for two slices!  You can order a whole pizza any way you'd like it too. The fried chicken looked really fresh and juicy also. Maybe I'll give they a try next time after I'm off my clean eating kick.  This last visit was a cheat meal, I swear!", "business_id": "243PQVgkx8eUzVaKCgC-gw", "stars": 4, "date": "2016-02-02", "useful": 11, "type": "review", "cool": 11}, {"funny": 3, "user_id": "EPrjJQP35muVElDb18Fddg", "review_id": "mnu8x2-RFiC3hTEBJ35vwQ", "text": "The only good thing about this Sobeys is that it is open 24 hours. That being said, I went there at 2am on Friday night to get pizza and Gatorade. \nThen I waited for 10 minutes at the only open cash. I asked the security guard what the deal was, and he replied \"the checkout guy is in the bathroom\". Ten minutes in the bathroom while you're the only guy working seems a bit ridiculous to me. \n\nWhen the guy finally returned, of course I commented on how long myself and the others in line were waiting. He did not take kindly to this and actually grabbed my hand when returning my change and wouldn't let go. It was creepy and aggressive. \n\nI was going to complain to Sobeys about this guy but I figure he's probably  got a criminal record and this is the only job he can get, so I'd feel bad if he was fired. \n\nMaybe they should get a self-check out like Loblaws", "business_id": "3TAc--QKVYb-F5Mq2NHf0g", "stars": 2, "date": "2011-10-24", "useful": 2, "type": "review", "cool": 2}, {"funny": 3, "user_id": "bf-MBZUzp-arMSKvcp_3AA", "review_id": "nG7DBCOOuSZ99NzNn1z1Zg", "text": "I'm sorry but people who write reviews about the long lines & long waits need a reality check. This is a snow cone stand/truck at a gas station. And the fact that there is usually a long lines means that they are good!\n\nMe & my family live in the area & stop by once a week. The ice is shaved really fine, not crushed & the prices are very reasonable. A small with ice cream & condensed milk is $4.75. And they accept cards too (iPad swiper). The ice is shave fresh, so it takes a little while for each one made. They have umbrellas to use while you wait bc they are technically a food truck & they can't have a sitting or shaded area by law (their license). \n\nAnd you should be responsible for your own children in a gas station parking lot, not the workers.", "business_id": "0FbFqMBLRGRRdZlGJeXjug", "stars": 5, "date": "2013-07-07", "useful": 5, "type": "review", "cool": 4}, {"funny": 5, "user_id": "a1x5xhZ2zpBdOfqtH9x-Kg", "review_id": "tjT9ehEn00wR-cCZcUdo-A", "text": "I like a restaurant that doesn't really care about me.  Too many restaurants slink around your ankles like beaten dogs, cravenly asking, \"Do you want anything, sir?  Please?  Yes, I can get it for you, restaurant-Gollum loves the master, we adoreses you...\"\n\nJohn's Diner will serve you, but on its own terms.  They treat you like people; they're happy to see you, but they've been around for fifty years and will be around for fifty more.  The waitresses tell you what's going on in the back, complain merrily about the job, bring your food to you, pat you on the shoulders.  They have that quiet pride that says, \"If you behave well, you're part of the family here.  If not, here's the door.\"  I didn't ask for anything special, but one suspects that if I asked them for, say, a pomegranate-infused soda, they'd look at me sternly and go, \"Now, what did you want THAT for?\"\n\nAs such, it's supremely pleasant atmosphere.  This is a classic DINER diner, a long narrow train tube with a row of stools for the quick eaters and beat-up booths in the back, where the scents waft out of the kitchen behind the counter.  \n\nThe food?  Well, as Gini notes, they put the greasy in greasy spoon, but that's actually part of the charm; they don't care about eating healthy, they want you to eat hearty.  They have all the greatest diner hits, from eggs and bacon to open-faced turkey sandwich, and the food is not exceptional but it is home-made and fills you up quite nicely on a low budget.\n\nWould I recommend this to my snooty foodie friends?  No.  But would I take them here the morning after a night out for comfort food?  You betcha.  Would I go here myself when I'm tired of exotic foods and just want a damn sandwich?\n\nIn a heartbeat.", "business_id": "-K_qGSp7q61BkkjP_FSsEQ", "stars": 3, "date": "2008-12-20", "useful": 5, "type": "review", "cool": 4}, {"funny": 8, "user_id": "-HLE-x7Lpkfprd6er-JFGg", "review_id": "i8GleQH-UqE5NGe-OL8gXw", "text": "This is the worst dining experience I've ever experienced in all my years. \n\nIt is also the weirdest dining experience I have experienced in all my years...\n\nSo I've driven by quite a few times and it struck me as a place the locals go when they've had one too many or maybe a place some of the locals frequent for a weekend hangover cure. \n\nTo preface this, I'm under the impression that things were going through a change on this first and last visit here. There were items hand-written into the menu, the elderly waitress made a comment that the \"chef\" was new, and the register was brand new to the waitress as well. \n\nSo, anyhow, the story:\nTwo adults and one child (age of 5). Empty diner except one elderly gentleman who showed up while we were there. The establishment was dirty....don't care. I actually expected it and may have been disappointed had it not been. The waitress needs to retire. She seemed to be struggling stringing sentences together a little. Still, not a big deal. \n\nLet's order!\n\nSo the child of our bunch ordered the spaghetti and meatballs, the adults meals were roast beef and mashed potatoes and gravy as well as swedish meatballs over noodles. \n\nEach meal came with the soup of the day (a creamy spinach soup with whatever those noodles are in wedding soup). I ordered the chili on top of that just to have a taste. The chili was GROSS! Not like a gross like this is too sweet, or too salty, or just not a good recipe....it was GROSS in a way that can only be described as it seemed as though it was so old and re-used or SOMETHING that it developed a taste of nothing with the consistency of cream of wheat. \n\nThe soup of the day came out.....again.....GROSS!!!! Gross for the same reasons except this also had the added pleasure of tasting like they \"of the dayified\" the soup pot by adding a block of salt. VERY gross. I eat EVERYTHING no matter what. I dd NOT eat this.\n\nSpaghetti comes out. Giant portion for a kid but one can't complain about that. Sad-looking but no bog whoop. She enjoyed it.....she's 5. \n\nThe roast beef and mashed potatoes come out. Immediately I see those scooped, starchy, obviously flake potatoes.....no big whoop. Not my cup of tea but they can;t be that bad. The roast beef, however, looked (and I tasted it) and tasted HORRIBLE! It had a gray tinge to it, had the appearance of a texture closer to pencil shavings (only larger) and there was literally zero moisture left in it at all. Gross but let's press on.\n\nWhile that was going on, I heard the waitress speak to the \"chef\" and explained that the Swedish Meatballs over noodles uses egg noodles and not spaghetti noodles and moreover (she didn't use that word I assure you) the \"sauce\" is a brown gravy and not marinara sauce. There was some kind of muttering of acknowledgement and the waitress let me know that there was a problem and that my meal would be out shortly. \n\nThe \"chef\" tried to give me the exact same thing the child across from me had and call it \"Swedish Meatballs Over Noodles\"!!!! Wrap your brain around that! So, after a brief lapse, the plate comes out....unbeknownst to me half my plate had spilled onto the counter during transport and the waitress had used a couple spools to get it back onto my plate before giving it to me. MMMMMMMMM!!!!! Then I look down. It's the same meatballs sitting across from me, the same spaghetti noodles (not egg noodles) sitting across from me with the same brown gravy sitting across from me.....ok, I'm not a debutante...I'll tough it out. \n\nI sliced into the first meatball. I took a bite. It was nearly frozen in the center had a salty briny taste from the gravy that also seemed spoiled. It was gross. The very first time in my years I just pushed a plate away and refused to eat it. \n\nThe waitress came over shortly after and asked how everything was. I let her know that I will kindly pay for these meals but would not feed these things to a stray dog. I let her know this was the first time I ever said this dining out. \n\nShe asked if she could take something off the check? First off, the right thing to do is to just apologize and comp the meal....I wasn't about to debate what should be taken off, get into a mathematics quiz with someone who seems confused that she is even working at a restaurant (again, no offense but she just needs to stop). \nSo we all got up and walked toward the register. This is how we found out that the register is new......\nSo I was charged a little over 20 bucks. I handed the waitress 2-20s and asked if I could just have a 10 back. This was a problem. She could figure out how to open the drawer or use it in any way. She talked to it in disdain and was even starting to have that same kind of demeanor Kathy Bates had in Misery. Losing it to say the least. I felt bad at first but then she started to smack the register each time a button press was unsuccessful....kinda in a way when you first find out your girl is a little bit kinky but you aren't quite sure what that means.", "business_id": "-K_qGSp7q61BkkjP_FSsEQ", "stars": 1, "date": "2014-05-20", "useful": 2, "type": "review", "cool": 1}, {"funny": 3, "user_id": "nzVMKd5ZrsG5yuyUyHr4Vg", "review_id": "T89OKCaZH_GWAUxW_uhhJQ", "text": "So my girlfriend and I walked into this... \"establishment.\" We took a seat at the only available spot on the bar. The employee dynamic was miserable at best. They were arguing with each other in front of the customers, suggesting that they all hate each other. I watched a woman give the customer the wrong change... Probably because their cash register is from the 1920s. \n\nThe younger of the three women was yelling into the kitchen \"I'm not going to serve fatty bacon. Get your shit together.\" \n\nI left before they even had a chance to take my order (which was easily 10 minutes after I sat down). \n\nI will never be coming back again. It looks like it's not just the chef that needs to get his shit together....", "business_id": "-K_qGSp7q61BkkjP_FSsEQ", "stars": 1, "date": "2013-09-22", "useful": 1, "type": "review", "cool": 0}, {"funny": 5, "user_id": "_pBzBgtCTN9PNUPfgPDI8A", "review_id": "jFVKc6m1gQlilp4wgOH63w", "text": "I was really excited to find out that we were going on a cruise on Loch Ness.  Our Contiki tour included this as one of our included excursions so it was already part of our package.  The cruise started at 10 am which was a bit early for us but we definitely beat the rush.  We boarded the Jacobite Warrior.  It was overcast but the water was calm.  We enjoyed the beautiful scenery which included views of Urquhart Castle and the surrounding Highlands.  There was a prerecorded audio tour coming from the speakers inside the covered cabin.  If you don't want to be out in the cold wind, the covered cabin is heated with plenty of comfortable seating.  They also had a cool menu of snacks and drinks on board.  Prices vary depending on time on the water but it's worth it if you're already visiting in the area.  Call ahead for group rates or book online.", "business_id": "0xGNmy8DERwwqO3V5jNR6Q", "stars": 4, "date": "2015-01-22", "useful": 5, "type": "review", "cool": 6}, {"funny": 9, "user_id": "37HswRimgBEf7_US-c3CDA", "review_id": "fhaRRGyV3zLCXg3tVMJBMg", "text": "Wonderful & relaxing cruise along Loch Ness - if you're looking for a nice, enjoyable morning along the Loch, look no further\n\nPlanned a relaxing voyage along the black & mysterious Loch Ness for my parents who love these things & we all had an enjoyable time!  Our package included a stop at Urquhart Castle & while it was nice, we'd have been just as pleased had we only done the boat ride\n\nThey aren't even kidding when they talk about how black the water in the Loch is..... it comes from the high peet content in the water..... but it also adds an air of mystery\n\nNo Nessie sightings while we were out but we did see lovely estate homes including the huge greenhouse that provided fresh strawberries to the area\n\nCute little guy bicycled all along the shore w/ our boat & kept perfect time - seemed to be his regular daily routine....very sweet!", "business_id": "0xGNmy8DERwwqO3V5jNR6Q", "stars": 4, "date": "2013-01-09", "useful": 14, "type": "review", "cool": 12}, {"funny": 4, "user_id": "sYQyXDjGaJj7wfaqz5u8KQ", "review_id": "fkKHPySY359zfRHkoe7Tcg", "text": "I love Kashman's!  I've only been for breakfast, so I can only attest to the deliciousness of their eggs and potatoes.  They really make magic with their eggs here.  Way better than lots of other breakfast places can make 'em.  \n\nYou also get a choice of bread with your breakfast, and I always get a bagel.  YUM. Oh and you can exchange your potatoes for fruit if you want to.  \n\nThe staff is a little brash though.  They're a dash sarcastic and not all that pleasant, really.  But it doesn't bother me.  I just get my plate of tasty food, pay just a little (Kashman's is pretty cheap) and grab a table. \n\nYou can also sit outside, but you'll be surrounded by dogs because Kashman's is definitely four-legged-friend-friendly.", "business_id": "7Zmxle5A6XTZACIHgiC98Q", "stars": 5, "date": "2007-06-20", "useful": 5, "type": "review", "cool": 4}, {"funny": 5, "user_id": "i8hCMZN-0bHENsHZKHpC-g", "review_id": "jwO19Zv5XIbTlakUnjjBbA", "text": "Worst McD's in the entire state of Ohio. Never go here unless you want your order fucked up. Don't they have idiot proof ordering systems in there? I see them beeping and whirring away. Yet any time you come here, you don't get the right food. I should know better. Check the bag. There you go McDonald's, a new slogan for ya. CHECK THE BAG, BITCH. It's my fault for coming here. Oy vey, what a festering shithole of incompetence. I hope none of these people reproduce.", "business_id": "42rDLL6vNJ5w66Ccj6a5XQ", "stars": 1, "date": "2014-02-22", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "5tFUXNnFh7g1V2waWvQfbA", "review_id": "CbqXHPrLxik6f2B79F2Cuw", "text": "A place I can trust not to horribly scrape my car and to (mostly) get out those hard water stains from sprinklers is this Terrible's.   The $6 wash is enough for most cars;  at $10 you get a paper towel and an air freshener, and Rain-X, which is about as useful as leprechaun insurance most of the year.\n\nBut they do scrub your car down and have free vacuum stations for you to use afterwards!  It's a 3.5 star affair.", "business_id": "02opZSd2qGlQOnhlcgQPCA", "stars": 4, "date": "2010-06-20", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "2KOUwcKQbnsUCZR5BeYqnA", "review_id": "HPE4rvXPF3OzXFM1bNXsew", "text": "If you need something to vomit in on the way home from the bar, C-U taxi might fit the bill.   But never use them for an early morning pickup to the airport.  I've tried a few times in the four years that I've lived in CU with usually miserable results.\n\n1. don't call the night before.  they'll only lose your request.\n2.  don't believe them when they say \"we'll be there in 5 minutes\"   This morning I waited for 20 minutes after I called to remind them that I needed a cab.  Eventually had to wake someone to drive me to the airport.  For all I know they never showed (I never got a call back saying they were waiting on me either.)\n\nFriends say that Yellow Cab is better at this.  (I saw two Yellow Cabs at Willard when I arrived). \n\nC-U Cab (aka Illini Taxi) isn't getting any more of my business.", "business_id": "7WproNY9yxW6p2R3gn6Euw", "stars": 1, "date": "2009-10-25", "useful": 2, "type": "review", "cool": 0}, {"funny": 3, "user_id": "U5YQX_vMl_xQy8EQDqlNQQ", "review_id": "p4c9bfmXEv17Zcu78xAZrQ", "text": "Came here for Yelp's Burger Binge.  Big Smoke was supposed to offer a $5 Spicy Yelp Burger, but instead they served me a Classic/Regular Burger.  I didn't check the special on the Yelp site prior to ordering, so I didn't realise that they changed it up until I got home and reread the special.  :(\n\nSo not really impressed by this bait 'n switch!\n\nI asked how much it was to make it a combo (fries + drink) and it was almost +$5 extra.  So there has been a definite price increase since my last visit.  No thanks.\n\nBurger didn't taste any different than the other chains, Burger King/McD's/etc. so I can live without dining here again.", "business_id": "Hf4lagcWdxeHHanOQS5amw", "stars": 2, "date": "2015-06-23", "useful": 4, "type": "review", "cool": 4}, {"funny": 5, "user_id": "UKnxXIGoySM0KliHCcTn1A", "review_id": "NXOrsNAUCQFpZY7NdFfJkw", "text": "I give it one star and Yelp says \"Eek! Methinks not.\" and that feels like the perfect summary for my experience at this so-called spa.\n\nI ended up here because of Groupon Now I decided to take advantage of while I was in Vegas. It felt weird when I walked in the door but I figured that I already paid for it, I might as well go through with it. Big mistake...\n\nI went in thinking I was going to get some sort of new age detox themed pedicure. I left after an awkward short Marshall Applewhite (of the Heaven's Gate cult) rubbed my feet with hand sanitizer.\n\nProps to GroupOn for giving me a refund after I told them what happened and how skeezed out I was.", "business_id": "039QG6ks4UYNkMA3mcII2A", "stars": 1, "date": "2011-08-18", "useful": 5, "type": "review", "cool": 0}, {"funny": 3, "user_id": "xa2QB6ln4bxHaQDnJQe3Bw", "review_id": "_Wfxv6kj9Xtd_gULH3sJYg", "text": "IF I WAS 60 THIS SPOT WOULD BE 5 STARS\n\nBUT I'M NOT!\n\nmy friend and i wanted to get all fancy for a wedding so we randomly chose this spot to get our hair did. the owner was able to take us in, so without hesitation, we agreed. i told her i wanted very loose curls. so on went the rollers . . . off went the rollers . . . . and then the teasing began.\n\nto make a long story short i looked like a senior citizen ready to hit the strip! bingo anyone?!  to make it worse, i told her i didn't like it and i kept pushing my hair down to make it go flat . . . which it wouldn't since she put so much hairspray in it. instead of trying to make me happy and fix it, she instead told me that i was beautiful, to stop touching it, and i looked like oprah. WTF?!  if i'm unhappy, i'm unhappy . . . this aint your hair, its mine!\n\ni'll pass on this place . . . i aint down to look like oprah", "business_id": "7VBdG44Qd3_8SV_4NYCxKA", "stars": 1, "date": "2010-10-01", "useful": 3, "type": "review", "cool": 2}, {"funny": 3, "user_id": "9nUtGoOnZMPlZdUQV_aqTA", "review_id": "nLutSAHO55C2P0fdLCYniA", "text": "Thanks for the diabetes!\n\nThis place had the potential to be my second home when I first heard about it. I'm a chocolate addict, If i could inject it into my veins I would.\n\nBut the main problem with this place is that it's full of the one group in society that needs chocolate more than anyone else...\n\nMenopausal women.\n\nThe group of 40 somethings next to me were , for an hour, talking about why their daughters don't listen to them and won't go out dancing with them (I could have answered that one...) The 3 most common words you'll hear in this place are \"Oh...My...God\" with the appropriate pauses in between when they stuff their faces. If you're looking for quiet afternoon, don't come here.\n\nWhoever was supervising the staff was giving them such a hard time, i can't believe the other reviewers saw the same thing too. Somebody has a little attitude problem.", "business_id": "2kWqGvYO1obP_bVLzOvhFw", "stars": 3, "date": "2010-05-08", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "yCEFoyKQOMD6TRJaG0BEUQ", "review_id": "6SbF2gdIHPsChqYIfd-IVw", "text": "Chocolate Soup, how cute you are!! \n\nYummy yummy shortcakes and delicious hot chocolate!! And what a cute name. It's like a coffee shop converted into a hot chocolate shop with goodies of sweets where young tourists can relax.", "business_id": "2kWqGvYO1obP_bVLzOvhFw", "stars": 4, "date": "2009-04-24", "useful": 5, "type": "review", "cool": 4}, {"funny": 3, "user_id": "_NizT4NfEXZP466x8qD8gw", "review_id": "qsxXYtwtBAiQ4fZXaWjilw", "text": "I wanted to check this place out for nice colored paper that would be used to make escort cards for my wedding. When i went it, i defintiely liked all the stuff they had there, but it took them forever to even acknowledge me. Someone finally said hi from behind the counter, but didn't ask if I needed anything and seemed more interested in what she was doing behind the counter. I made it to the back where they had racks of paper, but i wasn't seeing what i wanted. A few more sales ladies came into the store from the back and one asked if she could help me. Finally!\n\nI explained that I was looking for thick but pretty card stock to use for cutting out bird silhouettes for my escort cards. As this sentence was leaving my mouth, the look on her face changed to absolutely disgust. When i finally got through asking if she'd be able to help me find the right paper, or any suggestions on how to make this work, she said \"Yeah, don't cut out bird shapes! It's going to look homemade and you'd be better off just buying some colored feathers.\" And that was it. At no point did she offer to point me to a different paper, or discuss the possibility of bird shaped stamps. No, no. You're idea is trashy and gross and the thought of talking to you anymore about it makes me want to vomit.\n\nThe reviews about them being snotty and rude are absolutely true. I would never step foot in this store again.", "business_id": "2ksAPIhObAGEaYU4Y3ZbpA", "stars": 1, "date": "2011-06-13", "useful": 3, "type": "review", "cool": 2}, {"funny": 11, "user_id": "3mNz5nQFTIBQm0oU5mBR0w", "review_id": "VC16aXHyb1tCFw5dQoQ0VA", "text": "Can I Get Banned From Yelp For Saying FOURSQUARE?\n\nSITREP\n\nThis is definitely one reason for keeping your Foursquare app running on your iPhone.  I got a 2-4-1 Rum & Coke drink special $6, so I'm not complaining.\n\nTHE SETUP\n\nInside the Luxor Hotel, Liquidity is a nice chill bar that isn't as pretentious as some of the other bars on the casino floor or on the 2nd Level.  It's also - as far as bars go - a bit off the beaten path in this hotel and so only experiences half the congestion of the other bars.\n\nDRINKS\n\nBesides the special I mention at the top of the review, most of drinks are between $5 and $8, and include shots with them if you ask for the right ones.  I'm not really a gambler like the friends, and so chill spots like this are really nice to take a break at, especially when engaged in a deep conversation with someone.\n\nTHE LOWDOWN\n\nWhen hanging out at the south end of the Vegas Strip, this is definitely a nice bar to retreat too away from the noise.", "business_id": "1ovFbjcn13ovvMC94F2e7g", "stars": 4, "date": "2013-09-28", "useful": 12, "type": "review", "cool": 10}, {"funny": 3, "user_id": "DKf72wuGb-RUB9DKe0vbYQ", "review_id": "5b_NuI9vAZhXwgbJLUyK3g", "text": "Had free vouchers for drinks, so headed down to Liquidity for some pregame before headed out down the strip doing some big Vegas girl things! \n\nIt was a nice lounge, simple love the blue warm colored lights while overlooking the casino floor, with some sweet and comfy lounge chair. Good for groups and good for couples, as well as individuals to grab a drink. \n\nYou sit yourself and the waitress will come around eventually. She offered us drinks, we offered her our vouchers and she gave us the options. We settled on well drinks, two vodka crans just keeping it simple. It was more vodka than cran but a nice berry red. Love it, enjoyed a few sips, tipped the pretty lady and grabbed our drinks and headed over for some more adventures. \n\nIt's pretty quiet there and I like how it's clean. There wasn't enough wait staff, but I guess it's good since you won't be bothered and everybody keeps to themselves. Great location, right in front of the casino, niceeee.", "business_id": "1ovFbjcn13ovvMC94F2e7g", "stars": 3, "date": "2012-07-09", "useful": 4, "type": "review", "cool": 3}, {"funny": 3, "user_id": "b3g9-jTwzHWj3Ccnq1MUpQ", "review_id": "8SnMY-R8g2uSc8ephzAAbg", "text": "WORST DINING EXPERIENCE OF MY LIFE....\n\nWe went in for the 10.99 all u can eat...  The service was slow and sub-par  but this didn't really bother me... The food was really bad and the worst sashimi I have ever tasted...but still whatever it was only 10.99 right?  Well  when i went to pay they wanted to charge us 17.99, even though all of the banners say 10.99.  After a brief argument the one waitress called the manager on the phone screaming in Japanese  and finally charged us 10.99, still insisting she told us when we ordered that we were getting the more expensive menu??  SHE DID NOT....  This is where it gets good...  she than yells at me saying Im never welcome again.. I said fine...this is the worst sushi I have ever had and I wouldn't dream of coming back..she than barked  at me again.   At this point I had enough and told her where to go, at which point the waitress turned around and slapped me in the face twice  YES  she actually physically assaulted me!!!   But it didnt stop there!  She then shoved me into a table...After this I unleashed hell fire on her and ran out.  I'm still pondering pressing assault charges just not sure if i want to waste any more energy on it... I'm still shocked it happened....Difficult customer or not you NEVER lay a hand on a customer.  The place was full as well with a lot of witness's.", "business_id": "-HlfeTND7PATNVduJ_35lA", "stars": 1, "date": "2012-09-15", "useful": 2, "type": "review", "cool": 1}, {"funny": 3, "user_id": "33ndW7Gm2AFExVr-OOZ4zA", "review_id": "Lrfq09EEg62QE8FcL6qwOA", "text": "There are plenty of questions that humans will ponder over long periods of time to try to find an answer to. What is life? Are we alone in the universe? How is Mariko still in business? We may never find out the answer to that last one, but let's try to wrap our heads around it for the time being. \n\nSure, it may be relatively cheap for an AYCE, but starving to death is also cheap. At least with the latter you can die a dignified death and not have your hippocampus tarnished with the memory of ever coming to this place. With poor service, a menu with text printed in the smallest size font in faded red (ask the staff for a magnifying glass if you don't have your electron microscope handy), low quality fish, and a whopping 7 conditional passes from Dinesafe(!) under its belt, it truly is a wonder how this place is still around. Considering the rising presence of Japanese food in the area, such an environment should've put this place out of its misery ages ago. \n\nFor those that have already made the mistake of coming here at some point, especially if it is your first AYCE experience, I am sorry. For those that have not been here, run. Run as fast as you can.", "business_id": "-HlfeTND7PATNVduJ_35lA", "stars": 1, "date": "2015-08-21", "useful": 0, "type": "review", "cool": 0}, {"funny": 5, "user_id": "qoS4nIc5MlfF_j8DkYHBgw", "review_id": "MWunZ4CvCvYr91BaVxGWtg", "text": "The Fox Bistro is the restaurant at the Radisson so we were assuming that the food would be fine and gave it a try as we had a coupon for it.\n\nAs you walk in, the first thing you notice is that it is very dated inside, and the bar crowd. We were the only table in the whole place besides some people staying at the hotel watching the world cup and having some drinks at the bar.\n\nThe menu is very simple, not big at all. I wasn't very hungry so I just got a club house while my other got the lasagna. \n\nThe waiter wasn't paying any attention to us at all, he was busy watching the game with the guys at the bar, we had to keep getting his attention. If we were the only table don't you think he should of gave us just a little more attention?\n\nWhen the food finally came, I saw all these yellowish looking stuff on my sandwich, the description said mayonnaise NOT HONEY MUSTARD SAUCE! I dislike mustard and I was shocked to see honey mustard all over my sandwich, I have never seen a club house with mustard on it, so I was very surprised.\n\nThe lasagna looked very portion packed and when we asked about it, the waiter said \"its frozen, we just heat is up\" you would assume for 20 bucks at least could  make their own lasagna. What's the point going to a restaurant to have something heated up when you can do the same thing at home?\n\nI'm glad I had to chance to see what this place was about as I was curious but I will never be going back.", "business_id": "5R6aB5T6pDIlgam1nbibcw", "stars": 1, "date": "2010-08-11", "useful": 8, "type": "review", "cool": 5}, {"funny": 3, "user_id": "x2jghNDhObRgtvaybya2dQ", "review_id": "CLM6Pra8cVQhKiZX6OrRRw", "text": "My girl friend and I stayed at this Radisson twice and were given continental breakfast vouchers on both occasions. We didn't have time to take advantage of it the first time but we decided to give it a try on our second visit.\n\nThe moment we walked into the restaurant  was like going through a time machine. Boy~ the decor was immensely outdated; it felt as if we had just gone from year 2010 to 1980's...\n\nThe experience pretty much went down hill from that moment and on...\n1. the waitresses were not very attentive at all even though we were THE ONLY table.\n\n2. The continental breakfast only included the cold section of the break (breads, fruits and croissant...) but we chose to to add $6 for hot buffet because the croissants and fruits had obviously been left for several days (no jokes, the croissant had a kind of fermenting smell to it) and spoiled. \n\n3. Fine... so off we go to the hot buffet (the selection was very LIMITED) but we thought how can we go wrong with $6 buffet? WRONG! The scramble eggs was blah and the bacons tasted like it'd been several days old...\n\nWell, I can go on and on about how bad this place is but I won't... You probably get the idea anyway... Stay away from this place since there are so many choices (and MUCH better) right outside the steps of this hotel (Tim Horton's, Kelsey's, Subway, Milestones, Sushi, Swiss Chalet and etc...).", "business_id": "5R6aB5T6pDIlgam1nbibcw", "stars": 1, "date": "2010-10-23", "useful": 4, "type": "review", "cool": 2}, {"funny": 5, "user_id": "tFN3oJMEOfBs2c1sKYsfXw", "review_id": "NWd2ZeCueyOd0790Pn3czg", "text": "I planned on taking a bachelor party to this bar. I wrote and found out they were very party friendly. When I got to the bar, they refused my entry. They said that i had drank too much that night and when i tried to explain to them that i was a service member that was returning from Iraq and although i am within my legal limit, i might be a little more affected because i haven't drank in 6 months. while i was trying to explain this, a \"gentleman\" grabbed my shirt and pushed me out of the entry way. \n\nthis was not only military unfriendly, but it would seem that they only are looking to sell their over priced drinks. if you are looking for a good time, look elsewhere.", "business_id": "-ViwF2TdQ7B2N8jy_ykC5Q", "stars": 1, "date": "2010-02-14", "useful": 1, "type": "review", "cool": 0}, {"funny": 37, "user_id": "TMS2sYNcv74c0CsqGJvXEw", "review_id": "0QbVusoxVoTtZ_V5QtzTUA", "text": "Like most strip clubs in rural Illinois, it's a great place where you can watch overweight farm girls pay for junior college and pretend not to feel horribly awkward.\n\nUnlike the others, however, this place is near a university campus. That makes The Bullet (what real locals call it) particularly special.\n\nIt's a place where you can can watch overweight *suburban* girls pay for *university* and pretend not to feel horribly awkward.", "business_id": "-ViwF2TdQ7B2N8jy_ykC5Q", "stars": 4, "date": "2007-09-10", "useful": 3, "type": "review", "cool": 2}, {"funny": 58, "user_id": "jLoBVpTnw9AsAc7J2fByhA", "review_id": "cdPXeHHaxItO8kUTbHkIJg", "text": "5 totally skanky stars! and i say that in the best way possible. \n\nlet's be honest- no one comes to the bullet thinking they are going to see amazingly hot strippers do crazy pole acrobatics and pop bottles in the champagne room. this is a dive. you come to the bullet for the following reasons:\n\n-there are some hot girls here. there are also some girls here who know they have a face for radio, but work it out extra hard from the neck down to compensate. my favorite? this weekend i got a lap dance or 3 from a hot, super thick blond chick in little reading glasses. almost fat, but definitely phat. you just don't see that enough! \n-girls get in free. guys, if you use the atm, it spits out a free admission\n-got a table close to the stage? for $1, these girls will go balls out: legs wrapped around your head, coochie in the face, motorboats for days, etc.\n-need some attention form the lady on stage? get $1, go stand by the pole or lay on your back on the stage... they will get that money! if you are a girl, be prepared for them to try and lift your shirt up on stage. my advice is save it for the lap dance.\n-lapdance for $10! guys, you have to abide by the typical rules. girls, get ready! you can touch all over the dancers. they can and will touch all over you. \n\none time, back in the day, there was a hot latina dancer that had a nice set of implants, and was giving me a lapdance:\nstripper: (takes my hands and places on her implants) SQUEEZE THEM HARD!\nme: i don't want to pop one....\nstripper: try to pop one. you can't!\n\nquality all the way, baby.", "business_id": "-ViwF2TdQ7B2N8jy_ykC5Q", "stars": 5, "date": "2009-04-23", "useful": 36, "type": "review", "cool": 29}, {"funny": 6, "user_id": "WJdXYIM5cphh_28C5Bhnfw", "review_id": "HJduewLbOxvMmpRLiuAOFg", "text": "This is the first strip club I've been to... And it's not what I expected at all. My expectations came mostly from Instagram and YouTube, so I thought I was going to see some insane pole acrobatics and such. Definitely not the case. The dancers, without exception, were out of shape and did no more than languidly caress a pole and saunter around the stage. Probably the most complicated move I saw all night was a woman dancing above a man's face. \n\nAlso one of the dancers groped my boobs, which was weird but not terrible. Lawl. \n\nSilver Bullet is kind of dumpy but four stars for what it is. It's an interesting place. The other people at my table, mostly older men and women, were super nice and fun. Also, IIRC, women don't pay cover.", "business_id": "-ViwF2TdQ7B2N8jy_ykC5Q", "stars": 4, "date": "2015-12-01", "useful": 2, "type": "review", "cool": 0}, {"funny": 7, "user_id": "WBDenhIG-zB271HN9CVAAQ", "review_id": "VZdR7B4fEJ0ZVOy9CFzAiA", "text": "KYOT how did you quietly invade all of the offices and restaurants of my life?  I've had all of the George Benson, Chuck Mangione, Spyro Gyra, and Kenny G. one man can take for a lifetime.  You've done it, you've smoothed me to near death with what you falsely call \"jazz\" (I have another word for it using three of those four letters).  I know others have been led astray by your wallpapery aural seduction, but you can't fool me, you just can't.", "business_id": "5IIdYMexNto8sSqRluRJsQ", "stars": 1, "date": "2008-02-29", "useful": 3, "type": "review", "cool": 4}, {"funny": 3, "user_id": "sFRnh5U0bfTe8Ox8PygjHg", "review_id": "g_5ncg_oH04Te__A9YMF8A", "text": "This place does the trick, in terms of being a place where you can bowl and grab a few beers.  Other than that, it isn't anything stellar.  It is clean and they do have a decent beer selection for a bowling alley.  The owner/manager is really nice and helpful which makes me want to like this place so much more.  I feel like there isn't really a good bowling place that isn't Lucky Strike (which tries to be more like a dance club than anything else).  So until I find a happy medium, this place is good enough.", "business_id": "6pXwPMO871ir8ZnmyBbLEg", "stars": 3, "date": "2009-11-15", "useful": 5, "type": "review", "cool": 5}, {"funny": 14, "user_id": "UmXzwFM2OkZHWJ5cJZlqkg", "review_id": "FoPLYfV6hb86WYIBpnBY5Q", "text": "Nothing starts a great bowling experience off like running into some dicey characters in the parking lot. \n\"No, you cannot use my cell phone.\"\n\"No, I do not know where you parked your El Camino.\"\n\"Well, fuck you too.\"\nNow I was really ready for a pitcher of beer and a double shot of Cuervo. Sunday night at 8:00, all games and shoes are a paltry $2! Fantastic. And quite simply I cannot bowl without alcohol. It's like some people with karaoke. Of course each time I fell on my ass (and it was frequently) I blamed the slippery floor. It COULDN'T be that third pitcher! I don't know what the drink prices are there, but I ran up a serious $100 bar tab....OMG....WTF??!! Dysfuncional, Sagitarriun spender that I am...I didn't even care. The glee of bowling overwhelmed my rational reasoning skills. Although my reasoning skill did kick in when I decided to return the shoes and not run out the door with them still attached to my feet. All said, the bartender and the \"shoe\" man were awesome. League anyone?", "business_id": "6pXwPMO871ir8ZnmyBbLEg", "stars": 4, "date": "2007-10-02", "useful": 13, "type": "review", "cool": 15}, {"funny": 3, "user_id": "DMHPVjHKaUStUBMPH2TjNA", "review_id": "bBs8S_mpxccoynNZmHgJ9g", "text": "Bowling+ Alcohol+Rock and Roll+ Cool Lights = Good Times..and low bowling scores!!!!\n\n\nSo AMF is OK..I have experienced better.  This location is your typical hometown bowling alley minus the line dancing or Karoke on Friday and Saturday nights...at least that's what my hometown bowling alley had.\n\nOh wait so does this AMF in the bar...speaking of the bar...most of the staff here sucks and for the majority are probably older then this bowling alley itself, the drinks suck for the most part...the only thing I have had here that tastes halfway decent is the Long Island Ice Tea...but even a blind monkey could not mess making one of these drinks it is virtually impossible. \n\nPrices are OK, the Rock and Roll bowling is cool but I think it is about time this place maybe did a remodel, all the balls are quite old and most of them need a good refurbishing. Plus it is kind of dirty, but what can you expect for a Bowling Alley..just go and look at the mix of freaks on any league night. \n\nNUFF SAID!!!:)\n\nI am still searching for a \"GOOD\" bowling alley.", "business_id": "6pXwPMO871ir8ZnmyBbLEg", "stars": 2, "date": "2009-01-09", "useful": 2, "type": "review", "cool": 2}, {"funny": 6, "user_id": "KeuwC8E1238SP6xyKpBM6w", "review_id": "AU7R5nOc5HbWEcCdg7-o6w", "text": "4 stars. \n\nCount 'em. Uno, dos, tres...quatro! Uhm, por que? I'll explain. \n\nBefore you hit the lanes, make damn sure you have somebody fun in tow. That's the make or break. If you bowl with a dud, you won't enjoy AMF Squaw Peak Lanes. Trust me. It all hinges on the company, for  the serious good times begin when the sun goes down (and trust me, even in Phoenix, it eventually goes down.)\n\nNever mind germs. Grab a brew or three and claim your lane. Warm those fingers up. Crack those knuckles. And most importantly, stretch those hamstrings and calves, for bowling isn't just bowling anymore. The lights dim and the music rises. This is where it's at - Rock 'n Bowl! \n\nBaby got back, indeed. \n\nUpon leaving, one of my best friends and I got a round of applause. That's right. No, it wasn't because we were super studly bowlers (we weren't half bad, though). It was because we were super amazing dancers. I mean, it's Rock 'n Bowl. You Bowl. You Rock. Part of Rockin' is shaking your groove thing to whatever tune comes on. Yes, we are Equal Opportuney Dancers (get it?). Of course, what I love the best is singing about anacondas and baby don't wanna's, sugary sweetness and mutual silicone ickness... \n\nOh, and if you like throwing big, heavy balls and hearing the loud clank of pins hitting the ground, then you'll enjoy yourself, too.\n\n\"You two got something special,\" we were told on our way to turn in our sweaty shoes. \"Aww, thanks!\" I replied. He's right. I'm tellin' ya, it's all about the company!", "business_id": "6pXwPMO871ir8ZnmyBbLEg", "stars": 4, "date": "2007-10-18", "useful": 4, "type": "review", "cool": 7}, {"funny": 4, "user_id": "b9Cfa7tkxrl8zuH7yEvEPg", "review_id": "UN_qTtGa1LA0AVTk3sFflw", "text": "The Embellished Room offers an array of clothing for women looking for something trendy but not wanting to break the bank. \n\nEvery item here (with the exception of some sale items) is $29.99.  At this price, many of the finds here would be considered a steal, but for some items (like a simple t-shirt) the $29.99 flat rate seems a little over-priced.  I find the majority of their clothing is lacking in the quality department and I don't feel the price justifies the fact that your garment may or may not last you more than 2 washes in the laundry.  That being said, I do have a few pieces from TER that I love and have lasted me throughout the years.  \n\nExtra props goes out to the fabric bags they GIVE you when you buy something, and they don't try stuffing 12768 articles of clothing in one tiny bag.  (American Apparel- take note)\n\nI would recommend making absolutely sure that you actually want what you're buying (try some stuff on, sleep on it, then come back to buy if you really want it).  Inspect the garment(s) and ensure there are no rips, tears, or stains.  Exchanging stuff here is a BIG hassle.\n\nNote their return policy (as written on their receipt):  \n\nNo refunds.  One time exchange only on $29.99 items with original receipt within 14 days and cannot be exchanged for other price point items.  If there is a price markdown on an item and it is being exchanged, the new price would be what the customer would get as credit when exchanging regardless of the original price paid.  Tags must be on item.  Sale/off season items cannot be exchanged.  Store credits are valid for a period of 3 months from the date of issuance.  \n\nThe Embellished Room holds the right to change/discontinue any promotion without notice.  All products purchased must be checked by customer before leaving the store.  Any claims or damages after wards will not be allowed. Scanned register price will be taken as correct and final price.", "business_id": "7f_edPZNJfP-kmUtFhIsOA", "stars": 3, "date": "2011-06-20", "useful": 14, "type": "review", "cool": 5}, {"funny": 4, "user_id": "07dMu2RDPiGdlZHykjjyzw", "review_id": "DJKLdNX79Mn4UDBE9X8lJg", "text": "Once, me and a friend were in Legacy Village just walking around after she had already bought a smoothie from around the corner. We noticed this place had just opened, because I was craving something sweet and was headed to Cookies By Design.\n\nWe stopped in, and it wasn't crowded at all, although the amount of employees standing around by the door was a little off-putting. They told us we could try anything we wanted...so the only one I tasted was their Cupcake Batter flavor and I instantly fell in LOVE! Who needs a man with the kind of sweet flavor and toppings Yogurt Vi has to offer? I was like a crackhead running back there every few days.\n\nOnce, I saw employees inside Whole Foods Market buying a bunch of organic strawberries for the toppings, so I know the rest must be good stuff.", "business_id": "0nGmFtth2sH01BfqP4C5zw", "stars": 5, "date": "2011-07-07", "useful": 2, "type": "review", "cool": 1}, {"funny": 3, "user_id": "OM0B7JjIYW_FPlvMq_EaDw", "review_id": "swEfMmrzX3Jj9EB5MwwI3Q", "text": "Ok, so its not the greatest bar in the world, but they have beer and there is never a wait because nobody goes there.  Is that good?", "business_id": "1_yXNlfbGSn3pGjzNB99Yw", "stars": 3, "date": "2012-06-15", "useful": 1, "type": "review", "cool": 0}, {"funny": 4, "user_id": "VuVnDNculbta1BJLPwd7IQ", "review_id": "QRl1Pq5aDx4bWNHzkdYDEw", "text": "This place sets a new standard for disgusting. Dirty interior, dirty bathrooms, slow/absent minded wait staff, horrendous taste in music coming out of a poor quality  sound system...\n\nI just don't know what to say to adequately encapsulate this restaurant. I guess making an analogy would be pretty good. You ever seen any of the National Lampoon's movies? Do you remember \"Cousin Eddie\"? Well if Cousin Eddie opened up a restaurant this is what you would get.\n\nThe food they served here should be illegal in the state of Ohio. That pretty much sums it up for me. If you really are in the mood for this kind of food please do yourself a favor and find a BW3 instead. Now you'll have to pardon me while I try to lay down and fight back this nausea.", "business_id": "1_yXNlfbGSn3pGjzNB99Yw", "stars": 1, "date": "2011-04-30", "useful": 2, "type": "review", "cool": 1}, {"funny": 5, "user_id": "4d681x3sCw1Q9ySTyTYXlw", "review_id": "2KFuzx9hupFRpyUWNoNhUA", "text": "BIG fan of Buddies for the dancing aspect... I have not been to a show here, but I'd like to go (any takers? haha).\n\nBuddies usually just keeps one room open for dancing, but on really crowded nights, they will open their second room. Somehow, even when the space is tripled, it's still packed and sweaty--spelling out a good (but post-shower-necessary) time. Of course, you will find mostly gay guys here, but there is a sprinkling of girls thrown into the mix.\n\nDrinks are reasonably priced and the bar is efficient. The line outside is also pretty fast. It's the little things like these that add up to a great experience. Little things like how you get stamped with PERVERT upon being granted access (careful to remember to wash that off before work the next morning...).\n\nBest tip I can give is to dress casually and, if in doubt, go with less. You will warm up quick with all the bodies and the alcohol.\n\nAnd do not wear any shoes that you care about. They will get blackened. Luckily, the black will come out of canvas shoes quite easily. It has become part of my morning-after routine to scrub my shoes down with a toothbrush and some dishsoap.", "business_id": "6KL0lRKtgTof-NoFuiXwdA", "stars": 5, "date": "2013-07-03", "useful": 3, "type": "review", "cool": 1}, {"funny": 3, "user_id": "WDpvs6U_TCx4799oxXcnag", "review_id": "z9FilT_-94zTUvff7nD-TQ", "text": "The Service: Very sweet customer service! No pressure on selling. They are totally fine with taking pictures. They are very informative and knowledgeable about their products. \n\nThe Soap: YUMMMMM~ wish they are all edible!! Super creative~ No more ordinary, boring soap! They make soap so FUN! Perfect for buying them as gifts. Yes, a little bit pricey but they last for long long long time! Great for decorations or display in the bathroom. \n\nExcellent new gift idea!", "business_id": "-HZ2VmNnnrH1tp-yKyhdNA", "stars": 5, "date": "2015-05-29", "useful": 4, "type": "review", "cool": 4}, {"funny": 4, "user_id": "ILe3tzgnbGSaZfpArtJdjA", "review_id": "J_woLGMv1XCYXent9MW1hQ", "text": "Oh Magia... You haven't aged well my friend. \n\nAbout 10 years ago I spent a year living a few blocks away from Magia. This was my favorite local eatery within a 5 min walk. \n\nA decade later, on a whim, I decided to return. It was kinda like running into an ex you haven't seen in a long time. A little fun for the first few minutes... but you're really left with \"wow... What happened to her?\". Sure the implants and Botox have helped, but it's just masking what once was. \n\nThe menu looks the same, but dementia has set in, they have forgotten how to make my old favorites. I started with the warm goat cheese salad. I used to dream of this salad at night! But what I got was, well, it was disheartening. \n\nAnyway... I won't be calling her back. It was too awkward, and I don't see it getting better over the next few years either.", "business_id": "5pJXye7SUjzLLiu7U9_WXA", "stars": 3, "date": "2011-11-21", "useful": 1, "type": "review", "cool": 1}, {"funny": 5, "user_id": "UVxY0iyPaqY7s4BSFtt-xA", "review_id": "vU51j-JW2KEbFcZeDkYKvg", "text": "In the city of Longueuil, which is across the water from Montreal in what is called the south shore area, is the quaint old town area of Longueuil. This little strip is dotted with little shops and restaurants, including this one, La Magia. \n\nThe restaurant is in a sort of old house, with the front room cleared out for diners. The food is casual, and good for lunch, offering salads, pastas, and pizzas. I had a nice Spaghetti Pancetta, which included a nice side salad, for $11.95, very reasonable and done well. Service in the busy lunch hour was good, too.", "business_id": "5pJXye7SUjzLLiu7U9_WXA", "stars": 3, "date": "2008-11-08", "useful": 8, "type": "review", "cool": 7}, {"funny": 4, "user_id": "puKCWAzXbY4QfpMBOkVEKg", "review_id": "0CMd4e0Ne1ZOWaIB_x8Q5g", "text": "Lovely for an hour of goat-watching in the city.  The way goats scratch their ears with their little delicate hind hooves is worth the trip to Cabbagetown on its own: combine with brunch for optimal joy.", "business_id": "7cCPL6NJPrOUlxjabpmZjQ", "stars": 5, "date": "2009-10-12", "useful": 5, "type": "review", "cool": 3}, {"funny": 4, "user_id": "mv1IeIs9H8Or5GOi3JHxrw", "review_id": "OQWl7d8jMTCjAu734lUqwA", "text": "It's not a 5* farm or zoo.  In my books, it's a 5* urban gem and one of the things that make our city so special.  Just blocks from the downtown core, we have this awesome petting zoo and park where we can stroll through and catch-up with an old friend.  There are barns and converted old buildings that house the animals.  There are walking paths with beautiful landscape, including a little duck pond.  It's flanked by Riverdale Park West with ample space to sit and read.  A wonderful place to get out of the city while being right in the middle of it!", "business_id": "7cCPL6NJPrOUlxjabpmZjQ", "stars": 5, "date": "2012-05-02", "useful": 6, "type": "review", "cool": 6}, {"funny": 3, "user_id": "Rg-86Gr5Oe8ODoMUfr1M1Q", "review_id": "qi6-_aQmsIzIqxwFv8YBbQ", "text": "Picturesque, charming, and FREE!!!\n\nThis is one of my favourite places to visit.  Such a wonderful place for little kids and babies to come and see farm animals.  There are pigs, chickens, roosters, horses, cows, donkeys, ducks, sheep, and I also think there is a goat.\n\nThere is a little walking trail that is lush, shaded, and green.\n\nThere is a little farm house with a porch that provides a wonderful backdrop for pictures.  \n\nI also think there is a black barn cat roaming about ... or maybe its a neighbourhood cat, I have no idea.\n\nWell, I just absolutely adore this place.  It gives me a warm fuzzy feeling when I visit.  Its just so beautiful and cute :)", "business_id": "7cCPL6NJPrOUlxjabpmZjQ", "stars": 5, "date": "2011-07-05", "useful": 4, "type": "review", "cool": 3}, {"funny": 4, "user_id": "_t3BJzyGaqr9mcDazYiYAQ", "review_id": "SBjSTgVSeEpGqEcXVzPxLg", "text": "I came here for the goats. Is it wrong that goats make me laugh and I find them to be the most entertaining animals out there?\n\nSeriously though, we needed a destination for a bike ride and this was as good as any. I'd recommend this as an outing for or with kids, as there were many families there. But we met up with a family of friends and hung out with them so we didn't look like a weird childless couple cruising goats.\n\nDucks, chicken, pigs, sheep, horses and cows, too!\n\nMake sure to leave some money in the donation box. This place can't run on fecal fuel!", "business_id": "7cCPL6NJPrOUlxjabpmZjQ", "stars": 4, "date": "2014-04-14", "useful": 0, "type": "review", "cool": 0}, {"funny": 6, "user_id": "KTK_ws8lu_TWfR7DtDWjMA", "review_id": "HlacAQofVrp2CUfVaxjiYw", "text": "When you get tired of DJ's and electronic music and you're ready for some authentic music made by actual musicians, this is the place for you.\n\nThe minute you walk in you realize that this isn't some honky tonk dive, this is a very dark, classy place, with a large bar and plenty of seating. The stage is well appointed and there's even an area next to the stage that looks to be a VIP lounge.\n\nThis is the type of place that you would normally find in NYC, LA or Nashville, so its a great addition to Scottsdale. It reminds me of the type of place where you might have found Johnny Cash, Frank Sinatra, or George Jones taking the stage back in the day. In fact, it wouldn't surprise me if this becomes the place where national musicians go to play a few unannounced sets when they are in town.\n\nGotta say, in just one visit The Western has become my favorite new place in town.", "business_id": "DAMQ2VtdwZsVed8BC3Z9rA", "stars": 5, "date": "2013-04-27", "useful": 17, "type": "review", "cool": 8}, {"funny": 5, "user_id": "dfB-XW_RwAcIKmFrZK7U1A", "review_id": "CCmxU5ilkCA8ImqFkqsW-Q", "text": "I've been to several events here over the years and I always love the warm atmosphere. The large banquet hall is a great event space, with the doorways opening into the central bar area. Windows look out over downtown giving it a certain feeling of looking down over Montreal and having a great time.\n\nWhat I'm not so crazy about are drink prices. They are on par with fancy downtown bars, which doesn't seem quite right for a grad student bar located near the top of a hill. I'm not expecting rock bottom prices either, just middle of the road with perhaps a few specials.  $7 for a pint of nothing fancy is not a good deal.", "business_id": "8DmLIFcVBHqjp8XPXRQ6lw", "stars": 4, "date": "2013-12-30", "useful": 7, "type": "review", "cool": 7}, {"funny": 3, "user_id": "GON8Ynfiro1jxnFoWD5jwQ", "review_id": "08vlijRRDwLmkEVPzD3Jhg", "text": "It's Quiznos.  Yes, sticker shock, but it's the airport.  My 8\" Italian on Rosemary filled me up.  The crew working this location is not super fast, but the end product was consistent with my Quiznos expectations.", "business_id": "7Km9UXolK9vEeBDNqTl5DA", "stars": 3, "date": "2015-10-14", "useful": 4, "type": "review", "cool": 3}, {"funny": 3, "user_id": "Q9mA60HnY87C1TW5kjAZ6Q", "review_id": "HsEmefIJoZsBr0AAFcKQIw", "text": "Picture your favourite winter socks. Are you doing it? Are they woolen and heather gray with red stripes around the top? Of course they are! Old Faithful Shop carries your old faithful favourites, and completely deserves it's adorable name. \n\nThis store is a pleasure to be in. Very minimal and calming, yet filled with lots of great household brands. Blankets, coffee extras, soaps and sleek extras make up the inventory, and I dig it.", "business_id": "-SlPWO0rh7mOUtAWodN0lQ", "stars": 4, "date": "2015-11-03", "useful": 7, "type": "review", "cool": 8}, {"funny": 8, "user_id": "KDewJBJknfWvQyHHFNbfdg", "review_id": "MM26qDkjiQnggE7AsXFA4g", "text": "Want that expensive rope dog leash and I don't even have a dog. Want that $20 old key can opener. There are things in here I didn't know I needed and then I realize I must have Made in Canada socks. I must have a marble tray. I must have another coffee Chemex pot. I must have... Some explaining to do when I get home. \n\nAnd, look at that kerning in their logo, though. It's emblematic of how much space is between each item for sale in the store. Respect that move, and respect a store that'll go for broke and carry both expensive ropes and Oregonian sea salts.", "business_id": "-SlPWO0rh7mOUtAWodN0lQ", "stars": 5, "date": "2015-11-13", "useful": 5, "type": "review", "cool": 9}, {"funny": 5, "user_id": "mIysRk_cJ5K_BMZ-r06TFw", "review_id": "2EWUaWRKpoDWx7ju0jxHRQ", "text": "Let me put it this way. I love First Fridays. And this month I brought my 63-year old mom (a newcomer to Phoenix) to the event, and SHE loved it. \n\nMy original plan was to quickly show her First Friday, figuring that the summer night heat and gangs of teenage hippies roaming around would cause her to want to leave after a brief glimpse. I then planned on meeting up with friends at The Roosevelt after dropping her off. Instead, she (herself a watercolor artist) was captivated by some of the interesting art we found in various galleries on Grand Ave, followed by Red Dog on 3rd Street and the street displays. Then, as I watched the time creep up to ten p.m., she became mesmerized by a punk rock band playing on the corner of 4th and Roosevelt. \"So Mom, you want to go home yet?\" I asked at one point. \"No way. I love this music! What is this band called?\" I thought I was in the Twilight Zone. And that was before some guy asked her as she walked by whether she liked Tupac. \n\nEventually she got her fill of hippy art and punk rock and I joined my friends at the way-too-packed Roosevelt. The point is that First Friday is the kind of place you can even bring your mom to.", "business_id": "GEVK0qDkoCSF2oTaHv9nJg", "stars": 5, "date": "2007-08-07", "useful": 4, "type": "review", "cool": 4}, {"funny": 3, "user_id": "sYQyXDjGaJj7wfaqz5u8KQ", "review_id": "6-pjJQJyx_7AUvMT9IXtpA", "text": "Hooray for Artlink!  If it wasn't for them, there wouldn't be a First Friday event every month.  I think it really adds a little somethin' somethin' to our state to have a great event like this where artists of every genre gather together to display and sell their work.\n\nThe cool thing about First Friday is that not only do you get to check out artwork and other handmade items, but you can also drink while doing so.  In addition to this, there are a ton of cool little restaurants in historic homes, including Fate, which is right in the middle of it all. \n\nThere are usually quite a few different musicians playing throughout the neighborhoods too.  Check it out!", "business_id": "GEVK0qDkoCSF2oTaHv9nJg", "stars": 5, "date": "2007-07-13", "useful": 2, "type": "review", "cool": 4}, {"funny": 4, "user_id": "Yej5B4nd8PqpHMQcmCTDrg", "review_id": "JgYYTG1tYCOiPRz-l00WYA", "text": "* Flamethrowers\n* Stare-down contests\n* Cyclist activists sporting pink undies\n* DJ spinning in a treehouse\n* Cool beer and wine bars\n* Oh yes, and art.  Real, organic art made by our local neighbors.  \n\nIt's not in New York, not in Chicago -- it's all in our downtown Phoenix.\n\nI like to credit Artlink with single-handedly improving the vibrancy of Downtown Phoenix with its First Friday Artwalk.  It's one of my favorite pasttimes about living in Phoenix and is a true testament to the cultural destination our area has become. \n\nI read somewhere that it's the largest artwalk in the country now and is growing each month.   I make it a habit to go every month.  It's something everyone (art-lover or not) should experience.", "business_id": "GEVK0qDkoCSF2oTaHv9nJg", "stars": 5, "date": "2007-09-06", "useful": 4, "type": "review", "cool": 9}, {"funny": 3, "user_id": "4Ri2BZQ5is6IZu7Vh0IsPQ", "review_id": "7q6UQQybWsB3xG8heVfglw", "text": "THE most horrific \"counseling\" experience I have ever had (and there have been many). Go ANYWHERE else. ANYWHERE!\n\nFirst, her husband takes your credit card number in order to make an initial appointment, \"Just in case you don't show up.\" Nothing like \"give me access to your bank account\" to make me feel safe.\n\nIn that initial call when he takes your financial information, there is no warning that the \"counseling\" office (and I use that term loosely) has animals in it. Only when she guides you to the room does she flippantly ask, \"You're not allergic to cats are you?\" No, and good thing I don't hate them, or the nappy dog that greeted me too. \n\nThe \"counseling\" room is disgusting. Couches are covered in cat hair, ceiling tiles with old water stains, an imposing fish tank that is not calming an any way. The chair in which she sits is nowhere near the couch where my husband and I sat, so it was great feeling as though she had no interest in any intimacy or sitting anywhere near us. And I could barely hear her.\n\nShe began dropping F-bombs almost immediately, and rolled her eyes at any other attempts at therapy we had made before. She doesn't listen, at all. Repeatedly asked us the same questions and simply didn't hear us. I had to educate her on Elisabeth Kubler-Ross and she ignorantly informed me that I HAD to go through certain steps in grief. Ummmm, I don't \"have\" to do anything.\n\nHer speech was slurred and incoherent and it often appeared she would fall asleep at any moment.\n\nMy husband was digging his fingers into my leg for two reasons: to keep me from fleeing and because he couldn't believe we were paying this woman $125.\n\nI repeat, go ANYWHERE else.", "business_id": "-DPq2CaW-mBYZ3hfed4pxw", "stars": 1, "date": "2015-08-30", "useful": 5, "type": "review", "cool": 2}, {"funny": 5, "user_id": "JYcCYNWs8Ul6ewG5kCYW4Q", "review_id": "IE3xHWz5aMaeiarwLK68RA", "text": "I hate this gas station. Unfortunately it is the closest one to my house, and it's right by the freeway so I usually stop here for gas before work. The cashiers are friendly but they are sssslllooowww. There is always a line and only one cashier. I usually see another employee behind the counter but they are usually counting money or eating or something and not helping customers. I've been in line and had to wait at least 15 minutes before I could be helped. That's just way to much time to wait when I'm in a semi-hurry to get to work.", "business_id": "2Ka-a7ayZy6fcxqdTxmyhA", "stars": 1, "date": "2014-06-02", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "IRFpQY2q0b6TmppOQW48Bw", "review_id": "wmz6B-eNF0ug3Qdg9SqgQg", "text": "I should have kept driving when we pulled in and there's paramedics with a huge Fire Engine in front of the restaurant with gobs of odd looking people standing around the commotion.  I wanted to look at the food before agreeing to sit down and at first glance it looked pretty decent compared to other chinese buffets I've been to.  \n\nBut if I can offer one piece of advice, dont go there on Fridays for lunch....apparently every Friday morning they host the local nut house for a meal.  Don't get me wrong, it's a nice gesture but after being in the middle of two pretty intense verbal altercations that quickly turned violent, I knew this was going to be one of those experiences that I would write about on Yelp!  There were at least 50 people from the rehab center inside the restaurant trying to get food from the substandard buffet.  I should have also noticed something was \"up\" when I saw all the rehab vans parked in the parking lot.  But trying to keep an open mind, we continued to sit down and tried to eat our meal.  There were a lot of people shouting at each other and arguing, lots of mentally ill people glaring at us almost in an antagonistic manner.  \n\nBesides all that, the food was not super hot and was pretty gross and NOT cheap!  I would NOT recommend this place for it's food and especially not on Fridays if you don't want to get assaulted by a local mental patient.", "business_id": "8Sbs3VDs3KQnawJZR-77MA", "stars": 1, "date": "2012-04-21", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "BA3nNTC8MCUmcOUiVqEkhQ", "review_id": "M02WW1DHpao_x7PRKovcUQ", "text": "Captain's Log, Stardate 2009-09-17.  \n\nStopped in this junction of the galaxy last night with three friends after spending all day moving my Captain's Quarters.  I was sporting my skimpy blue retro work-out shorts with white trim, as I was tired and wasn't in the mood to even change.  I garnered a few odd glances (such to be expected) but we were quickly seated.  I tend not to do buffets now, as I'm really trying to watch my weight, but this place was recommended to me by my Lieutenant.  I'll be beating him later, but I digress.  \n\nThe food was pretty marginal overall.  It was definitely NOT hot enough.  Replicator food on the Enterprise is better than this.  Want to piss me off?  Serve me tepid food and then charge me $8 cubits a head for same.  Some items were better than others.  I almost think there were too many choices.  I'd like to see the choices narrowed, the temperature increased and the food quality improved.  \n\nAs for eating sushi in a place like this?  No way in Hades.  Not last night, not today and certainly not tomorrow.  I'd rather chase Khan with a crippled ship in a nebula before I dine here again.\n\nOverall, C-\n\nThere has to be better choices for buffet Chinese food in central Phoenix, and I'm on a mission to find it.  \"Engage long range scanners, Mr. Sulu.  We must find a suitable class-M Chinese food planet in this sector.\"  :D\n\n--don", "business_id": "8Sbs3VDs3KQnawJZR-77MA", "stars": 2, "date": "2009-09-17", "useful": 3, "type": "review", "cool": 2}, {"funny": 19, "user_id": "AyYKTOCL5qM8589oBsqbfA", "review_id": "rMl62nP4uNoKEZ3ogqEKlg", "text": "Back a second time. Not good let me tell ya.  This time a burger. I expected better, way better. This burger was ordered medium and came out burned and hard and bad as a cinder block. If you know what that is. Why would they send that out to someone to eat. Disgrace in the back. Who is in charge back there.\nOnion soup was so-so. Blah.\nCalled the manager and told him, they need to do something in the kitchen, because I would really hope they could be better. Why, well the environment here is outstanding, a great venue, and the beer is good enough.", "business_id": "0Wy4gw8krao9nGq-sHWFSQ", "stars": 2, "date": "2012-09-09", "useful": 32, "type": "review", "cool": 21}, {"funny": 4, "user_id": "AlXx0P-OhUylep0jNi773g", "review_id": "E0ATdf1AgDjPc41hjck2nQ", "text": "Tuesdays they have live music and the 5 or 10 times I have been, it's always been a great band.\n\nMy absolute FAVOURITE part is when they pass the Star Wars hat after the second set plays and everyone is supposed to throw in a couple bucks for the band. The bartender even says \"just a loonie or a toonie guys, come on\" - then - if someone doesn't pitch they are appropriately shamed. \n\n\"Hey you, yeah... guy averting my gaze... what's amatta, you don't want to throw in a buck?? Seriously!\"\n\nI love it. I love it when good people shame dickheads in public.\n\nAlso the bands are always amazing, and keep an eye on their website for Nintendo tournaments and preserve swaps. \n\nBest. Bar.", "business_id": "0zrKCCElrozCU7zb8mBDnw", "stars": 5, "date": "2012-05-02", "useful": 4, "type": "review", "cool": 3}, {"funny": 7, "user_id": "4uSjk1cryPttErTp6zwa3Q", "review_id": "nmqYpPPXskzXWzaUW-Hi6A", "text": "This would be me on a daily basis.\n\nhttp://www.youtube.com/watch?v=x-s2tLbqlOc&feature=youtube_gdata_player\n\nMy two vices are:\n\n1) A dimly lit local where every nook and cranny has been planned to maximize comfort and cool.\n\n                        And\n\n2) Birthday Cake! \n\nThe Avro wonderfully fulfills both of these. Whether lounging in the comfortably worn in chairs or standing at the bar to vociferously defend that Of Montreal album your friend hated, it's perfect! The fact that the wonderful bartender plays said Of Montreal album all the way through to get a rise out of him is just too awesome to ignore. \n\nWell done, Avro!", "business_id": "0zrKCCElrozCU7zb8mBDnw", "stars": 5, "date": "2011-07-01", "useful": 10, "type": "review", "cool": 9}, {"funny": 7, "user_id": "p_azadim_uWFOXAhhKB3ag", "review_id": "elEmmZNJVGCAFi59lghGbw", "text": "112 degrees outside and I generally don't run my air conditioning in my car except for guests. I finally get to the UPS store on my way home to ship exchange yet another Chrome messenger bag (they're awesome, I'm just picky). As I'm standing at the counter filling out the shipping information I here a mans voice behind me.. \"can I get you some water, or a soda pop? You look like you could use it\".. as I swung around there is one of the most hunky daddies Ive seen in ages! Cropped short hair and shadow beard, tan, furry and had the most devastatingly piercing blue eyes. As I composed myself (yes, I had the vapors) and smiled back I couldn't help but think about his hot body all over...... well never mind! \n\nSuper mega friendly service with smile.. as soon as I got home I was trying to think of anything else I could ship somewhere, anywhere just to see him again. Woof!\n\nYou know where my mind is at this morning!", "business_id": "52qDpzzMSH3hnQL4oCSQtA", "stars": 5, "date": "2008-06-27", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "qibGLHABNReGeJr2w4_8yQ", "review_id": "jCz5_BCoTQ99bIOXxDHmVQ", "text": "OMG! A new BBQ place in my hood!  hoot!  \n\nOk, so I was driving around running errands today, and wanted to do something different.  As I was driving down Southern, I saw that this place just opened this week!  I guess they have one other location in Tempe, and this is their new place.  \n\nAnyways, aside from being family owned, its actually pretty good food.  I got the BBQ brisket sandwich on a bun and it was really really good.  I will probably return in the future for more. \n\nBUT, theres a few things that I noticed while I was here.  Please see below:\n\nOk, first the menu is mediocure. I mean, theres the usual to choose from...BBQ brisket, chicken and pork.  Prices are fair and they state that they have lunch specials every day including Saturday and Sunday.\n\nBut, the sides sucked! I ended up not getting anything on the side.   All they had was redskin potato salad and NO mased potatos.  Also, they had 2 kinds of beans and coleslaw...and that was it.  I was kinda dissapointed.  No mashed potatos?  No corn?  ugh!  none!  \n\nOk, and I admit, Im not Martha Stewart (I know you thought I was, but I'm clearing the air on this once and for all that I'm not) but the place looks like it was decorated by a pothead!  Full fledged pothead! Its like cheba hut meets BBQ in this joint!  (no pun intended!)  WTF gives?  I've never been to a BBQ place and seen a life sized Ozzy Ozborne poster hanging on the wall! Its beyond strange!  OMG!\n\nI just couldn't get past the really odd decor! I mean, it was so weird that I actually deducted a star because it was so out of sorts.  Even though the food here was great, and I will be returning, it was oddly decorated.", "business_id": "AAxn6jh7zzMk99TMyWgGkQ", "stars": 3, "date": "2010-04-18", "useful": 4, "type": "review", "cool": 4}, {"funny": 4, "user_id": "uSMK7y_H2DzRX7WcKXtFgQ", "review_id": "sXcE9maTyIcqTIoiTzBFVQ", "text": "When I first moved to Toronto I lived in the Annex and was really, really excited about making the Regal Beagle my local pub, simply based on the fact that it's the same name as the bar in Three's Company.\n\nI was very disappointed. The place seemed like a bit of a dive and there was no one there at all. I had that \"is there something I should know?\" feeling when I sat down and actually grabbed a menu. The place had no vibe and didn't feel very welcoming at all. We didn't end up getting anything to eat and had a quick drink and bolted.\n\nRegal Beagle is located in that strange area of hotels and apartments on Bloor Street. It's location isn't very exciting as it has that strip-mall kind of steez to it. If it were located on a side street and fixed up its appearance it would be a hot spot I'm sure because who doesn't want to hang out at the same place as Jack Tripper?!", "business_id": "CR1sV3ICjh5J15kOeVLJCg", "stars": 2, "date": "2010-11-11", "useful": 3, "type": "review", "cool": 2}, {"funny": 3, "user_id": "0JVi_ANYw332A4BnqY8ZRw", "review_id": "U1hRyVS3st9NxCHrpGbxrg", "text": "I walked in on a slow Wednesday afternoon to get a quick beer with a friend. The only server on shift saw me walk in and stand at the bar, but she ignored me for a solid five minutes. She was having a conversation with a group at a table, and while she kept turning around to look at me, she never excused herself to seve me.\n\nFinally, when she turned around to grab another menu for the table, I politely asked if she could pour me a beer. And this is where she got really rude. She told me to wait, because it's \"rude to interrupt a conversation\", and when I didn't say anything she muttered that I need to wait for her to get on the other side of the bar. When she was finally at the taps, she lectured me, asking if I've ever worked in the food business (yep, chef and server for four years) and how she's entitled to have a conversation. Then she called me rude, condescending, and inpatient. I was too shocked to say anything else. After she poured my beer, she thumped it on the bar and walked back to the group without a word.\n\nWhile we were sitting on the patio, she bothered us a few times about \"buying another beer already\". I will never, ever, be going to the Regal Beagle again.\n\nAnd the draft beer was stale.", "business_id": "CR1sV3ICjh5J15kOeVLJCg", "stars": 1, "date": "2012-07-04", "useful": 3, "type": "review", "cool": 1}, {"funny": 3, "user_id": "L8QL6NRYVfKYOxCanSQIpA", "review_id": "0A9JcCp3ZXrshOrrKjnhpg", "text": "My son has been taking jujitsu classes here for 4 months I guess the classes are not that bad . What I didn't like was that I decided not to take my son any more but forgot to cancel before they charged my card so before they charged my card again I called to cancel and the receptionist told me that the manager said he would not refund my money and since I didn't give two weeks notice they are going to charge me for an additional month . Pretty much they have poor customer service. The girl that called me told me about policies that when you sign up no one tells you .", "business_id": "4erznA_4VqeQl_t4XyrqMw", "stars": 1, "date": "2014-09-26", "useful": 0, "type": "review", "cool": 0}, {"funny": 4, "user_id": "BjtJ3VkMOxV2Lan037AFuw", "review_id": "CDCggbzx6H_XNLmUWKlXaw", "text": "I went yesterday and the flavor of the day was cheesecake! OMG! It was EPIC! If you are paying by debit or credit card they have a $5.00 minimum.", "business_id": "3TRpWYsF04VLf5y2lk5b4w", "stars": 5, "date": "2010-07-24", "useful": 7, "type": "review", "cool": 5}, {"funny": 3, "user_id": "4wp4XI9AxKNqJima-xahlg", "review_id": "yO0iywMZdOkYLxynksaEOQ", "text": "Ohhhhhh Razzy Fresh you've met your match!!  \n\nMaybe it's because I can't actually stand in front of the machines like I do at Razzy Fresh and decide against the fattening Cake Batter yogurt.  Four choices written on a dry erase board.  \n\nThe only one my eyes went to was NY Cheesecake.  Of course!  It's like picking the most expensive thing on the menu....except this time it's the worst for you.  \n\nBut gosh darnit, it was GOOOOOD!  I'm hooked!  Pile on the brownie bits and sprinkles and I'm in.  That's how I roll, healthy yogurt turned bad but oh so good!", "business_id": "3TRpWYsF04VLf5y2lk5b4w", "stars": 4, "date": "2011-07-19", "useful": 3, "type": "review", "cool": 4}, {"funny": 3, "user_id": "wzyGNvArcpUjZauRWFrKHA", "review_id": "MRLfv1wJzAU1YiG9PT82ug", "text": "6-11.   \n\nThat's what this should be called because on weekdays those are the hours it's open.    This is a super convenient place if you're staying at the DoubleTree and they have a ton of food, snacks, drinks available to satisfy nearly every urge.\n\nIt seemed like this one guy was working every time I went in and he was very cool, friendly and professional.  The place is pretty clean, although there is always cheese residue on the nachos machine, which just sort of looks gross.\n\nI can't bump this up to four stars because they do not have seltzer or club soda.  I need my fizzy water and it drives me nuts I can't get it at convenience stores outside of NYC.\n\nBut overall, this place is good.  Thanks for letting me give you the 411 on this 7-11.", "business_id": "9cYuHvnoPhm1UpLvHvoWWw", "stars": 3, "date": "2013-05-07", "useful": 1, "type": "review", "cool": 0}, {"funny": 3, "user_id": "IM6ss5QP852np0C4Ponv2g", "review_id": "NLQnEAOKhaXUWCUV4FyxOg", "text": "I just read the last review about O'Bol and then snuck out of the office and headed over there, looking for a healthy-ish meal. I'm not vegan, but I've always been a sucker for simulated meats. You can imagine how shocked I was when I got there and saw things like ROAST CHICKEN LEG and MEATBALLS on the menu. Talk about doing a complete 180 on your original concept.\n\nBut since I went all the way over there, and nothing else in that food court appealed to me, and I'm not even vegan and therefore have no dietary restrictions, I decided that I was going to eat O'Bol anyway.\n\nI went with the french chicken (I think that's what it was called), which was basically a chicken stew with peas and squash, served in a bowl over rice and roasted potatoes. I also had a squash soup. The verdict? It was pretty good for a food court kiosque, and even though it wasn't what I was expecting, I wasn't really disappointed. It's kind of nice to eat something relatively healthy in a food court (and I mean that in comparison to all the other very greasy and oily things you might be forced to eat in this kind of setting).\n\nIt's probably about as homey as you can get in a food court.\n\nAnyway, I think I've gone past the legal limit of the amount of times you can repeat the term \"food court\" in one review, so I'll stop here. But if you're near Bonaventure, and the idea of deciding which mediocre lunch option will leave you the least depressed, do head on over to O'Bol.", "business_id": "BH30SUqfbOlhGpncCsONKg", "stars": 3, "date": "2011-12-01", "useful": 3, "type": "review", "cool": 2}, {"funny": 9, "user_id": "PKaRDtzLIO7BznR4HmMGLw", "review_id": "m2_z0wCtSTTPFK1xmIkk9A", "text": "This teensy place is located on a forlorn part of the strip; you know, that stretch bridging New Vegas and Old Vegas that is adorned only by low-lying cheap T-shirt and souvenir warehouses...the part that reminds  you that you are in the bone dry desert.\n\nAs my friends and I (all of still us hungover at 4 p.m.) walked under the daze of the mid-afternoon sun, coffee seemed like a necessity and SexxPresso seemed like just the quirky (and indeed only) thing we needed.\n\nTittering, we perused a small wall of shabby nylon lingerie, patent leather (a.k.a. cheap vinyl) bondage gear, and glow-in-the-dark dildos before walking up to the counter, where a scruffy, middle-aged, not unobese guy in a yellowed white tee (or was it a wifebeater) greeted us. \n\nBemoaning the state of the economy and the prudence of Vegas tourists nowadays, he took our orders. Behind him, a hipless bottle blonde who looked like she was 12 years old (this is not to imply that the employees at this business are not of age; she just looked that way for sure) fumbled her way around the machinery, ultimately producing our steaming cups with downcast eyes and a flourish of limp synthetic lace.\n\nI forget the name of what I ordered, but I guarantee you that the title was unironically smutty. Back in the daylight, I took an awkward and slightly guilty gulp of cherry-infused mocha. There was nothing wrong with the temperature or the quality of it, but for some reason, I kept thinking about flavored lube and worrying that it was the secret ingredient. Right then, my cocky male coffee connoisseur friend, the only one who could have potentially enjoyed this whole scene, aptly expressed everyone's feelings - \"BLAAAAAGH! You CAN'T mix SEX with COFFEE, man...now all I feel like is that I'm drinking that 12-year-old girl's ASSSSS...tasting her ASSSSSS....\"\n\nWe walked the rest of the way in depressed silence and got our blood flowing with the Stratosphere rides instead. I want to wish this severely undervisited place luck, but unfortunately, a coffee-cum-sex-shop is not neither a turnon nor a picker-upper, especially not on the dead part of the Vegas strip.", "business_id": "3r2e67holZG6QjiWnKxqjg", "stars": 2, "date": "2010-06-29", "useful": 1, "type": "review", "cool": 3}, {"funny": 9, "user_id": "QuZbJquRtbY9O9JrB9NpxQ", "review_id": "uMfl7c59pri8svAN5njnYA", "text": "With a name like Sexxpresso I was expecting the Hooter's version of coffee.  I got the Hooter's part but the coffee was horrible.  Espresso was somewhere between burnt and rancid.  Blech.\n\nIt'll take more than Hooter's to get me back.  I don't care what the schtick is, you've got to have decent coffee.\n\nBlech.\n\nBlech.\n\nBlah.\n\nYadda.\n\nYadda.\n\nYadda.", "business_id": "3r2e67holZG6QjiWnKxqjg", "stars": 1, "date": "2008-10-09", "useful": 3, "type": "review", "cool": 1}, {"funny": 5, "user_id": "rzpbbpb_oBW42aJxL6ixlQ", "review_id": "_bGdMu-Xd8gtHXfG1h-ubg", "text": "Possibly one of the most unusual places i've been to.  My tuxedo rental place was \"close\" to here so we stopped by a couple times for coffee.  The baristas are in bikinis...so yeah it's a bikini coffee shop. The girls were very nice and complimentary.  I'd say a step above Rock of Love material.  If you can make me good coffee you could wear 3 parkas for all it's worth.  But alas, the coffee was mediocre.  My friend ordered the Erotic Pleasure, which was white chocolate mocha, and he seemed to enjoy it...but my coffee was bland.  And once i purchased it, she forgot to make it.  I paid for it, then watched her forget to pour it out for me.  I was in disbelief. \n\nThe size of your coffee is either B or DD.  It took me a minute to understand that.  I swear I stopped by b/c i heard they had good coffee!", "business_id": "3r2e67holZG6QjiWnKxqjg", "stars": 2, "date": "2009-01-05", "useful": 4, "type": "review", "cool": 5}, {"funny": 3, "user_id": "BhwaJuqrwt_Stlf4XndzzQ", "review_id": "bj6HJ6Zq1JfY0SQFdcJW8A", "text": "OK, first of all:  THEY MOVED.  No longer located on Flamingo, they are now located right on the Strip.\n\nSecondly, the store was populated (the one time I was there) by two ditzy blondes who -- when you add them together -- MAY have had a two-digit IQ, and a brunette who was either smart enough not to open her mouth or dumb enough not to know she was supposed to talk to customers.\n\nOh, yeah, and there was a old(er) guy with salt-and-pepper hair (and a beard to match) who actually had to make the drinks, because the scantily-clad girls (one in a bustier and garter belt, one in a baby doll, and one in a bra and panties -- don't they know steamed milk can be HOT???) didn't know how to make a straight espresso, let alone something as complicated as a latte!  (OK, I answered my own question:  no, they DIDN'T realize steamed milk was hot -- they never touch the equipment!)\n\nTwo stars because the espresso was indeed better than Starbuck's.  Minus one star because there is no one there with enough intelligence to count out correct change without having someone help them.  Add one star because the girls were cute, in a really creepy, Humbert Humbert-and-Lolita, \"only in Vegas\" sort of way.  \n\nAnd I swear I really DID go for the coffee . . . it was recommended on the yelp! Vegas talk page!", "business_id": "3r2e67holZG6QjiWnKxqjg", "stars": 2, "date": "2008-09-22", "useful": 1, "type": "review", "cool": 0}, {"funny": 9, "user_id": "jO44Apni7iJZVVK4HQ60tA", "review_id": "PNo5OEqwDuqW7Ro2mw_usw", "text": "What on earth was I thinking? \n\nI know Rascal House pizza is terrible-- weird, sweet crust reminiscent of bisquick, sweet sauce, tasteless toppings.  It was one of three places to eat on Euclid whilst I was taking my Bar Review at CSU (not as fun as it sounds-- bar exam review, not a review of bars).  The other two were an Arby's and a scary greasy spoon.  So I ended up having at Rascal House more times than I care to count.  Imagine having to study for the most important test of your life AND having to eat bad pizza along with it.  The horror.  The horror.\n\nI've had it since then, because downtown firms always seem to order it for working lunches.  It has not improved.\n\nSo, here I am, back at CSU to take a few classes.  What to have for lunch.  I'm pretty sick of Subway.  Nothing at the school food service looks good today.  What to get?  A salad.  How hard can a salad be?  Surely Rascal House has a simple, tasty salad.  Most  pizza places do.\n\nSwamp water.  That's what it tasted like.  The lettuce bore the unmistakeable taste of pre-cut, bagged lettuce that had been siting in the cooler for a while until someone opend it and dumped it into a container without washing it.  (I worked at a few dives to put myself through undergrad.  I know how that works.)  The carrot shreds were completly dry and had absorbed whatever scary odors were going around the cooler.  The turkey and ham were both of the ultra processed, parts-is-parts variety. there was about a tablespoon of cheese and two tiny slices of hard boiled egg.  Sad.\n\nTHEN, I had to eat it whilst listening to really bad, really loud 1980s top 40.   No Cure, no Depeche Mode.  1980s Hambone music.\n\nI'm going out to find an insulated lunch bag.", "business_id": "4s-eHLQcoMqAgfzbiQsKIw", "stars": 1, "date": "2009-08-27", "useful": 5, "type": "review", "cool": 4}, {"funny": 5, "user_id": "OLn8EvPsu4hNug8V5PF2jA", "review_id": "0760u8XJ8GsxkE654VI5QA", "text": "I always feel the need to look around me when I get in and out of my car here, even in broad daylight. I don't know what it is about this intersection, but the amount of guys who look like K-Fed before he became K-Fat, trying to holla right at the doors of this place, is both strong and unsettling. \n\nThis store is dingy looking and has the nastiest smell of dried spit when you walk in. It's just gross. I wish this place would just have a quick power wash and this place would be good to go.\n\nSelection is okay. Don't expect slushie type drinks of any kind. Coffee drinks are cheap and prices aren't too terrible, but eh, I really don't like stopping in here.", "business_id": "7ZPMngvH89iNF0RzFiIEqw", "stars": 2, "date": "2014-05-19", "useful": 3, "type": "review", "cool": 3}, {"funny": 4, "user_id": "2EuPAGalYnP7eSxPgFCNDg", "review_id": "rArcXxFwNPxLyJ_-MkOhRg", "text": "Good karma fills the air here at Pizza Buddha, it's the newest pizza place located in the Carnegie Center strip mall along Horizon Ridge. The focus is on a \"zen relaxed\" atmosphere, with brick oven pizza and nuances of Asian cuisine (mostly the sides) peppering the menu. \n\nAtmosphere/Ambiance A - It's trendy casual. Interior is Asian themed with splashes of Asian art on the walls and ceiling. (Love the dragon painted beam) The dining area is small 5 tables of two on each side. You can easily rearrange seating for 2 or more. The middle there's a longer high top table for larger parties. There is also seating in the small bar area at back of restaurant. The atmosphere is pretty relaxed, Easy Rock tunes (Brown Eyed Girl) was playing in the background.  No TV's though. Still it's a nice place for lunch or stop by after work and chill in the small bar area kind of joint.\n  \nFood B++ -  Now take into account I'm not a big fan of pizza lately. If you ever notice my pix at pizza places I dine at, I order everything but pizza most of the time...lol. But  for first visit sake I had some here.  All the pizzas are themed with Asian names, but toppings are just your average pizza toppings. I had the Ho-Tai(The Happy Buddha)  which was artichoke hearts, spinach, cherry tomatoes, garlic and olive oil. The crust was baked perfect, NY style, not super thin crust though. The ingredients fresh and good quality. The sauce was evenly distributed on pizza. It didn't overpower the cheese and veggies. I enjoyed the pizza.  It made me happy. \n   \nI also had the chicken salad. Thin strips of tender white chicken and napa cabbage,and rice noodles, the vinaigrette used was perfect for me, just slightly sweet and not too tangy and evenly tossed in the salad. I will most likely come here just to have this salad for lunch next time.  Along with the Japanese pretzel sticks.  Those were different. Tiny pretzel sticks with garlic infused chili oil to dip. \n \nPrices are in the moderate range, I didn't see any lunch hour or happy hour specials.\n  \nService A+ - Friendly and efficient. For being open just a few days, service far out exceeded my expectations.  My server was knowledgeable about menu items and was able to answer my questions. The owner Mark also came by and followed up and chatted with me. He takes great pride and rightfully so with his new place.  Loves everything about Hawaii and the shave ice served here is inspired by Matsumoto's.  It's not quite like shave ice from the 808, but nice attempt with the Azuki (sweet red beans) and vanilla ice cream.\n\nThe other fun touches....The Wish Book! When you are presented with your check at the end, you get a Smartie candy and a little booklet where you get to write your wish and insert it in the wish keeper that's displayed in the middle of dining area. My wish didn't really come true this time around, a 49er win..ha! I had a nice dining experience though, that's what counts.", "business_id": "0C4b8LsgLuL7_DuPXE729A", "stars": 4, "date": "2012-11-12", "useful": 10, "type": "review", "cool": 7}, {"funny": 3, "user_id": "1XBLvCUSS9cIgYeHvseX0w", "review_id": "cipp44ApzKToAS06Bz4WpQ", "text": "An enjoyable experience!\n\nI just wanted a burger.  And a beer.  And McDonalds doesn't serve both ;)\n\nI immediately liked the decor and ambiance at Oh Burger, and as a party of two we seated ourselves at a little table to the left of the bar.  The restaurant was not incredibly busy but busy enough that most tables and a few bar stools were accounted for. \n\nThe waitress was very friendly, our order was taken and the drinks arrived quickly.  Our food was delivered by a very personable man whom we assumed was the manager.\n\nI had the 8oz bison burger with mushrooms, a side of fries and Sapporo (a damn good Japanese beer!). I have to admit it wasn't the greatest burger that I've ever had, but what I really appreciated was that it was not dripping with grease and the toppings were fresh and delicious.  The. Fries. Were. Awesome.\n\nFor a quick bite, I'd go back any time.", "business_id": "1qUzvlZLyT_ELWnIokUTJw", "stars": 4, "date": "2010-01-23", "useful": 2, "type": "review", "cool": 2}, {"funny": 3, "user_id": "kP2U1s_sjQfHO9grxiyDTA", "review_id": "gVMxyg3Y9OeUi-driM3o7A", "text": "Juicy Beefy Goodness\n\nI can't lay claim to Chris \"burger baron\" P.'s bona fide burger-bonanza breadth, but I've had a few burgers in my time.  This was the best one I can remember.\n\nI was treated well from the minute I walked in the door, which itself took some effort - use the middle door instead of trying and retrying the side ones in front of a crowd (like I did).  Had a good laugh and a warm welcome from two staff waiting on the inside before catching up with waiting friends Kat \"the app for that\" F. and the aforementioned burger baron.\n\nI was greeted by the lovely and charming Vharay who advised on burger selection and beer offerings before provisioning a promptly pulled pint and a business card (as I had suggested that she didn't really have one).  I ordered the Oh Boy Classic with 3 Cheese combo, with a half-and-half fries and onion rings (it's not on the menu, although I think it should be, so don't count on this).  They have Mill Street Tankhouse on tap, and I indulged.  \n\nThe burger came OEM with lettuce, tomato, guacamole, and a good slice each of cheddar, swiss and havarti.  Aftermarket options exist, but the stock version sounded good enough already.\n\nAnd it was.\n\n8 ounces of AAA ground chuck, grilled to perfection and juicier than a Georgia peach in full season.  The guacamole had a creamy texture and flavour that added a high note to the gooey cheesy goodness, yet somehow through all that rich flavour the patty still managed to shine through and remind me why I was there in the first place.  I was in heaven for the three minutes that burger lasted in my hands.\n\nThe onion rings were fantastic - just a really well-made, classic ring.  Fries were thin-cut, which Is great for flavour, but they get cold fast (eat them first).  They were also perfectly salted.\n\nInteresting fact:  The walls in the bathroom are painted with blackboard paint.", "business_id": "1qUzvlZLyT_ELWnIokUTJw", "stars": 5, "date": "2009-11-26", "useful": 6, "type": "review", "cool": 5}, {"funny": 5, "user_id": "-pXs08gJq9ExIk275YLvPg", "review_id": "f-RoneakNVbZL5ai_2hRqA", "text": "everything that leads up to you embarking upon your eating experience seemed compelling.  oh boy - catchy enough name.  queen west - hip enough area.  even a few honest-ed style lights alerting me to it being \"open\" for business lure me inside with the hope of a juicy wheel of beef to call my own.  of course, the promise of a special on mill st. beer with my burger for a mere 16 bucks (right, mere...) clinched it for me.  \n\nwell for a hefty price like that, it fell very short.  firstly, there was no mill street left.  no one has to go business school or ever work in a restaurant to know that if you dont have it available, DONT ADVERTISE IT.  i had to mention it to them to remove the sign, which they did.  \n\nthe waitresses serving me were very nice, patient and understanding.  i settled for a sleemans, which was offered to me at a mere three bucks (here the \"mere\" is meant for real).  I sat and watched silent snippets of a women's hockey game in the olympics on one of the tvs that besieged you as you ate. (are we really that boring to each other?).  now i was in a rush and probably shouldnt have come there in the first place because i had a play to catch.  but i asked them to check on my burger - AAA 8 oz burger with havarti, cheddar, swiss, guacamole, tomato, lettuce - and they did and it came out a minute later - DRY AS A BONE.\n\ni imagine that they are required to cook a burger to a certain doneness for legal reasons or some such, but when you have to load it up with mayo and heinz dijon (low quality for sure) just so you can stomach it, there is a problem.  \n\ni really cant express how tragic it is for me when i pay through the nose for food and it sucks.  they offered me a 15 percent discount card for the next time....i left it there.\n\nim willing to acknowledge that a restaurant, a waitress, a cook can have a bad day, of course, but it is hard to return to a place which f-bombs it up the first time around on something you really could have done brilliantly much better at home, especially when they have the gumption to charge as much as they do - and if you tell me that the AAA prime ground chuck, etc., is the reason the price is up that high, then i say to you if i am supposed to afford that meat the respect it deserves (that already sounds weird, but okay), then you, as the cook better idolize it and make me faint with nirvana the moment after it hits my palate.", "business_id": "1qUzvlZLyT_ELWnIokUTJw", "stars": 2, "date": "2010-02-16", "useful": 5, "type": "review", "cool": 5}, {"funny": 8, "user_id": "EhO5C7t3yfGFLvsTyK5PPw", "review_id": "rTPviSKSxPGHkJAIvJOXWw", "text": "Boy Oh Boy how you leave me wanting. I had high hopes for finally hitting the mother lode for burgers. (sigh) The previous reviews just went all over the place and I wasn't so sure what to expect but when my brother burger reviewer Chris P. sang the praises of the beef on a bun at Oh Boy I thought that they would be all that and a bag of chips. \n\nI had appointments on Camden Street this morning so on my way out I thought I'd grab a burger from Oh Boy and take it for a dance. Trouble was that this burger couldn't even two step and basically had two left feet. I arrived at Oh Boy literally on the nose of noon hoping to beat the lunch rush and ordered up an Oh Little Boy Combo with sweet potato fries. Most of the major complaints I've read about OB's is that they seem to overcook the burgers so I figured if I ordered up the baby burgers and being smaller, they'd spend less time on the grill. Makes sense, right? Ummmmm....apparently not. It took almost 25 minutes before my order finally surfaced. \n\nSo out the door I dash with my lunch bag in hand only to discover ten minutes later that they eff'ed up my order. Wrong kind of cheese on those little sliders. No sweet potato fries but rather regular french fries which were soggy and cold by the time I got to them. As for those little 2 ounce burgers.... well they were pretty much small pieces of carbon on a bun. Did I order blackened burgers? They were dry and crusty and no amount of toppings was going to save these little charred nuggets. \n\nSomeone needs to smack those grill boys with a hot spatula because when you eff up Momma's burger she is gonna be pissed big time. For this shitty bag of baby burgers I forked out $13 bucks. I felt like I'd been hosed. \n\nThe restaurant itself is really cool. It's large and unlike Craft that can seat only about 8 people, the Oh Boy seats about 100 people. I love the bar area and I'm hopeful that eating in the restaurant would yield a much more favorable result. I've still got my discount coupons from the very first time I wandered in and the grill was out of commission. If anyone is interested in using them, let me know, I'm not so sure I'm ready to go back to Oh Boy just yet. \n\nAfterwards I thought to myself that I should have walked a little further east and gone in to the Leslieville Cheese Store and gotten a grilled cheese for lunch. I would have been a whole lot happier.", "business_id": "1qUzvlZLyT_ELWnIokUTJw", "stars": 2, "date": "2009-12-05", "useful": 7, "type": "review", "cool": 4}, {"funny": 7, "user_id": "vP85Nf2ts5iuCAfsgKSdiw", "review_id": "4xvUhBqMAHi2pyIKV320xA", "text": "I haven't been to the movies in quite a few years, but I had been to Phoenix prior to it switching hands. It was Destinta at one point, and also had another name before that but I can't remember. Anyways, since my last visit, the building has added a trampoline park, which has the same entrance as the movie theater. Today, my husband and I went to see The Revenant. The movies are the movies, so here is my simple breakdown...\n\nPros: \n~All tickets are $6....except on Tuesdays, which is $4. Not bad at all.\n~The seats are comfortable and the theater was clean.\n~If you had little ones attending a birthday party at the trampoline park (like my niece does all the time at this location), you could - hopefully - keep busy with a movie. There are also two rock climbing walls and arcade type games.\n\nCons: \n~Bathrooms were gross. Water all over the counters, garbage on the floor, etc. I opened one stall door and apparently the toilet had a leak. I deduced this in part to 1) my fine detective skills and 2) a large clear plastic bag that was over the entire back of the toilet and went into a garbage can filled to the brim with dirty toilet water next to it. Why not just put an \"out of order\" sign up?\n~Food and drink prices. Obvious, I know. A medium fountain drink is $4,75, which is just ridiculous. Also, apparently, it is now harder to sneak foodstuff in. There is a sign up at the front door prohibiting bringing in any food or drink and the establishment reserves the right to check your bags. Hmmm I guess the staff was slacking today because they missed my bottled water and bag of pretzels.\n\nAll that being said, ticket prices are still cheap. I would return if I found another movie I was interested in seeing.", "business_id": "4bOUHefNIMkOd5VqfpDgrQ", "stars": 3, "date": "2016-03-02", "useful": 10, "type": "review", "cool": 11}, {"funny": 3, "user_id": "_PogIvICTS-uaZLXLX-OnQ", "review_id": "W1VLEmK89Gv6GK8yXpGbOw", "text": "Chic chic boutique lounge with plush comfortable seating, strong cocktails and great service.\n\nThe architectural design is gorgeous, complete with a massive 1700-gallon aquarium, imposing Roman columns, beautiful seahhorse and mermaid statues and plush leather armchairs.  The blend of Roman architechture, modern touches and ocean inspiration is very relaxing and peaceful.\n\n We enjoyed a few spicy bloody Marys and cocktails before our lunch over at Mesa Grill. My boyfriend caught some football action and played some blackjack on one of their electronic machines. \n\nWonderful relaxing lounge in Ceasar's Palace. A great place to put your feet up after some rigorous shopping :-)", "business_id": "7YBLX19t_P_CfPzM3JbolA", "stars": 5, "date": "2012-01-08", "useful": 2, "type": "review", "cool": 3}, {"funny": 5, "user_id": "i_DR3vdE73nVm2GlMbGpGA", "review_id": "SWudZEMdUFUO97nRFRCyGA", "text": "Aquariums and booze. Count me in...\n\nI call these bars, \"Pit Stops\". They are in every casino on the Strip and they are all meant to do one thing, squeeze just a little extra money out of that wallet before heading into the club or the fine dining restaurant.  \n\nThe Seahorse Lounge is located just across from Omnia and Searsucker in Caesars. It's not amazing, the drinks are ok, but the people watching is stellar. All walks of life cruise by here; the club girls, midwestern families, barflys, and the \"dude-bros\" just looking for booty. \n\nBONUS: They have an aquarium you can stare at when the people watching hits a lull.", "business_id": "7YBLX19t_P_CfPzM3JbolA", "stars": 3, "date": "2015-07-07", "useful": 7, "type": "review", "cool": 6}, {"funny": 7, "user_id": "BmxqEeNmHW2b2nju1vMhmQ", "review_id": "Eqz-cTZiMP2sE9scrqgMHg", "text": "This is not a five star review because this is the best hotspot in Vegas.  Nor is it a five star review because the Seahorse Lounge is so lush, plush, or otherwise updated.  \nNay, this is not that five star review.  \n\nI'm giving the Seahorse Lounge 5 starts because of the following:\n- they always seem to have an available table and a few extra chairs around\n- they have Hendricks for my G&Ts (tho last Vegas trip we drank so much of it that they may *still* be restocking)\n- the waitresses have some of the worst costumes in all of Vegas (think midwestern high school's production of The Little Mermaid)\n- it's quieter than other bars in Vegas so you have half a prayer of having a conversation (if that's your thing)\n- GIANT FISH TANK\n- Open late (or early, depending on your perspective)", "business_id": "7YBLX19t_P_CfPzM3JbolA", "stars": 5, "date": "2010-08-29", "useful": 4, "type": "review", "cool": 3}, {"funny": 3, "user_id": "DHRupjFv4GyD0tEdj-QNjQ", "review_id": "qkjwNZjreKIKFaYr0PjA9Q", "text": "Pino is a decent place to relax for a drink but it seems to be struggling with an identity crisis of \"am I a pub? am I a restaurant? am I a lounge?\" - and it was indeed a bit odd that such a huge venue was relatively empty on a rainy Friday night. especially since the rain didn't seem to be stopping the crowds on Crescent Street from going to other places.\n\nthey have an outdoor seating area upstairs with a long canopy over it - this was great, because we got the cool fresh air and none of the rain. and it's actually fairly spacious, wrapping around the entire place (it's on the corner). \n\nI ordered some of the house white wine. it was about average, though it also was fairly cheap, so I'm not complaining too much. service was pretty fast too.\n\nthe fact that it is so roomy here might have made it seem less busy than it was. there were plenty of patrons up near us, but there were two HUGE rooms inside (on the second floor alone) that were empty. what gives? maybe they focus more on large-scale events.\n\nseems like an alright place to relax for a drink or two, but not much more. I like low-key, but it was a bit too low-key for me.", "business_id": "83Vim9NHp66yLPPVlCl5Iw", "stars": 2, "date": "2012-08-21", "useful": 6, "type": "review", "cool": 3}, {"funny": 4, "user_id": "CXwHjHxwGDzRTgvU_NdLIQ", "review_id": "VOJUBnj--dDlw_kuhgHFtg", "text": "Hello and goodbye!!! \n\nI was disappointed with the \"quality\" of fish here. Actually, it was probably the least fresh tasting sushi I've had in years. (And I've eaten a lot of mediocre sushi!) \n\nI'm not giving Hello Sushi only one star because the owner/sushi chef/server was nice enough and it could have just been a bad day when I was there. Nonetheless, I can't imagine a reason I would ever return.", "business_id": "59okD6I_2Sy925jXKljgCg", "stars": 2, "date": "2011-10-05", "useful": 4, "type": "review", "cool": 4}, {"funny": 10, "user_id": "5L6jkxWlbBO3YWP6kQ2VrQ", "review_id": "lEswdtcE5fJpUPhksXekfQ", "text": "Ugh. My ladies and I rolled in sometime past midnight on a Saturday, i.e. normal bar time, excited to make it rain. We came from Parts & Labour next door, where the service was terrible but at least they had Summerlicious to use as a poor excuse. Can't say the same for Geraldine, where we were greeted by a permanent air of I-hate-our-customers.\n\nAs our server brought the first drink (and first bill) to our table, she informed us that it was \"cash and carry\" because it was \"late\". We were like, \"Huh?\" It wasn't even busy and the bar wasn't closing. She said we'd have to pay for each drink as we went. I've never been to a sit-down place with $18+tax drinks that had a bill accompany every glass, but it's certainly a good way to leave a sour taste in people's mouths before they've even tasted the Sazerac.\n\nWe'd barely taken our first sips when the server came back, pointedly* tapped on the cheque she'd just brought my friend and said something like, \"Your bill's right here.\" Yeah, we know! You told us five seconds ago. Holy tacky.\n\nBefore we left, another friend with more cojones than yours truly spoke to our server to politely question the automatic 20% gratuity** based on the level (read: low) of service she received. Even after some back and forth, in an amazing demonstration of the very lack of customer service skills being called out, the server refused to reissue the bill. Seriously? Is the auto-tip on groups here a free pass to be awful? Another girl accidentally double-tipped because of this, too.\n\nI'm not sure what the folks at Geraldine found to dislike about making quick money on a chilled-out group downing pricy drinks for maybe an hour. The styling is fancy but the vibe was so not. Maybe it was just this one server, but I won't be back to find out. Cheers!\n\n*Speaking of \"pointedly\", the bartender scooped up a loose flower petal on the side of my glass with his finger and plopped it right back in, giving my cocktail what NSYNC would refer to as a \"digital digital getdown\". I'm no flower myself, so I didn't mind, but a germaphobe might shudder.\n**Quick PSA on auto-tips courtesy of The Grid - you don't actually have to suck it up if the service is shitty: http://www.thegridto.com/blog-post/what-the-food-whats-the-deal-with-automatic-gratuities-for-groups/", "business_id": "3num8fBJ9Z0T_HfshUNcrA", "stars": 1, "date": "2014-07-14", "useful": 11, "type": "review", "cool": 6}, {"funny": 7, "user_id": "xN-xoLhTHUFfTS_BMGG0xg", "review_id": "9Ks9J-FI1OOyWMFS3S4ltg", "text": "The Brass Rail is what a dive bar should be.  Slightly uncomfortable with bad furnishings, decent beer, and a great place to hang.  Every time I've come I've enjoyed it.  There's even an electronic darts game for when you're tired of squeezing into a tiny booth, watching bad TV or wondering why they sell so many portable bottles of alcohol from the counter.\n\nI love you Brass Rail, you are divetastic, and you make me happy.", "business_id": "6UiBaTM6_ENF_L53C0CHTw", "stars": 4, "date": "2010-10-02", "useful": 2, "type": "review", "cool": 3}, {"funny": 4, "user_id": "GxkY7BqazkQu6I9HBDpbqQ", "review_id": "nrTgFPrKu5h4zyZZ-Xof8A", "text": "This is the absolute worst place in Downtown Champaign (other than Phoenix), and I mean that in the best way possible. On a Friday night, the place was near deserted after about 10:30pm, with a regular or two, a couple of drunks and a group of quiet students. Seating is in cramped booths unsuitable for people taller than 6', or at the bar. The interior is hideous: bugly, dated paneling, linoleum and illumination by neon promo signs. My kind of place.\n\nThey have 2 beers on tap as I recall, PBR and High Life. The special that night was Hamm's cans, which were had for (surprisingly, to me) more than a dollar each. The good news is that either Hamm's is a lot better than I remember, or I was drunker than I thought. I had been drinking 'good' beer at other downtown establishments known for the same, but the Hamm's were somehow better. Thinking about how well those Hamm's hit the spot makes me want one right now.\n\nThe Brass Rail has an internet juke box to kill the otherwise oppressive silence, and is a total ripoff if you put less than $5 in, but has an impressive selection. They have a soft-tip dartboard, a couple of tvs and a broken pinball machine. They also have frozen pizza that they can make for you for less than $5, but it is pretty crappy pizza. Huber's' pizza is way better. Ours got burnt black in places and was too salty but  was still promptly devoured. For two days I wondered how I burned my mouth.\n\nService is great, and friendly. The bartender has an excellent rapport with her patrons, a quick wit and a kindness that comes across right away. I can definitely see this as a place to go back to.", "business_id": "6UiBaTM6_ENF_L53C0CHTw", "stars": 4, "date": "2010-09-28", "useful": 4, "type": "review", "cool": 1}, {"funny": 3, "user_id": "W9MPolPlUiUEXYfGnYiHEQ", "review_id": "X5szfBdkObEaW2rEab9W7g", "text": "another F & E grocery store.. i can't help myself..i love shopping at fresh and easy. this one is bright and clean and normally is fully stocked.  i usually pop in for the veggies, pop chips, hummus, chicken. you can find some great deals on their veggies. if you really want to save money- they have an aisle of items getting ready to expire that day and you can get those items for 50 percent off!   i will let you in on my favorite treats:  spongecake and a dollop of fat free whip and fresh strawberries yummy!", "business_id": "Elt5g53dYiIICTFJ09NbgA", "stars": 4, "date": "2011-04-06", "useful": 4, "type": "review", "cool": 4}, {"funny": 4, "user_id": "Cwkb0lYxcGk5H4Yg2zMKlg", "review_id": "T_wfQqluhCCWOjefHZZQSQ", "text": "so check it out: they have these prepackaged meals in the back that you just pop in the microwave and BAM!, there's dinner. well I'm not one to sacrifice on taste so I was really thrilled with the chicken masala.  4 and a half minutes later I was eating some pretty tasty lunch, and it only cost 479 or whatever (if I were literate I would have read that if I purchased three there would have been a 20% discount).\n\nAlso tasted the bacon and cheese quiche, not microwaveable but really exceptional.  My good man dallas g. bought two types of hummus, both largely satisfactory and more!  (spicy jalapeno hummus and roasted red pepper hummus...)\n\nBut on the way home, we passed this guy in a late-model convertible mustang, top up, windows closed, wearing his fuck-me sunglasses and smoking a cigar?!?!  So I take away one star for that because any business situated this close to that type of douchebaggery needs to be smacked down, and smacked down hard.  I am quite certain that were we able to see the whole wardrobe there would be socks with tevas going on down below.  Or crocs.  same diff.\n\nBut I add one star back for the fact that you can pretty much get any bag of veggies and just pop them in the micro for a nice steamed side dish, or all their meats that look good, or the fact that capn crunch was the first thing I saw on the way in.  It's all good, after all.", "business_id": "Elt5g53dYiIICTFJ09NbgA", "stars": 5, "date": "2009-07-09", "useful": 4, "type": "review", "cool": 3}, {"funny": 3, "user_id": "N3oNEwh0qgPqPP3Em6wJXw", "review_id": "FDFt3KhVu3n8z3W3Cabc5Q", "text": "My name is David and I am addicted to sweets. I started my day with a trip to Crepe Shack and still stopped at Sweet Ruby Jane to look at their selection of desserts.\n\nFor a long time I thought that the Southeast was falling behind to Summerlin, but not any more. The growth of unique, affordable, and fun eateries has made it so that I rarely venture up north anymore. \n\nSRJ offers many delectable treats for a reasonable price. Before committing to anything, they offer tastings of the day. The macadamia white fudge is magnificent. They were not pieces of the nut, but actual whole ones mixed into the confection. Since I had eaten my amount of sweets for the day, I had picked up a piece of pumpkin cake ($2.25) and a package of peanut butter cookies ($3) for my parents. I took a bite of the cake while sitting with my mom and it was moist, had the signature taste of fall, and not sickeningly sweet. The cookies were on sale since they were not made that day. A pack of four large cookies were only $3. I felt them and they were still soft. \n\nThey were doing a test run on seasoned roast nuts. The curry one was nice, but needed more spice. The lady behind the counter was very receptive about suggestions. Nice to see people wanting an honest opinion instead of asking and turning a deaf ear.", "business_id": "0aKsGxx7XP2TMs_fn_9xVw", "stars": 4, "date": "2011-11-07", "useful": 4, "type": "review", "cool": 2}, {"funny": 4, "user_id": "ZY3ZalGTEWp7M7clk3c8cw", "review_id": "S2xmnV4lv9_GFO7OwPQPVQ", "text": "This is one of those \"dang, why did I not think of this and get filthy rich\" ideas!  The shop in Charlotte is the pilot store for TFI...I imagine it is only a matter of time before they franchise the heck out of this.\n\nThe \"do-it-yourself\" frozen yogurt concept is a great idea, on many levels.  First, being able to make your own allows you to customize to your liking...no \"ummm-ing and ahhh-ing\" over a menu board.  It saves time in the line too!  You don't like what you got?  Can't complain to management, because you did it to yourself!  The topping bar is filled with all the typical favorite candy and chocolate toppings, as well as freshy fruit and nuts, if you are inclined to the more healthy options.  I am not, and promptly turned my cup of yogurt into a trip to Willy Wonka's magical chocolate factory.\n\nWhich brings me to my next point...it is easy for someone like me to get carried away in a place like this.  What starts out as a tiny cup of ice cream can turn into an $8 hayday supermarket sweep once you hit the topping bar!  But, once again...you can't complain about the price, because pricing is by weight.  You don't like what you're paying?  Get less!\n\nIt is very dangerous to open up a place like this within walking distance of my office....maybe I should just go ahead and buy the stock in this company now.", "business_id": "3vxNIpEg5SmmInek0b7ulQ", "stars": 5, "date": "2011-06-10", "useful": 3, "type": "review", "cool": 5}, {"funny": 9, "user_id": "NMmu4oC-YRqdi0WY9pV78g", "review_id": "sZT4tJyBpW0ke9cCyxxR7A", "text": "7 dollar cover for this? hahahaha. it's really a shame.  parking, boo, decorations, boo, no cards at the bar??? seriously?? wtf., Booo.\nmost of the black guys i saw here had their snowflakes. cute. it's like the human embodiment of a pimp cane. accessory for the oh so rich. or want to look rich. whatever. majority of the clientele was in their 50's, which since i am no where close to that age. its not my thing. some of the women strolling this place were by far older then the men, and in fact this one old bag purposefully bumped into me. or she was that drunk. either way i checked for my wallet afterwards. lol.\n\nparking was horrible. the door man kinda gave me the creeps with his long leather jacket and insistence on shaking my hand..and the eagerness to shove a flyer in my hand as i was already halfway out the door. i kinda like jazz, groove and funk. but this place also served up a healthy dose of grope, gawk, and funk..not of the musical variety.\n\ni can say i will not be returning here. it just didn't really offer any appeal to me. but at least i gave it a chance. \n\nmy expectations were already low since i knew this place used to be Fat Cats, and you could score some crack rock in the parking lot faster then you could catch yourself if you tripped. i suspect the same can still be obtained, but i think they had the dealers checked to stay in their car...because i did spot a couple sitting in their cutlass in the parking lot. sketch.\n\nso to sum it up, \n\nbring cash, and enough of it\ndon't park, try to magically fly here. \nbring your grandma, she'll have a blast.\nscore some rock\n\nyelp.", "business_id": "FbmeJQ3-fP_BozmNPLfx1w", "stars": 2, "date": "2008-11-30", "useful": 7, "type": "review", "cool": 8}, {"funny": 5, "user_id": "HhVNG_1NOEyxfxudd6TSCg", "review_id": "l4S9zWunZLHC2j5_YPg3gg", "text": "Ah, what can I say? I fell in love with chez nous the minute I walked in the door (well, maybe five minutes after: I had to wait for my eyes to adjust from the blazing summer sun to the barely lit interior of this retro saloon).\n\nEverything - and I mean everything is just how I remembered: The long bar; the line of cushioned booths along the wall; the wall of rock water feature behind the bar; the only light provided by super dim wall fixtures reminiscent of the late 19th century; the vintage velour wallpaper (now sans the yellowing and 45+ years of old cigarette smoke); the 70s soundtrack- it was all here! \n\nWe determined it was slightly smaller than the OG location, but setup almost identically, save for a certainly separate entry room - which, p.s. contained an ATM (this bar is cash only) AND an old school black-and-white photo booth ( a real one, that gives you actual photo-paper print outs). \n\nThere was a live band on *Wednesday* night - and they weren't half bad. They won my heart by opening with an instrumental cover of Ms. Jackson (if you're nasty)'s That's The Way Love Goes. Wonderful. Sadly, the special was $3 shots of purple hooter and some other shot I can't recall because i instantly began musing on my other options as soon as I heard \"hooter\" (it's a weeknight, for chrissakes - what am i? 22?). I believe thurs is 2-for-1 ladies night, too bad we missed that. So, me and the G settled for our mutual love of (well) G&Ts for $4 a pop. I believe draft beers were $3.50, imports $5 and top shelf up to $8.\n\nBut we stuck to the G&T, which our barmaid was kind enough to pack a helluva punch in. just three and I was already planning my ipod song list for the ride home (not alarmingly in and of itself, but my chosen songs were a tell-tale sign of drunkenness: lionel Richie/all night long; Britney spears/Gimme More; ToTo/Africa...you get the idea). she was also kind enough to come out to our table when she noticed we were getting low to replenish our liquids.\n\nAll in all this place, including its new location, are A+++ in my book.", "business_id": "FbmeJQ3-fP_BozmNPLfx1w", "stars": 5, "date": "2008-01-10", "useful": 7, "type": "review", "cool": 8}, {"funny": 19, "user_id": "qygModUyyK_Hi_b1uxSLFA", "review_id": "qFlu_fxI_-Bdd8d3cSaptg", "text": "Dear person who decided that we would have our \"after party\" at Chez Nous,\n\nIt is with the most utmost regret that inform you that you're choice of after party venues was teh suck. And no, I did not misspell \"the\". That's how we say it these days. Get with the times, sucka.\n\nBut seriously, wtf?\n\nThrough what twisted logic did you come to the conclusion that the best way to top off a birthday party at fez laden with free appetizers, cake, and drink specials was an over-priced, overcrowded jazz bar...on a Saturday night?\n\nNow before I go any further, I shall confess to you that I was spared the $7 dollar charge. My friend and I managed to talk the doorman down to $4 for the two of us. Perhaps he was desperate to get more ladies into the establishment. Perhaps he's just a chump.\n\nIn either case, you'll be interested to know that while waiting in the parking lot for my friend's boyfriend to show up, I witnessed the doorman using your $7 to help pay for a pizza and hot sandwich from Dominos. \n\nUnlike some of the other ladies in our party, I will not complain about the ass-grabbing and creepy smiles I received. Because I didn't receive any. No, menacing glares and bathroom gossip was my lot. Feeling that my safety was in jeopardy, I was compelled to make a hasty exit in the middle of the chorus of \"Ladies Night\". \n\nI'm not going to fault you for inviting me to a totally UN-safe space (because maybe I should've done some research before I took you up on it), but if you were a vegan I wouldn't invite you to a place that I knew had no vegan-friendly options. I'm going to leave it at that.\n\nAnd I'm not going to expect you to ask all of us our age, but please be aware that there are a great number of us who were NOT products of the 70's and have little use for disco and gold chains. \n\nThe average patron had to be at least 10 years older and 20 years more behind on fashion than even you'd ever tolerate in a date. I take solace in the knowledge that you were just as unlucky as I would be (if I was single and into cougars, that is).\n\nI know that the overall cost of Chez Nous might seem a little exaggerated, considering we just had free appetizers and cake at FEZ, but nothing ruins a birthday party afterglow like inane ATM fees and greedy, smooth-talking doormen.\n\nRegardless, I want you to know that despite my displeasure with your recent choice of after-party locales, I still love you. \n\nIn fact, I'm grateful to you, in my own way. It's so hard to be funny and snarky when you're writing a 4-5 star review of a place. In a time where my ability to nitpick and rant, it's refreshing to finally find a place so terrible I am justified in my neurosis. \n\nIn the event that all of this is too wordy and convoluted to understand, I've made you a chart. \n\n=Things That Are Awesome=\n\nYelp\nMartinis\nZombie movies\nLesbians\n\n=Things That Are Not Awesome=\n\nOvercrowded bars with unreasonable cover charge\n\nSee you at the next UYE, you jive motherfucker!\n\nHugs and kisses,\nJetta\n\nP.S. Nathan, I still have your coat. Let's make arrangements to get it back to you. The longer I have it the longer I'm going to be tempted to use it the next time Misty S and I have \"roleplay night\". \n\nWhich I might do anyway if I find out all this was your idea : - )", "business_id": "FbmeJQ3-fP_BozmNPLfx1w", "stars": 1, "date": "2008-12-01", "useful": 15, "type": "review", "cool": 16}, {"funny": 7, "user_id": "YORJi2JtQg5Mo4nmKOXzag", "review_id": "_QQK2jIZsqmjU4BV5GpcaQ", "text": "I would contend to you, dearest Yelper, that I date attractive women. Or at least they're attractive to me. That's the important part, right? \n\nBut that doesn't mean that when I go out with them I always want to be able to see them... or worse yet have them see what I'm doing... And who knows what I'm doing when I'm there because I can't see the hand in front of my face. LOVE that... \n\nThe music always gets me grooving in my chair and I'm going to say something politically incorrect. I always feel cooler when I'm hanging out with African Americans. They just give off a cooler than cool vibe. I keep inviting my Afro-American roommate out to whatever and he's always like \"Naahh Dude, you're too white.\" I get it. But I'll break him down eventually. Little does he know I'm Mongolian. \n\nSo anyway, it's a little difficult to order a drink and always crowded but overall I love it. Bring your stuck up yuppie friends. Smack their skinny asses with the iron hand of culture. They'll thank you tomorrow.", "business_id": "FbmeJQ3-fP_BozmNPLfx1w", "stars": 5, "date": "2008-06-18", "useful": 4, "type": "review", "cool": 4}, {"funny": 6, "user_id": "kCVPl2RumlSgSDx9PMfXDA", "review_id": "mcm4lCXiqxMB7y6ltQOzPA", "text": "I think Arik and Eric summed it up pretty well. WOW I was under the impression I never had to pay cover......anywhere.........EVER!! I almost had 30 years of this luck I guess because that streak was broken last night and it was not worth it IMO. I should have stayed at FEZ and followed Thomas & Rickie home. *sigh* Really!?!?! Who's idea was this anyway!?!?! I got poked and prodded like a cow here which I usually dont mind so much but there was definitely attitude here that I dont really care to experience again. I was watching the bartender \"Her name was Naomi\" let's just say I prob wouldnt order anything but beer here and leave it at that.", "business_id": "FbmeJQ3-fP_BozmNPLfx1w", "stars": 2, "date": "2008-11-30", "useful": 7, "type": "review", "cool": 8}, {"funny": 17, "user_id": "2qV_3yPX9igY9UGLCQCDiQ", "review_id": "LKBGvR4l-dLEjC5ZT4IJEw", "text": "Plenty of Cougars and Black dudes, it's a porno waiting to happen. \n\nThe $7 cover was ridiculous and I wasn't going to go in...that is until the doorman gave my friend and I (a lady too) a deal. (NO, I didn't have to do \"the dirty\" in the parking lot or put anything in my mouth! Believe me this place isn't worth that.) \n\nI went up to the bar to get a Stella - and got my ass grabbed three times. By whom? I don't know; it was too packed to tell. (Obviously people like this place, though I'm not sure why...)\n\nI was lucky to get a parking space right away so that was a plus, but I don't plan on coming back, so the next guy can have it.", "business_id": "FbmeJQ3-fP_BozmNPLfx1w", "stars": 2, "date": "2008-11-30", "useful": 11, "type": "review", "cool": 12}, {"funny": 11, "user_id": "AKXqbuifvfvNEpr3Qs51hQ", "review_id": "a0epNtWYUvGzo5xn0Yy3ww", "text": "Chez Nous, I want to write you a love song...\n\n...a love song which describes how I had completely underestimated how much I missed you until I set foot inside your premises after 6 long months apart. Months that felt like years. But the moment I set foot in that door I immediately felt like I was home. My shoulders relaxed. My breathing eased up. I felt like my soul just got a massage. \n\n....a love song which describes my complete amazement upon walking inside on how much of the old you is still there with the new you. Wallpaper? Check. Lounge seats? Check. Wall fixtures? Lamps? Disco ball? Dancefloor? Low lights (and I mean LOW lights)? Cheap tinsel lining the ceiling? Check x 6. So now the bar is on the left instead of the right, but I don't mind. You're obviously still you, and that's all that matters.\n\n...a love song about the fact that the crowd inside tonight was just like the crowd inside the old you every night. Black, white, brown, yellow, green. It didn't matter then what color you were, and it sure as hell doesn't matter now. Everyone is chill. Everyone is relaxed. Everyone is cool. No airs. No pretense. No scene. Even the huge guy wearing the white full-length fur coat with matching white fur hat and white patent leather shoes and bling on every finger. Coolest, chillest guy in the room - just enjoying himself and having a great time and friendly to everyone. \n\n...a love song which exemplifies the glories of the drinks and the service. Drinks? Still dirt cheap. Service? Still completely & genuinely friendly. Never once makes you feel like for some reason you're not cool enough to belong there.\n\n...a love song which shows my great appreciation for the music. The funk and R&B is back, people. \"Let's Stay Together\", your perennial classic, followed by \"You Dropped A Bomb On Me\", followed by \"Word Up\", followed by \"Don't Stop Till You Get Enough,\" followed by....\"Jailhouse Rock?!?\" Yes, it did happen. And tonight, you did the impossible. You made me get up. And then you made me get down. Down on the dancefloor. That's right. Me doing my own brand of jive. For the first time since I've been in Arizona. 2 years, and it came down to being in the new you to compel me to bust out some moves. Now I wouldn't say I have mad skillz with the way I move. Might be reminiscent of the African Anteater Ritual. But who cares? You never did.\n\n...and last but not least...\n\n...a love song about how you actually came back to me. And to everyone else who loved you. How you simply didn't just throw your hands up in the air and call it quits. How you persisted and moved forward. How volunteers toiled day and night moving as much from your old location to the new one to make everyone feel comfortable from the moment they walked in. How you have truly pulled a Phoenix and have risen from the ashes. How I'll admit that driving by the empty lot on 7th Ave and Indian School was a depressing experience, but no more. \n\nBecause you're back.\n\nBecause you're one of my favorite spots. Anywhere.\n\nBecause I hope you never have to go away again. \n\nBecause whatever your detractors say, you truly are a Phoenix legend.\n\nThat, Chez Nous, would be the love song I would write for you.", "business_id": "FbmeJQ3-fP_BozmNPLfx1w", "stars": 5, "date": "2007-12-23", "useful": 9, "type": "review", "cool": 14}, {"funny": 12, "user_id": "K0sapHOlhlGNjx3GBeSf5A", "review_id": "VYgyYyLT_V9YPW2rWEw9PA", "text": "Let me preface this review by letting all you fine Yelpers know that I am a Char's man.\n\nChez Nous isn't bad. It is a litle like an ex girlfriend who you hook up with between relationships...it's ok, fun even. If it's around the corner why not...but let's face it I am in love with Char's so I don't think we can do this anymore Chez Nous..It doesn't feel right. It's not you it's me really... well it is a little bit you.\n\nThe drinks came in plastic cups...classy. The crowd was a bit less friendly than my love (which is again in case you missed it: Char's).\n\nThe band was good but the layout puts you pretty far from  the action unless you are on the dance floor. I forgot to mention Char;s in that sentence. \n\nSo anyhow if you need a rebound club check it out, but you can't make a whore a housewife so bet on the queen of hearts and go to Char's if you have a choice.", "business_id": "FbmeJQ3-fP_BozmNPLfx1w", "stars": 3, "date": "2008-12-02", "useful": 14, "type": "review", "cool": 12}, {"funny": 15, "user_id": "iL_CR-WQnveqrff9LecqAQ", "review_id": "JavEy_WzR9X9a_uutIXcBw", "text": "I was very inebriated when I arrived here and I had a fantastic time, which doesn't say much for Chez Nous, because I would have had a great time in grocery store at that point.\n\nI almost never carry cash, and I remember being annoyed that they wanted a cover. There are certain things that I hate spending money on: gas, toilet paper, cat litter, and cover charges. Can't I pay the cover if I go in, hang for a while, & decide if it's worth the money? I think my friend Julie P. might have paid my cover just to shut me up. Not sure, but thanks if you did. You are awesome Julie. \n\nThen I remember the bar only took cash, my rad friend Ayesha got me a drink. Ayesha is also awesome & carries cash.\n\nI busted out with my scary, cool dance moves most of the time I was there & I have fuzzy memories of a lot of the rest.\n\nI do remember having a hard time getting my drunk ass some water from the bartender. I got the vague impression she doesn't like people, or just drunk chicks who want water. Sue me, I was thirsty.  \n\nOverall, I probably wouldn't come here sober or on purpose, but you never know what may happen....", "business_id": "FbmeJQ3-fP_BozmNPLfx1w", "stars": 2, "date": "2008-12-07", "useful": 13, "type": "review", "cool": 14}, {"funny": 3, "user_id": "vs1rSyXvWYOwV8WJQWmxHA", "review_id": "rnu_xJLyXyW5zprMETz1vg", "text": "I love Chez Nous for the dancing, the live music is always great, but this past Friday I was really disappointed.  The cover charge has been raised to $7, the drinks were weak, and I got charged $9 for a Three Olives and Coke.  Combine that with being cash only so getting hit for $3 at the ATM inside the bar, and after one poor drink I was already at $20.  Maybe it's because I've gone back to being a broke college student, but I found the whole experience disappointing.  It seems like a few articles in the AZ Republic recently and the prices are flying through the roof.  So for now, I think I'm going to take a break from our relationship... sorry Chez Nous", "business_id": "FbmeJQ3-fP_BozmNPLfx1w", "stars": 2, "date": "2008-11-13", "useful": 5, "type": "review", "cool": 4}, {"funny": 4, "user_id": "tG5s3vgVpHun0unatapjMg", "review_id": "eL38SOsiduduPDxyUBw_QQ", "text": "My fiance and I went on here and it looked like Liberace threw up in this place... I love unusual decorating but we are not in Las VEgas --though someone forgot to tell these people this. I found their stuff waaaayyy overpriced. Old fake antique couches 1000 buck and over made me wonder if they ever sell anything? \n     And this place had a \"ruthless\" vibe to me not friendly you are ignored no one says hello to you... I thought it was insane how much she was charging for gross looking shoes and USED clothing... My guy tried on a 1980'd leather jacket and wow so out of style ( vent in your back shoulders anyone?) And it was over 100 buckS!\nMy Man and I felt like we both needed a shower after this place for sure!", "business_id": "3QxRg8v2Uej_--8DyO3maQ", "stars": 1, "date": "2012-01-21", "useful": 7, "type": "review", "cool": 0}, {"funny": 11, "user_id": "JK33W3CV9nzktfuIunB6Ag", "review_id": "5pR2bkrm9Ezz5uyXEcUxaQ", "text": "I had the day off today.\n\nSo I went exploring.\n\nI made the mistake of going into the pink poodle. Upon entering, a woman (wearing garish makeup that which would resemble an employee of Ringling Brothers) tells me that I CAN'T CHEW GUM INSIDE THE STORE. I look left, I look right, and I look left again (ya know, in case I missed the horror the first time) and not-so-kindly tell the lady, \"Thanks, but I'm leaving here anyway\". \n\nThis store is what would happen if a Barbie doll had a miscarriage with a bag of sequins. \n\nNo. Just...no.", "business_id": "3QxRg8v2Uej_--8DyO3maQ", "stars": 1, "date": "2013-02-16", "useful": 7, "type": "review", "cool": 0}, {"funny": 3, "user_id": "PLOYtrCMUFPHQe2IbYAd5g", "review_id": "3G-VC-dz2eVQm_VlxBChuw", "text": "Have you ever watched the Golden Girls and thought....\"damn, Dorothy Zbornak is lookin' good - I wonder where I can score one of those nifty pantsuits?\" The answer is The Pink Poodle.\n\nPlus:\n+Advertises as \"designer consignment\" and actually HAS designer items. \n+Super, super organized by style, size, etc. I appreciate not having to waste time digging through racks of jumbly stuff.\n+Shoe department was not gross at all and again, was well organized\n+Charming (and properly standoffish) standard poodle sleeping on one of the sofas\n\nEhhh:\n~ Big selection of accessories - mostly of the sparkly, cheap variety\n~ Staff will likely ignore you completely, which is ok if you're just browsing\n~ Prices vary - $25 for like new Mephistos is a steal. $350 for a used Kate Spade bag is not.\n\nMinus:\n- Not much for the fellas. Mostly polo shirts and crappy dad jeans.\n- A disturbing amount of Chico's stuff. Like racks and racks of it.\n- Women's fashions are definitely geared to the \"50+ and drive a Lexus SUV\" set. \n- Lots of scoldy signs plastered up - no cell phone use, no gum, etc. Really?", "business_id": "3QxRg8v2Uej_--8DyO3maQ", "stars": 3, "date": "2013-07-06", "useful": 4, "type": "review", "cool": 3}, {"funny": 3, "user_id": "lIhBq2C-6PWQGS07IUUXKQ", "review_id": "PoN8F_7pk8YA5EkI4qjDOQ", "text": "Bus Driver, you are so nice! and you tried to be funny!\nEven though the shuttle was late, I was happy about the trip.\nWe took a small van to somewhere and then switched to a double deck bus! This is the first time for me to ride on a double deck! And they provide breakfast too :) (and lunch!)\nWe basically slept, ate, walked, slept more, walked....repeatedly", "business_id": "505A9f5XsHciyxrCbQTaiw", "stars": 5, "date": "2011-04-06", "useful": 2, "type": "review", "cool": 2}, {"funny": 4, "user_id": "UrOofvcBl0gAbKPAEaj83A", "review_id": "gLj0CuB1okyajMD9DK7UKA", "text": "I haven't checked out yet but I felt I needed to write a review when this old man smell is still freshly permeated in my room. Yeah.. As soon as you walked into my room, there's this scent that just reminded you of an old man's cologne. It didn't smell sexy. It didn't smell manly. Hell, my grandpa, bless his soul, smelled better than that. However, yeah.. Very oaky musky euwy smell. \n\nI have to say though...it was my first time smelling it. I have stayed here before and I don't recall to ever smell it in the past. Maybe the guest before me used his cologne for room freshener. I don't know.\n\nOtherwise, this hotel is okay. It's newer Fairfield Inns so it's still pretty nice. It is next to a Courtyard but for some reasons, Madison hotel prices can get out of whacked expensive. Like tonight, there's about $40 bucks difference in price between the two hotels. I usually stay at Fairfield when Courtyard is too pricy or full. It's really not much difference as far as comfort when the Fairfield is not old and dumpy.\n\nThis location has a gym as well. Some Fairfield will send you to a nearby local gym since they don't have it in the facility.\n\nFront desk staff, once I was there it was fine. I tried to cancel one of the rooms I booked for my coworker, and that was an ordeal. The lady that answered the phone was short with me and she hung up on me while putting me on hold. I called back, and she said sorry but she was shorthanded and she had to call me back later. She asked me for my number and she kept repeating the wrong number like she couldn't hear what I said. She was also impatient about it so I told her never mind and I would call the 800 number. I did and got it taken care of. It was still pretty crappy though.\n\nHowever, in overall, it is not a bad hotel. It's decent okay hotel and it is easy to get to, right off the highway. Hopefully my next stay the room will smell more like lavender than old man scent. That would be preferable.", "business_id": "3kQarjSJYYo9nGAkFjbWYg", "stars": 3, "date": "2015-01-23", "useful": 3, "type": "review", "cool": 2}, {"funny": 3, "user_id": "dLWDy4yzVzMQuhjoEcRO0g", "review_id": "xVU5OYmFk1D16LdIc8fjRA", "text": "This is the place that we always seem to end up at when people come in to town for business. It's one of those places that's relatively convenient, has decent parking, and can handle larger crowds since they don't ever seem to be even remotely busy.\n\nI will agree that when I have been there with small, personal groups, service has been unbearably slow. They would definitely earn one more star if there were even a whiff of concern... but when the group is larger, we have always received exemplary service - dare I say size does matter?\n\nThe food is actually above standard, for its kind. I love the Santa Fe Stuffed Chicken Breast (it has lots of goat cheese inside and is covered in their red pepper cream sauce - which honestly I think would be good spread over an old leather sneaker). I could eat the Adovo Chicken Pasta twice a week and never get tired of it (same reference to red pepper cream sauce). My ex swore that the Meatloaf was the best (but really, what can't be improved by a generous portion of bacon?!!). And my all time favorite has to be Chile Rubbed Sirloin - it's flavorful, without being overpowering, always cooked exactly as requested, and generally requires the threat of forking when others realize that \"it looks better than mine.\"\n\nIf you like Margaritas. You should be happy with what Sam's has to offer. The Orange Beso makes my toes tingle. Fortunately, they limit those to two servings - otherwise I might find myself behaving badly. They have several \"house margaritas\" all of which I've enjoyed (really it's not my fault, I work with a lot of social alcoholics... it's the only way to deal with the stress).\n\nMy final offering is that this particular location (I haven't ever tried at the others, so they might be accommodating as well), is great for private functions. They will basically close down whatever portion of the restaurant you might need, either feed you buffet style or from the menu, work with you on drink coupons, let you hang corporate flair, etc.  If you are in a pinch for a business gathering in a relaxed environment give it a try.", "business_id": "0HwrX6P6lh92F0f-A_QzjA", "stars": 3, "date": "2008-09-13", "useful": 4, "type": "review", "cool": 2}, {"funny": 6, "user_id": "SrF972IxsELYQ3eaWB5X4A", "review_id": "QCFPAq0-D9ZGX0GyS9862w", "text": "Saturday is Happy Hour day at Sam's Café. \nHappy because we hadn't been there in a while and happy because Sam's has improved since the last time we were there:)\nI say \"judge slowly\" and \"give people a second chance\" and \"a stitch in time, saves nine\" and all kinds of other inappropriate adages...but my point is that sometimes a second chance is in order.\nSam's Café had been in the rotation for a few years and then we had a couple of poor experiences there, and just didn't go back...you know how it is...there's a lot of competition for the dining dollar (it used to be \"dollars\" but the recession/depression has hit everyone!).\nBut, this isn't about then...it's about now, so let's get up to date, shall we?\nThe Beautiful Carin and I headed for the club last Saturday to sweat off the weeks caloric build up and sweat it off we did! (you know, I think I sweat so much because I come from ice age survivor stock and here I am trying to live in the desert!).\nAnyway, after we finished our extremely grueling, yet fulfilling programs of physical exercise, got ourselves all cleaned up, (lookin' good and smellin' sweet) we were talking between ourselves (as married people often do) and trying to figure how to reward ourselves for the excellent workouts we had just finished.\nHow about a nice big lunch?\nSam's Café has Happy Hours on Saturday's and Sunday's that run from 11:00 am to 5:00 pm. \nWell, that's just inspired!\nWe tottered in and sat at the bar (I think that's going to be a defining happy hour \"move\" for us), and the barman greeted us with a warmth and enthusiasm normally reserved for long lost play cousins...a good start:)\nWe looked at the happy hour menu and they have some nice selections for really good prices.\nWe ordered roast pork sliders with a chipotle barbecue sauce, Carin's  \"go-to\" selection...grilled chicken nacho's and Sedona Spring Rolls (also served with the chipotle barbecue sauce and pico de gallo).\nWhile were waiting for the food to arrive, Sam's minions brought us more food...chips and salsa. \nNow, I don't want anyone to think Sam's is mexcian food...it's not. The whole place is more \"southwest inspired\" as opposed to \"southwest\", or \"Mexican\" or \"authentic\". \nThey have décor that looks sort of Fredrick Remington meets Javier Sordo Madaleno...nice, southwest-ish/modern. The chairs in the dining room are, frankly, less than comfortable but they fit the décor, so, OK. Just don't complain to me when they make your butt sore after 20 minutes!\nBack to the chips and salsa...I like the flour tortilla chips that Sam's serves, as well as the blue corn and sweet potato chips and the salsa is decent as well...very tomatoey, but spicy and flavorful, but it's not Mexican...not for everybody, but we were happy:)\nThe actual food portion of our lunch came before we became completely engorged with the chips portion. Everything was very tasty. \nThe pork roast sliders were truly delightful...moist, seasoned perfectly on soft warm rolls:) (BTW, I'm reasonably certain that you can't get swine flu from eating pork roast, but I will say that the roast pork sliders \"flew\" off the plate:) . The Sedona Spring Rolls have plenty of spice and heat, and are also very nice.\nAll in all, a very solid Happy Hour offering for $18 and change (before tip).\nGo, sit at the bar (always better service and your butt will thank me), and enjoy Sam's Happy Hour!", "business_id": "0HwrX6P6lh92F0f-A_QzjA", "stars": 3, "date": "2009-04-30", "useful": 10, "type": "review", "cool": 8}, {"funny": 3, "user_id": "MRx_IYHfDQCJvR3MjgKYtA", "review_id": "s7gbar7dkCGLBf5ecsHELg", "text": "Don't go here.  I ordered the shrimp while my dinner companion ordered the steak.  Steak was okay.  Shrimp was so awful.  The bean puree, tomatoes and mushrooms accompanying the shrimp all had a terrible burnt taste.  If i wasn't starving and short on time pre concert I would have left mid dinner.  \n\nService was also terrible.  We got our appetizers before our drinks.  And if we needed anything (salt, another glass of wine) we waited a good 10 minutes before our waitress even came over.\n\nI was excited initially that they could seat us on a Friday pre concert without reservations but now I know why.", "business_id": "AVLKTVoB43D3sVBtSxsz_Q", "stars": 1, "date": "2014-03-01", "useful": 1, "type": "review", "cool": 1}, {"funny": 3, "user_id": "ybhNJWK_Cj-asa4BwMJ0Yw", "review_id": "Yi7X9QyJMJnAzZ88BBh5QQ", "text": "The food is really very good. Always fresh and interesting. My favorite thing is the gazpacho. \n\nToday, I went for lunch with a largish group of people. Even though the dining area isn't that big, we were all accommodated nicely. They even split up the tab for us! (there were 9 of us) I love that they have really tasty vegan fare which in this city can be hard to come by. \n\nHere are my issues. Although the owners/servers are nice, the service can be really really bad. I'm not a pessimist, but why would a waiter only fill up a glass of water halfway? Also to describe the non-vegan special today, our waitress said \"oh, you know, it's like fish and rice and tomato sauce\" appetizing....  I prefer my servers to have social skills. \n\nBUT I still recommend going here. The food is good, and it is a locally owned establishment.  I can't wait to come back and visit Phoenix when the Grand Ave area really explodes.", "business_id": "-Y9woV5m-KaTzu9VpirYyg", "stars": 3, "date": "2009-07-10", "useful": 5, "type": "review", "cool": 4}, {"funny": 3, "user_id": "5uiCy0vSIknuDEHc7yHRkw", "review_id": "rQkD-N8ie8z2y28up-HrlQ", "text": "Oh Sapna, like so many others, we want to like you, but you make it so difficult with your awkward and strange customer service + average food.\n\nNot completely important but worthy of noting:  I despise the logo.  It's so scrapbooky for a place that is supposed to be hip.  The actual restaurant space is great- just don't look out the windows to avoid catching sight of the scrapbooky logo.\n\nOn every occasion that I have been here, the food has sounded amazing but always ended up being slightly above average.  I hate getting psyched for a meal that I think I will love and then being disappointed..\n\nThe service is annoying.  It's like there isn't a care in the world and your time will not be valued.  On my last visit, it took us over two hours to get out of there and we were eating brunch AND only one of three tables in the place.\n\nHonestly, I totally get why this place is near empty every time when I visit.  Sorry, Sapna, I'd say skip it.", "business_id": "-Y9woV5m-KaTzu9VpirYyg", "stars": 2, "date": "2010-02-09", "useful": 9, "type": "review", "cool": 5}, {"funny": 3, "user_id": "7yi6Mrk1sCU2REZegMf9zw", "review_id": "12qrh_ofOHndIFAF0puWSw", "text": "I want to like this place a lot. Grand desperately needs some strong eateries. Sapna seems like it should be excellent: cheap, healthy food in a unique triangle-shaped setting. So what went wrong?\n\nI've given this place several tries. Every time the service is terrible. They're understaffed (even when we were the only table there... one person working at a restaurant isn't possible), and if there are more than three employees there at once, they always get confused. I'm not sure what the reason is...the place only has like eight tables. \n\nSecond, the atmosphere is depressing. Sapna has a really different setting in the tip of the Bragg's Pie building. If anything, the atmosphere should be the automatic winner. Instead, it's a plain white room with plain white plastic tables. Last time I was in there, the one painting hanging on the wall fell off, hitting a patron in the head. Then it took several minutes for the server to get him some ice. He had a nice ole welt. \n\nI like the quesadillas here a lot. The food is fresh... just not always tasty. The ratatouille is strong. I have yet to find a really great salad on the menu.", "business_id": "-Y9woV5m-KaTzu9VpirYyg", "stars": 2, "date": "2009-11-24", "useful": 4, "type": "review", "cool": 2}, {"funny": 4, "user_id": "qewG3X2O4X6JKskxyyqFwQ", "review_id": "9atTYyG8qv7hqs-Yv8fJAw", "text": "Yes, this is partially just an ode to Reed Krakoff, a tidbit to say that I find his lines, his leathers, his precision, his cut all too appealing. It is also to say that the staff at this store are helpful without  being pushy, and despite my numerous visits without a purchase, they are always smiling when I return. They are always eager to demonstrate the features of their bags (Yes, bags have features!) and are knowledgeable about the line. The store itself is also appealing with just the right light and perfect amount of merchandise. It is not overwhelming or stuffy. A few points of trivia learned recently: It is acceptable to simply say RK so you don't have to worry about butchering his last name (phew), and the boxer bag is inspired by the tape on a boxer's fist. Man, now I really want one. To put it simply, if I were Holly, this would be my Tiffany's.", "business_id": "4znf6WVzpn-0AT_Jp9f8HQ", "stars": 5, "date": "2011-11-19", "useful": 7, "type": "review", "cool": 8}, {"funny": 6, "user_id": "PUfrbn2Ij-iyyOnM_EzQtg", "review_id": "3VXmOWpNm18VSuXww4Vu0Q", "text": "Ever since I started working downtown, I vowed to continue my personal tradition of rewarding myself with something yummy and sinful...kinda like a pat on the back for a job well done for the week. In my previous life as a PR bitch in the private sector, I rewarded myself with libations--vodka/tonics with two limes for extra Vitamin C; vodka Collins with three maraschino cherries instead of one; cranberry and vodka because I heard it cleanses out your urinary tract; a dirty martini for those super grueling weeks.\n\nAlas, when I started to work in the public sector, still in PR, I knew I couldn't pull that shit anymore. I had to re-vamp my rewards structure and take out the \"sinful\" from \"yummy and sinful.\" That's when I discovered fro-yo...that's frozen yogurt to you all.\n\nMy co-worker took me out for coffee one day and quickly mentioned that there is a locally owned frozen yogurt shop on Washington and First Streets. She said they give hefty portions, so I thought to myself that this might just be a good replacement for my vodka concoctions.\n\nThe place is called A Touch of Yogurt, and their fro-yo is yummy to the tummy. They are pretty generous with their servings, and the toppings you choose to include in your fro-yo. And then when I did some diggin' about fro-yos, I found out fro-yo can: 1. Help to overcome lactose intolerance; 2. aid digestion of milk protein: 3. help prevent and combat digestive tract infections. Okay...fro-yo had me at \"overcome lactose intolerance...\" that's all I'm going to say about that! They change their menu of flavors...you know, to mix it up a little...keeps you guessing. But no matter what flavors they have available, I am sure that you will find one so satisfying. \n\nSo Fridays, I've officially declared Yvette's Fro-Yo Fridays. I order my \"small,\" sit on one of the outdoor tables, and stare at politicians, lawyers, bums, construction workers, delivery people, while enjoying a mouth-watering serving of fro-yo. \n\nHey feel free to join me every Friday for FRO-YO Fridays around 12:30-ish. Oh but not this Friday I'm in San Francisco. So just for this week...FRO-YO THURSDAY!\n\nAnyway...I give it 4 stars...because, let's face it...it might be yummy, but it still ain't ice cream!", "business_id": "6BjIGgxIkCks3NTpkj3fAw", "stars": 4, "date": "2007-09-25", "useful": 4, "type": "review", "cool": 9}, {"funny": 6, "user_id": "rCWrxuRC8_pfagpchtHp6A", "review_id": "kbYvTpMB6fFbd9Vmb_ZLvg", "text": "The place is called The Millvale Diner now. The ownership is not the same, however. Curiously enough, a webpage for the restaurant has a quote from my Yelp review. \n\nhttp://www.millvalepa.com/businesses/millvale-diner", "business_id": "-N94ldMGlQw_SHdfm2pi_A", "stars": 4, "date": "2013-04-24", "useful": 15, "type": "review", "cool": 12}, {"funny": 3, "user_id": "Wu0yySWcHQ5tZ_59HNiamg", "review_id": "rCaD6a-IJISWdCdRob5c3w", "text": "Dear Chris K,\n\nI have re-visited Dae Bak when you least expected.\nLet's see if you recall December 23, 2012 1:00 PM.\nRemember us near the corner, 3 Adults + 1 Baby?\n\nI remember clearly the accomodating service we had.\nRequests we had to satisfy my Friends and their Baby.\nAll we required were met, so I agree service improved.\n\nI was looking up at the LCD on the wall, it was Korean.\nI came up to pay by VISA. I collected Aeroplan Points.\nI saw the \"LIKE\" us on Facebook for 10% off discount!\n\nEveryone enjoyed the Meal and Full for $50, Tips included.\nBehind the counter, you and a Woman spoke to me briefly.\nLet's just say I'll be BAK some DAE, when you least expect it.\n\nCheers,\nWaYnE c", "business_id": "2xorCb0z1Vok7w_vWPtzPA", "stars": 3, "date": "2013-04-16", "useful": 1, "type": "review", "cool": 1}, {"funny": 4, "user_id": "hWDybu_KvYLSdEFzGrniTw", "review_id": "07A2Juc1eJ2eAndmXHM3ow", "text": "Popped in quickly to literally grab milk and bread. Easy, pleasy. Everything was where it's supposed to be, it was well stocked, clean and easy to purchase. I would say \"I wish all HT's were like this,\" but they are.", "business_id": "01j738N-D0eXnZ_w8sFqIg", "stars": 4, "date": "2014-10-15", "useful": 4, "type": "review", "cool": 4}, {"funny": 4, "user_id": "ipDzjJyxrCQNNA2n434mqQ", "review_id": "L8VqoBC660NFg5HuSgSU5A", "text": "Having never been to a Harris Teeter before moving to NC, I was hoping to a fine alternative to Publix. Alas, it is a clone with a more down homey name. Over priced and full of itself.\nThe only saving grace is the cashier Mary. The few times I have shopped here I always seem to get her. Let me tell you brother it was worth it. In between incoherent mumbling conversations with herself, and the inability to scan items with any sort of competence, she is a dream. She is the sole reason that I will return to this location...well that and maybe some milk if I run out, or bread....possibly beer, but there is always Total wine for that........sigh.", "business_id": "01j738N-D0eXnZ_w8sFqIg", "stars": 2, "date": "2014-07-15", "useful": 1, "type": "review", "cool": 1}, {"funny": 4, "user_id": "Uwu72w77MPox942_GnCS7g", "review_id": "Vx7eWHxbJ9FL-DNuEXHEEg", "text": "(note: I posted this review prior to realizing that as of earlier this week, they've moved down the street with their sister restaurant, Le Canard Mort. Hopefully the intimate atmosphere of the old place remains!)\n\nI almost hate to write a review of this place, because I don't want anyone to know about it and thus be able to keep this wonderfully intimate French restaurant all to myself and my husband. Every time we come here, it's not very crowded and we're free to make goo-goo eyes at each other over dinner without making anyone want to toss their moules frites. But, this place is too sweet not to share, so consider yourselves warned if you spot us in a corner, canoodling over crevettes. ;) \n\nStandouts here include the escargot poutine (yes, you read that right!) and the coq au vin. Both items are rich, hearty, and perfect stick-to-your-ribs comfort food. I also really like the duck breast with cassoulet, which is another hearty choice. The filet and frites are also good, but nothing special. \n\nThe wine list is decent; on the small side, but well-curated. The server, a lovely Montreal woman, sets the atmosphere with her lovely French accent and welcoming (if slightly frazzled) attitude. Food comes out reasonably quickly, and I've already blathered on about the romantic, intimate atmosphere. Highly recommended.", "business_id": "205IU_t4t0kzCfHN06fyKg", "stars": 4, "date": "2012-02-26", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "aTVOFTxVdfdIhdPxcEt1Vg", "review_id": "TTEwunmdteUg0EwoiwE2Lg", "text": "When one thinks of Vegas, one thinks of awesome desert heat.  Yeeeeeah...not when it's the end of October and definitely not if you are coming in from Taiwan after 2 weeks of nice tropical weather.\n\nNo - of course the week that we would be here - would be the week that it was FREEZING.\n\nSo we headed over to the TJ Maxx to look for cheap sweaters so we wouldn't die of hypothermia in our tank tops and shorts.\n\nOK.  It was the end of October, beginning of November...and there was only half a rack of sweaters.  I am not even kidding.  And they were - of course - ugly as sin.  *Sigh*.\n\nStill...it was warm enough to keep me alive so I could write this review...and the sales guy who rang us up was pretty hilarious (he was telling us about his highly inappropriate Halloween costume), so it could have been worse.", "business_id": "6YV0YEHJKjVrwTCiyCYJhQ", "stars": 3, "date": "2011-11-28", "useful": 4, "type": "review", "cool": 2}, {"funny": 6, "user_id": "P1JqTh13dpAZ16U1ZPw_IA", "review_id": "pMDCdh39U75rCBG_oxy98A", "text": "I am a Fashionista!\n\nSeriously, I like boutiques and finding really cute unusual pieces of clothing,  but lets be real,  there aren't many boutiques around theses days. Plan deaux; TJ Maxx!\n\nThis TJ is located next to many other shopping options, seems a little touristy, but this could be the reason why this store always has good finds and never disappoints.  I find the cutest outfits and \nshoes and even stuff for our house.\nI also love the packaged flavored coffees. I bought a delicious Madagascar Vanilla coffee for under 6.00 a bag.\n\nThe childrens clothing has cute outfits in designer labels but price pointed at Target prices. \n\nI love this TJ.", "business_id": "6YV0YEHJKjVrwTCiyCYJhQ", "stars": 5, "date": "2015-09-12", "useful": 7, "type": "review", "cool": 8}, {"funny": 3, "user_id": "nmdkHL2JKFx55T3nq5VziA", "review_id": "ltp_dUz9kxM27C_W1kF8Ig", "text": "If there is a TJ Maxx in the area and i have time to kill, it's always a good place to see if you can find a great deal.\nThis is an older location, but well stocked.\nNice service, good selection in both clothing and decor items, always worth a look.", "business_id": "6YV0YEHJKjVrwTCiyCYJhQ", "stars": 4, "date": "2015-08-04", "useful": 2, "type": "review", "cool": 3}, {"funny": 3, "user_id": "oA26X4DbBC91OHDvEqBv-A", "review_id": "tv0tVMoqG05w3EFeZcJu-Q", "text": "So I have a theory. The architects at the Westin really wanted to build an obstacle course as part of the hotel. And so they did. But then they couldn't figure out how to market it. So they decided to turn that obstacle course into a restaurant instead, and they called it the Penn City Grill.\n\nNow, the food isn't too bad, and the sushi is decent. But the service is so slow and so inefficient at the Penn City Grill, that it's almost comical to watch the waitstaff run back and forth, without any rhyme or reason, because anything you ask for -- menu, silverware, napkins, check -- requires at minimum two laps around the obstacle course.\n\nSo eventually, I stopped expecting the waitstaff to come around, and just enjoyed the show. Never mind that the restaurant is at most 25% full. Stuff just takes that long.\n\nBravo, Penn City Grill! If that's the goal you were aiming for, you certainly succeeded.", "business_id": "EHGKrUgGpxYpfs4N3paJ1w", "stars": 2, "date": "2015-02-23", "useful": 4, "type": "review", "cool": 3}, {"funny": 3, "user_id": "D8KDGxSPMoOYU50BSEuJeQ", "review_id": "x7TrdRg-ozheHntAom8O7g", "text": "While I was being yelled at by the white haired bloke w/ wiry mutton chops about the dangers of walking through the parking lot and how we had to walk hand-in-hand with a partner and also the rules of the place due to federal food regulations, I was like Geez, please!\n\nMy joke to our group (we had arranged for this tour midweek): For someone who works in a sugar factory, he sure isn't sweet.\n\nhar har!\n\nMutton Chops didn't bother to say hello. Our group, 7 parents and 11 home schooled kids ages 5 to 15 attempted a greeting when he started roaring the rules.\n\nooooKay!\n\nBut wait, I'm a fan? \n\nYeah, a fan.\n\nOnce past the formalities, the barked orders and the chastising of an elderly woman (not part of my immediate group) for eating nuts (against aforementioned food regulations!), a great time was had. Mutton Chops turned out to be a great guide, passionate about his subject and a good story teller.\n\nDid you know that....\n\nYou can watch the sugar boat barges unload raw sugar using giant cranes?\nRedpath Senior had 17 children but 5 of them died?\nYou can wear a corset and not pass out?\nThe factory operates 7 days a week, 24 hours a day?\nIt takes 10 hours to take raw sugar and refine it into Redpath sugar?\nThe original Redpath family mansion in Montreal (now gone) included central heat and three indoor washrooms?\nBrown sugar is just white sugar with the molasses added back in?\n\nMy youngest boy, 7, said, Can you believe it-- they take the molasses out and then they *add it back in*?!!\n\nRandom bonus: the museum includes a display of \"sugar art\": figures from the Harry Potter series fashioned out of sugar. \n\nStupefy!", "business_id": "F9d_0hkJodk_mjcVmfuKrg", "stars": 4, "date": "2011-10-19", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "qRYwodYPMMkl7QKnpmc39Q", "review_id": "xjW4JNl5nRN4JNXzZgwZdg", "text": "I am unsure how to rate this place... \n\nService: great! I was waited on quickly and my tech was awesome!! \nColor selection: great gels... If you are into OPI I recommend bringing your own because they had mainly gels and essie brand. \nPrice: yea no. After tip & full gel set $56 isn't going to fly. It's normally $35 at my usual place ONE block over at a salon equally as nice. I asked the tech why it was so much... He said welcome to summerlin. My usual salon is Durango/buffalo and wayyyy more affordable.\n\nOverall, I am happy with the way my nails look but they aren't 20% better so why pay like 20% + more???? I won't be heading back there.", "business_id": "9dro9HGXfJ4g6IzxDWD9UA", "stars": 3, "date": "2014-03-24", "useful": 1, "type": "review", "cool": 1}, {"funny": 4, "user_id": "25QzG8_MT4zr4JiglZI8dQ", "review_id": "IwBrUzkSZhYt2UpHHKSS6Q", "text": "Yup, it's a Target. Nothing more, nothing less. EXCEPT...this place has the shortest lines of anywhere I've shopped in Cleveland. So when you need to buy that bag of Doritos and bottle of wine you're having for dinner, you're in and out quick, quick enough to leave you time to contemplate the essential meaninglessness of life (just kidding).", "business_id": "89q_Gi9wLAAweuL-s0cM4w", "stars": 4, "date": "2009-10-15", "useful": 1, "type": "review", "cool": 0}, {"funny": 3, "user_id": "hy4uEHgITEfzxrXzyDhCRg", "review_id": "tfG2NNCDZbXk9s_Yo0j09g", "text": "Its a Target.  My lil one like to get toys there and its the closest one.  A bit unorganized and dumpy at times..but cant we all be?", "business_id": "89q_Gi9wLAAweuL-s0cM4w", "stars": 4, "date": "2015-05-05", "useful": 3, "type": "review", "cool": 2}, {"funny": 8, "user_id": "CXVMRsnbuuNKetMy_gAyBw", "review_id": "183jSBVPc-3PKJZcvYcTSQ", "text": "You can't polish a turd!  When will these ladies understand that?!  Just because you change your name from Z Girl Club to Zoan and spruce the place up a bit, doesn't change the fact that you are still tacky and totally uncool.", "business_id": "EhAydA_VuSEbbfoe-Fqg_g", "stars": 1, "date": "2012-04-04", "useful": 3, "type": "review", "cool": 1}, {"funny": 8, "user_id": "KtIh1kjkVESCqd2CCsQnhA", "review_id": "A8YiKD0AfgH9ml93wDbXlg", "text": "\"Don't listen to a word I say\n\"Hey!\n\"The screams all sound the same\n\"Hey!\"\n\n\"Though the truth may vary\n\"This ship will carry our bodies safe to shore\"\n\n------------------------------------------\n\nIn A Sentence™\nDo you seek the absolute most expensive petrol in the valley aside from the one station adjacent to Sixt Rent A Car® on Warm Springs/Gillespie? (You've come to the right place.)\n\nQuick Review™\n+   They carry Thrifty Ice Cream®.\n\n-   That Thrifty Ice Cream will cost you more than a comparable amount of same-brand ice cream with the two warm cookies at Sweet Addiction®. \n\n-   The petrol -- unleaded regular -- costs as much as the premium at other locations.\n\nEmployee of Excellence™\n+   N/A. Perhaps the guy (or gal) who drives this flammable liquid across state lines while staying awake long enough to avoid crashing into a school bus full of children. He's the real MVP.\n\n------------------------------------------\n\nQuestion:\nDo you seek the absolute most expensive petrol in the valley aside from the one station adjacent to Sixt Rental on Warm Springs/Gillespie? \n\nAnswer:\nThen you have come to the right place here at Texaco Short Line Express Market® in Centennial. \n\nQuestion:\nDo you seek to pay more than 3.50$ USD for less than one true scoop of Thrifty Ice Cream? \n\nAnswer:\nThen you have come to the right place ....\n\nObservations since my final patronage\n+ There is a station just a couple of blocks north on the West side of Durango that provides Petrol at a much lower cost. I won't name it since you know what it is: it rhythms with NARCO.\n\n+ It's like stepping through a wormhole and landing back in the Dumbya years where petrol was forcing people to trade in their Durango®s for Toyota Camry®s and to pull the AAA scam* once a month.\n(*Claim running out of gas; get roadside assistance to deliver one whopping liquid gallon of petrol to your location.)\n\n+ I wish there were a sports book in the market so I can wager on the sports games that transpired in the past. It would make up for the overcharge on the fuel and turn me into a real life Biff. (Who wouldn't want to be Biff?)\n\nFirsthand experiences explained in a step-by-step guide for the worthless HQ idiot reading this: step 1. I drive to the business. (I drove there.) Step 2: I open the door of the motor vehicle and step out and shut the door behind me after popping the fuel door. Step 3: I looked at the pump number. Step 4: I began walking towards the doors of the business. Step 5: I returned to the vehicle because I forgot the pump number and need to ensure I don't pay into the wrong pump. Step 6: Once again I walk towards the doors of the business. Step 7: The automatic doors -- like magic -- open for me as if I were Prince Harry, also a combat veteran like me.\n\nStep 8: I wait for the attendant to return from wherever he is. \nStep 9: I repeat aloud the number that I have been saying to myself repeatedly and hand him the Jackson. (They really should put a woman on that denomination.)\nStep 10: I say thank you. \nStep 11: I look at the ice cream on my way out. \nStep 12: I reach the motor vehicle, remove the pump, select the grade, unscrew the cap, engage the automatic draw after inserting the nozzle into the female part.\nStep 13: I open the door and get inside the motor vehicle before shutting the door behind me. (There must be a reason that Oregon and New Jersey, respectively, bar civilians from pumping their own fuel.)\nStep 14: I listen to KNPR, check-in on my Yelp mobile application, think about Mark Wahlberg's firefighter character in I Heart Huckabees, et. cetera.\nStep 15: I hear the click of the nozzle disengaging, open the door, step out, pull the nozzle slightly out while still leaving the tip in, shake off the nozzle vigorously, place the ....\n\nI am exhausted of the firsthand experiences. You get the point. \n\nFinal Word™\nDon't come here unless you enjoy burning money unnecessarily*. \n(*As opposed to necessarily.)\n\n------------------------------------------\n\nTourists\nNone here: it's far from the strip.\n\nKids\nNot good for 'em.\n\nDogs\nLeave them at home unless they are service-providing*.\n(*Don't you dare leave them in the car!)\n\n------------------------------------------\n\nRating: Two-stars, \"Meh. I've experienced better.\"", "business_id": "5k2rzQJ_YroCyKsnt63XFg", "stars": 2, "date": "2016-02-23", "useful": 7, "type": "review", "cool": 4}, {"funny": 3, "user_id": "V7uS5US4oTf-S9u36HJQCQ", "review_id": "b1-fnXJpFVXjRjS_9xBSeQ", "text": "I don't frequent GNC often and when I'm there I am normally trying to get in, get a smoothie an get out,  The staff behind the registers are way to into themselves and can't even break off their own conversations to acknowledge a customer. \n\nThe smoothies are great , but the customer interaction could be better.", "business_id": "AZSYZCaawGBps_tYnG8oRQ", "stars": 3, "date": "2013-05-14", "useful": 3, "type": "review", "cool": 2}, {"funny": 3, "user_id": "4wp4XI9AxKNqJima-xahlg", "review_id": "G09_FjvnLS_KvR6qz9Pd4A", "text": "Oh GNC Smoothie....you totally lost your allure.\n\nYou lost me when you closed the smoothie bar at the waterfront where I was able to get my afternoon treat when I worked down there or was shopping.\n\nYou lost me when you closed all your smoothie bars in ALL GNC shops. \nEvery. Single. One. \n\nYou lost me when I went to the absolute last one on god's grean earth in downtown Pittsburgh BENEATH your corporate headquarters and you made me wait for 25 minutes for my ultimate smoothie, the peaches and scream.  \n\nAfter 25 minutes the first sip tasted good, but not what I remembered.  \n\nI'm done witchu.  Bye!", "business_id": "AZSYZCaawGBps_tYnG8oRQ", "stars": 1, "date": "2011-09-01", "useful": 5, "type": "review", "cool": 3}, {"funny": 3, "user_id": "H78FHYI03r3ccOVuK472Mg", "review_id": "YWrgUFIF9d6V9QXuHQCvPg", "text": "Sidenote- I was in town for a bachelorette party ( I grew up in Cleveland) \n\nThis place gets to be a bit ridiculous. I get that things are for \"personal\" use... but for the ridiculous price they cost, they should work. We bought $150 worth of merchandise for a bachelorette party. One of the things was a pack of penis balloons for $9. When we opened them and tried blowing them up for a game, they wouldn't blow up, and the one or two that did either exploded or just looked like a ball, it wouldn't fill out to look like a penis. And when they blew up you could tell from all the white lines and \"stars\" that they were really old balloons. So my sister called them to ask if she could return them because they were defective... and the response was she could have a 25% off coupon that doesn't expire. Gee...thanks... That really solved the problem of the defective product. I could understand if I bought something personal and tried it out and didn't like it... but i bought $9 worth of balloons that ruined our game. I will never go here again for the mere fact that you don't reimburse defective products, regardless of the price.\n\nHowever, I will say, the staff was very fun and made us laugh! That was the ONLY positive experience about this over priced place...", "business_id": "DtrTCViUn9uV8TtD_eyMQg", "stars": 1, "date": "2014-06-09", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "rMsB82tk9uOB6JumPMgczg", "review_id": "OrOi4m_QV-3ArB0jJ-WLIg", "text": "Well, sometime between last week and now, George was terminated.  So a young lad of 20 named Mitch was assigned to me.  If he had blond hair and an extra 40 lbs, he'd look a whole lot like Dolph Lundgren from Rocky 4.\n\nMitch kept the workout moving quick, and kept it heavy cardio.  I got my money's worth.", "business_id": "746qkIb4hrCAiw-dCHXFYg", "stars": 4, "date": "2009-03-17", "useful": 5, "type": "review", "cool": 4}, {"funny": 5, "user_id": "JnPIjvC0cmooNDfsa9BmXg", "review_id": "leJhdsZfd6KqObra3Ybtpg", "text": "This was my first experience using movers - prior to this move I'd successfully moved to nine apartments with the help of friends and pizza parties - so I have little to compare it to. \n\nWhen three friends helped me move the same amount of stuff to my last apartment, the move took 2.5 hours. With two moving professionals it took 3.5 hours plus thirty minutes' travel time to the new place. I was anticipating that it'd take less than three hours and would cost about $250 but it ended up costing $400 plus tip. I still haven't figured out the math but that seems like a lot more than I was quoted. Whatever - at least I didn't have to lift a box, right?\n\nThe movers were almost half an hour late but luckily I wasn't in a rush to get out of my current place or into my new one. The two guys, Nathan and Jordan, were very friendly and professional and had done many, many moves before this one. \n\nI'm pretty sure part of the reason the move took so long was because they wrapped so much of stuff in blankets and bubble - a lot of it unnecessarily. The instructions that I gave were basic - nothing was really fragile and certainly nothing was antique or vintage. Just throw it in the truck and let's go. At one point I saw one of the guys wrapping my shitty 1980s 19\" TV as if it was a rare Faberge Egg - this is the same TV that I couldn't shake on Craigslist for $20.\n\nThey didn't bring the standing wardrobes as advertised and also requested - because of this I had to wrap my hanging clothes in garbage bags at the last minute and most of them barely it into my new closet intact - everything kept falling off the hangers and onto the floor. Needless to say this was a huge nuisance. I was most looking forward to seeing this marvel of moving.\n\nThe movers aren't insured to bring you to your new apartment as a passenger in their truck, so if like most people in the city you don't have access to a car, be prepared to take a cab or beg a friend (my method) to drive you to your new apartment. I didn't know about this rule so luckily a friend was able to pull through at the last minute. If the moving company beats you there they won't get started till you arrive so it's worth it to leave a little earlier than they do. \n\nNothing was broken or damaged and I was overall happy with the move - just wish it had taken less time and not been so pricey. Be prepared to spend more than you had anticipated and you'll be OK. \n\nAlso, try to have water or some other beverage handy for the movers - they were sweating up a storm and it was 30C outside (and probably in my apartment as I'd already turned off the A/C), and I had packed all my glasses and had nothing to drink. So think ahead on this one!\n\nPayment by cash or cheque (tip only by cash).", "business_id": "9g1PWYfQ4UGW8hBtOlHTpA", "stars": 3, "date": "2009-08-05", "useful": 8, "type": "review", "cool": 2}, {"funny": 3, "user_id": "l-tDF960t9BakjyH34XfTA", "review_id": "Og3fbm8wOWsptJUvoS0sHg", "text": "I had a fabulous experience here today! My dentist referred me to this place for a root canal (and like Chad, I was wondering what the hell is an endodontist??)  The office is very bright,clean, modern with new magazines--A++. I kinda of wanted to wait a little longer so I could get through the latest Us Weekly and Star issues.\n\nBut then root canal time came.....and they couldn't have been friendlier. I told them how scared I was and they assured me that everything would be alright and it would be a quick. painless process. I've never had a root canal before and after hearing about root canals gone wrong and how horrible they are to go through (ok and possibly from watching Little Shop of Horrors too much as a kid and thinking dentists are out there to hurt me) was a bit apprehensive. They numbed me up, let me know that if I felt any pain just to raise my hand and started to drill. And you know what? it wasn't bad at all! \n\nSoon, they were finished and I was like \"Huh, that's it? Really, that's it?\" They explained the post-procedure care in depth and Dr. Brofsky even let me know about an Italian restaurant or two to try that were unknown to me. Working on my grill and talking restaurants? Hell yes!  When can I get my next root canal??", "business_id": "88gtlWPyUJ-WeM6NfsKWhg", "stars": 5, "date": "2011-01-28", "useful": 2, "type": "review", "cool": 1}]