[{"funny": 0, "user_id": "X0uiVId4KTpmYosdjMmjww", "review_id": "pWYOw0NlH7tdoMyKI_cpdA", "text": "I was skeptical about taking my phone to this business and my skepticism proved to be right. I called in advance to ascertain if my phone could be repaired and was told that it could be and given a price. Upon arriving at the location, the technician that waited on me looked at the phone, and I do mean just looked at it,  disappeared behind a door and then return and informed me that the phone could not be fixed because parts were hard to find. I needed the charging port replaced. His suggestion was to buy an external battery charger and an extra battery and keep switching them out. Of course I rejected his suggestion and call Cell Phone Repair in Independence OH. They ordered the part and repaired my phone quickly and professionally (Approx 4 days from start to finish). Look past the hype and the scrubs and take your phone to real technicians. Cell Phone Repair. Look them up. Unless you just need your screen replaced.", "business_id": "N418anggND_liA_K1wFyDA", "stars": 1, "date": "2014-12-28", "useful": 1, "type": "review", "cool": 1}, {"funny": 2, "user_id": "-anfsW2wxgSiTyjmdMDQeA", "review_id": "wAmoT9v3f5EkyHDHrq-6Ew", "text": "Had the typical cracked iPhone screen and was so happy to hear about this place from a friend. Apple would have charged me double to fix it and the did an amazing job! It was done within an hour and the staff is helpful and patient. Charlie at the front counter was awesome and helped me understand the process, even gave me tips to protect my phone!!", "business_id": "N418anggND_liA_K1wFyDA", "stars": 5, "date": "2013-09-08", "useful": 2, "type": "review", "cool": 2}, {"funny": 0, "user_id": "OZxhvKVTJYlqq6QZRnm4IQ", "review_id": "rENM68Cq0hzsR5bEoHg3hQ", "text": "My first experience with Phone Ambulance was negative but they were able to make things right.  Good customer service.", "business_id": "N418anggND_liA_K1wFyDA", "stars": 4, "date": "2014-10-02", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "97wLGUlDYmG_SfhxtZ1e8A", "review_id": "CCA8l_DdaTwgnm_ufKUTKA", "text": "Took my iphone in to have the power button replaced. Their \"repair\" fixed the button but broke the proximity sensor.  Wouldn't resolve the problem so I picked up my newly broken phone and fixed it myself.  Waste of money...", "business_id": "N418anggND_liA_K1wFyDA", "stars": 1, "date": "2013-07-27", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "4oSao9GTLxFTurp9NFpE4Q", "review_id": "_FmNfZPF5SPIGKLz7uFhJg", "text": "Renovating a bathroom, kitchen or sunroom and need some gorgeous tile? Crossville is the place to go. There are multiple tile showcases throughout the store, and the sales associates were super friendly and helpful when we asked to see even more options. \n\nBackground: my boyfriend and I are currently renovating both a guest bathroom and sunroom and were having a really tough time finding tile that was modern enough without being way too \"out there.\"  Crossville had so many options - from the ultraconservative to the ultramodern and everything in-between. And we found the perfect tile for both rooms all in one visit. Kirsten was quite helpful in matching up tiles and showing us multiple options for each of the rooms to ensure we were happy with the final choice. I swear we gave her a workout pulling all the tile from the backroom!\n\nI highly recommend checking out Crossville Tile & Stone during your next renovation project.", "business_id": "KaXMWrAv1rokWuN4b8-fEA", "stars": 5, "date": "2012-04-11", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "1Lpm-QSHNn3TvgQ7Jm8Fxw", "review_id": "5ARVjatLrME8bJL5V-pqLQ", "text": "I was able to find my supplies for my backyard all in 1 spot. They were very helpful over the phone, that{s when I decided to give them a visit. All materials were very inexpensive compared to others but I liked the most was that they helped me over the phone and  by e'mail before I had to drive all the way there", "business_id": "KaXMWrAv1rokWuN4b8-fEA", "stars": 5, "date": "2014-11-27", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "DXO7CTNAHE21U1m0nEA9lg", "review_id": "HfO3WOfU8HV71XjwZiCB6w", "text": "I would not recommend using Crossville Tile for your project. After my project was complete there was a fairly large surplus of material left over and one item that wasn't even installed. They would not take back any of the materials at all, even with their \"normal\" 35% restocking fee.\n\nAlso with this project I was shown (and then chose) items that weren't even available. The floor tile was ordered and took almost a month to be delivered. The project was started (the demolition) with the understanding that all of the tile would be in within a week. A month is a long time to sit with a demolished bathroom waiting for tile... and then get this - they still charged me $185 for freight costs.", "business_id": "KaXMWrAv1rokWuN4b8-fEA", "stars": 1, "date": "2014-07-02", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "bJ9mEBV7-t6BUC-9lTnIBA", "review_id": "lLSGjQH_k1Lkjlu3FnTLxw", "text": "It is always a great time at R Bar,  good machines, great bartenders ( maryanne especially) , and a nice beer selection!", "business_id": "P6Jt18QgkoLUswyzEMDZWg", "stars": 5, "date": "2011-04-18", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "quSSJqhN88UV2rJMi6X7mg", "review_id": "YILxUCfFhkXrCQtpw_0N2w", "text": "Really liked this place.  Smoky and friendly ambiance laced with photos of Vegas history.  Drove by a few weeks ago - is it leveled?", "business_id": "P6Jt18QgkoLUswyzEMDZWg", "stars": 5, "date": "2013-03-08", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "4gJKaJLh4IH0tvIdK_hlTQ", "review_id": "-LbDua69UEe5DO9w__z1ow", "text": "If you go for no other reason, go for Carlos, his food is incredible. Best Mexican food I have ever had and he is incredibly friendly and willing to please. He makes the best fresh salsa and his chicken tacos are out of this world. The fried ice cream is yummy too. Don't let the look of the place fool you, food is great!!", "business_id": "P6Jt18QgkoLUswyzEMDZWg", "stars": 5, "date": "2012-05-07", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "SZvTWs0VNlgPJRlh9g-lWw", "review_id": "SGIvr7gItZJUglEfeVHt_A", "text": "Dr. Heppler is awesome and knows what he's doing... The staff are also awesome... Highly recommend them for test and hearing aids...", "business_id": "1A8GiBCoh2Yh5Dbuh2YwBw", "stars": 5, "date": "2014-08-04", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "ZmNKjwjNHeCCEqXZ7U87Xw", "review_id": "LUlRVy_7Vv5-XYAhsZEwWw", "text": "I have been wearing hearing aids since the age of 3 (genetic nerve damage) and when I moved to Las Vegas ten years ago, I continued to get my audiological services done when I'd go back home once or twice a year. I am SO glad I recently found Dr. Smith - she is FANTASTIC. She is extremely knowledgable about the software that runs my hearing aids and equally important, she understands the unique challenges that come with being a hearing aid user. \n\nThe office staff is great too - everyone is friendly and wait times are essentially non-existent.\n\nIf you need hearing services here in the valley, please give Dr. Smith a call!", "business_id": "1A8GiBCoh2Yh5Dbuh2YwBw", "stars": 5, "date": "2016-07-29", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "yKhLL_C4ufwTzREbRZ-buA", "review_id": "oxMFhWzIvjVWPi91fDT8bw", "text": "hearing assistance is a life changing experience and expensive. Advanced Audiology is a joke and waste of your time and money.\n\nconsumer reports lists 6 major things any audiologist should do when you make an appointment ... this place did one ...\n\nno options, pamphlets etc ... just my need for a hearing aid and one of the most expensive and annually re-occuring costing ones at that.\n\nwhen i questioned my lifestyle and whether this was appropriate they said absolutely, and when i pushed them on this issue they never got back to me as they promised they would do.\n\n... so i went on the brand's site and it said i , in fact, was correct and these were not appropriate for my needs ...\n\n... but it's the only one they talked about ...\n\n... we were interrupted twice because the next appointment was waiting ... obviously more important than my knowledge or true needs ...\n\nstay away ... they don't care about you ... it's like a cattle car\nand ... you can thank me later ... \n\nwhat a waste of time, effort and money\n\nBEWARE !!!!!", "business_id": "1A8GiBCoh2Yh5Dbuh2YwBw", "stars": 1, "date": "2015-05-06", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "WVNFUjZPtKqI7YPle-EMTA", "review_id": "RXa1EYsprNv2zGkvdIym9Q", "text": "I have received outstanding service and hearing aids from Dr. Rhett Heppler and Dr. Holly Nguyen, both with Aud D degrees. These professionals have the latest equipment for testing and the knowledge to recommend the right technology. Please consult this office before you go anywhere else.", "business_id": "1A8GiBCoh2Yh5Dbuh2YwBw", "stars": 5, "date": "2014-01-16", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "VwGk6Onh9JUPtz34g4jmdg", "review_id": "jhqO89GSFYlqs6U12ssMGg", "text": "After having what was supposed to be a free exam, my insurance received a bill for $330.00 of which they discounted to $54.  Which is what I am billed for.  The exam lasted 15 to 20 minutes,with a lot of time spent trying to sell me an expensive hearing aid. I went to Costco and after a 90 min. exam was explained my options and also a chance to wear as a short trail. I would never recommend Advaned Audiology Institute, but would highly recommend COSTCO.", "business_id": "1A8GiBCoh2Yh5Dbuh2YwBw", "stars": 1, "date": "2014-10-21", "useful": 2, "type": "review", "cool": 0}, {"funny": 1, "user_id": "1Nvx0s6p-JPgOCu4xKZJMg", "review_id": "BcJOSi9n5eFI81FVBVcmsg", "text": "I can be a tough critic, but I was completely satisfied with my experience at Advanced Audiology.  I highly recommend this place.", "business_id": "1A8GiBCoh2Yh5Dbuh2YwBw", "stars": 5, "date": "2015-12-01", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "_mVg8S8XwpcP3oB3keL1Fg", "review_id": "eb3UeBZwPxjpxPGWs2Tfsg", "text": "This place did an exceptional job on my husbands suits and my curtains. I thought they were a little pricey but quite honestly any place is going to be pricey compared to the DC prices I'm used to (I'm used to paying 1.79 an item). The service was quicker than any dry cleaner I've been to in this area. They have same day and next day dry cleaning which is great. The staff is friendly as well. I'll be coming back!", "business_id": "Caei4U6ism5hcuu0piuo3Q", "stars": 4, "date": "2016-07-10", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "D0ELYzbDL1bIvkz1NvF4qQ", "review_id": "2SxjEVwydUVv7gfjbs46sw", "text": "very good customer service, very timely turn-arounds, prices are good for the area", "business_id": "Caei4U6ism5hcuu0piuo3Q", "stars": 5, "date": "2016-04-28", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "j0GNoYOYgavoCi2hk8imFA", "review_id": "e3L6-CYpbTxLVKvTNIVpaQ", "text": "A great little coffee shop on the main street of a cute town.  Coffee is everything you should expect.   Tasty baked goods with some funky vegan options.  Service with a little attitude... I love it.", "business_id": "5m-WYdtIUgfvZdStqmSiRA", "stars": 4, "date": "2012-07-19", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "GichawqUNcpZvF_6IroFFA", "review_id": "a2QRbHE51ANEUMu5MHCD_Q", "text": "Some of the best coffee I've ever had.\nMade to order so it's not a quick experience.\nI will occasionally drive from Newmarket just to have a cup of bold dark roast.\nHeaven.", "business_id": "5m-WYdtIUgfvZdStqmSiRA", "stars": 5, "date": "2015-06-04", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "CxDOIDnH8gp9KXzpBHJYXw", "review_id": "GFHXxaBX-f8lbzgNNm-6vQ", "text": "3.5 Star (Rounded up to 4 as it might be the only Indie Coffeeshop in the area)\n\nThe Grackle Coffee with a small town charm. \n\nNice outdoor area in the front perfect for a nice sunny day. \n\nThey uses coffee from Dark City Coffee Co in Toronto. http://www.darkcitycoffee.com/ My macchiato was nice and balance. For Cappuccino, I do suggest getting a double shot of espresso, but the milk was frothed perfectly. \n\nA lot of baked good that looks yummy in the display case.\n\nWifi is available. Especially great if you are not on Bell network as Schomberg is a dead zone for Rogers....", "business_id": "5m-WYdtIUgfvZdStqmSiRA", "stars": 4, "date": "2016-04-19", "useful": 0, "type": "review", "cool": 3}, {"funny": 1, "user_id": "noVB5DyNa5dEXPhBv5D9fw", "review_id": "tFKg6VCAGYYQM4WICmKyrg", "text": "A great little coffee shop that is on one of the main cycling routes in southern Ontario. Coffee is from Dark City roasters and is great. Their food is vegetarian and vegan, and we had their butternut squash soup. It was superb, and a great way to refill our fluids back up after the bike trip from Toronto. Seating is limited, during the summer, most cyclists eat and drink outside if they are in a big group, we were just four people. They only accept cash payment, no credit or debit machine. There's a CIBC ATM up the street. Looking forward to visiting again the next time I cycle in the area.", "business_id": "5m-WYdtIUgfvZdStqmSiRA", "stars": 5, "date": "2013-09-23", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "vvQhikDPjAzHfSLVgnFkPQ", "review_id": "0j7Odgube8ihIwaeMfWF8w", "text": "Coming to Scott's for lunch made for a great outing to South Queensferry. Armed with a Groupon voucher and expecting a ho-hum cafe in a nice location by the Firth of Forth bridges, we were pleasantly surprised to find this great place! The interior is modern and spacious with nice artwork on the walls. The food is reasonably priced with simple calzones for £3.95 and a whole afternoon tea for only £6.95. We had calzones and salad (which were fine for the price point) and had great mochas and a chocolate layer cake that looked amazing but definitely had a tad too much sugar in it. Scott's is a nice place and prices are good. It has a good location right on the main street but unfortunately doesn't have views of the Firth of Forth. It is definitely worth a stop in for afternoon tea, coffees, or ice cream and is perfect for a little outing.", "business_id": "BmBreVjwYTtZzHEm1NwYtA", "stars": 3, "date": "2013-03-01", "useful": 2, "type": "review", "cool": 0}, {"funny": 0, "user_id": "OEw4Ow0Mnu5gYfkBPzw5MA", "review_id": "TPs4EFzBhLEmvYM2vt35eA", "text": "Brücken haben von je her etwas besonderes!\nBrücken schlagen, Verbindungen schaffen, etwas zusammenführen!\nBrücken bauen...\n\n\n Es ist mittlerweile zwar schon 13 Jahre her, daß wir dort waren, aber diese Brücke hat einen bleibenden Eindruck hinterlassen.\nEin Meisterwerk...\n\n\n Scotland, May 1994: Und wir stehen zwischen den Brücken, am Südufer des Firth of Forth!\nLinks die Road Bridge und rechts die beeindruckende Rail Bridge!\nGewaltig!\nSie verbinden Edinburgh mit der Halbinsel Fife.\nWenn man weiter Richtung Norden fährt, durch Fife, kommt man an den Firth of Tay. Über die Firth of Tay Bridge gelangt man nach Dundee!\n\n\n Zurück zum Firth of Forth: Nördlich der schönsten Stadt Europas liegt South Queensferry! Ein kleines, verschlafenes Nest. Nichts besonderes, außer die Brücken!\nVor allem die Eisenbahnbrücke ist wunderschön und das wohl bekannteste Bauwerk Schottlands!\nGänsehaut ist garantiert.\nZüge wirken wie Spielzeug, wenn sie über den 2,5 km langen Kolloss saussen!\n\n\n 1890 wurde sie nach 7 Jahren Bauzeit eröffnet!\n5000 Menschen arbeiteten an der Brücke, von denen 57 ums Leben kamen!\nDie rautenförmigen Pfeiler sind 110 m hoch.\nDas gesamte Bauwerk besteht aus etwa 54.000 Tonnen Stahl und wird von 6,5 Millionen Nieten zusammengehalten.\nDer Zugverkehr läuft ca 50 Meter über den Wasser, der Schiffsverkehr wird also nicht beeinträchtigt.\nWahrscheinlich diente sie Gustave Eiffel als Vorbild des Eiffelturms!\n\n\n Die Road Bridge, wurde 1964 von der Queen eingeweiht, ist ebenfalls schön und beeindruckend, aber reicht an die Rail Bridge nicht heran!\n\n\n Bilder sind, wie fast immer dabei, eigene Fotos werde ich noch zusammen kramen müssen!", "business_id": "BmBreVjwYTtZzHEm1NwYtA", "stars": 5, "date": "2007-05-29", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "yuFHrb8YQtVuzu0eEXvJtA", "review_id": "GsyAMMqJhYDMpIU0smfwxQ", "text": "I had a very nice lunch here, groupon deal including 2 courses plus a sundae. I feel like this place actually deserves 3.5 stars but since this was my first visit, I'll settle for an A-OK 3.\n\nScott's is a good sized cafe where they also sell ice cream and chocolates and you can even buy a painting or two if you wish! \n\nOrders are placed at the counter and the food will then be brought to you. For starters I had a bowl of carrot, ginger and lime soup which was served with some bread on the side. It was tasty and  can't fault it really.\n\nFor main course I chose the 'Croque Italienne' which was served with granary bread, ham, mozzarella, sundried tomatoes and black olives. It was accompanied by a little side salad. It was delicious and I ate it all.\n\nSo, two courses down and one to go... At this point I was quite full so wasn't sure if it was a good idea to have a sundae as well. But, I rarely say no to dessert.. The waiter kindly advised that it was okay to swap the ice cream sundae for an affogato or a cake. I chose the affogato which was nice though I thought the espresso could have been more hotter, but it was still tasty. \n\nAll in all, a nice little cafe with good food and friendly staff.", "business_id": "BmBreVjwYTtZzHEm1NwYtA", "stars": 3, "date": "2014-05-26", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "p0tGE0tPVnMj_jVh91STvw", "review_id": "3tE--dDnlwaYi2Eisp1Y7Q", "text": "Have been in here a couple of times now; with two consistent points to be taken from both visits. \n\nOne: their hot drinks are great. I've had a tasty mocha, and an equally good cappuccino. I've sampled the hot chocolate drinks that others have had; they do different flavoured hot chocolates which is a good idea, and the orange smelled and tasted great (though very sweet).\n\nTwo: their cakes are somewhat inconsistent. They look good, but are mostly a bit disappointing; from the ones we have tried, anyway. One of our party had a lemon tart they really enjoyed, but my \"hazelnut slice\" appeared to be a giant block of white and milk chocolate and a handful of nuts. Really chalky texture, I could barely eat half of it. The \"smores cake\" also was more sugar and substance that anyone could possibly eat in one sitting, let alone enjoy. The rule seems to be to stick the plain, simple cakes. Thankfully, there are always plenty to choose from.\n\nThese two combine to make a 3-star review. The setting is just fine; open and airy with lots of local art and books dotted around to hold your interest.", "business_id": "BmBreVjwYTtZzHEm1NwYtA", "stars": 3, "date": "2015-12-08", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "iLq7PFxHTq9cr33jKRNgRw", "review_id": "3sUNV2f_0s0OjbvH_HL9Fg", "text": "I only even go in here for a hot chocolate or an ice cream (depending on the time of year) but I have to say I am not entirely smitten by the staff who frequently have quite a bad attitude, and that includes the manager/supervisor.\n\nYou can stand at the till for several long moments, the staff will make eye-contact with you, they know that you are there, but they will not greet you or make any effort to serve you until THEY are ready.\n\nTheir manners could certainly use improving too. This is one of those places that does not accept card payments unless you are spending over £5. Since I only ever buy a hot chocolate or ice cream then I cannot pay by card. So I have to walk all the way to the nearest cash machine. What is the minimum amount you can take out? £10.\n\nUpon handing over the £10 as payment:\n\n\"You don't have anything smaller do you?\"\n\n\"Nope.\"\n\n\"Of course not. Why would you?\"\n\nScrew you! You do not get to talk to me like that! Where is change supposed to come from if everyone had your attitude?\n\nI prefer Jitter Bean. I will spend my money there from now on.", "business_id": "BmBreVjwYTtZzHEm1NwYtA", "stars": 2, "date": "2014-11-23", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "u2NjjrFtg4ZMsoDXtDBqjA", "review_id": "ROLTNm0c3_fOZfQbeQQwew", "text": "A newer addition to the landscape of the Queensferry High Street, Scott's is a decent little lunch spot. Service is a bit lacking (tables didn't get bussed, orders were delivered in confusion, etc.). 4 of us popped in for a light lunch. Sandwiches and drinks all around. 1 drink order was brought out totally wrong, but the rest were right. Yummy sandwiches and while we didn't have ice cream, lots of people were enjoying it and it looked tasty. 2 stars for service, 3 stars for food. I'll give them the overall benefit of the doubt, though :)", "business_id": "BmBreVjwYTtZzHEm1NwYtA", "stars": 3, "date": "2014-01-06", "useful": 1, "type": "review", "cool": 0}, {"funny": 1, "user_id": "s85sNAMlsrI0xCRvfj7Jrw", "review_id": "qQVzH9XXCCoXWj1mlw1X3A", "text": "I have been back again to Scotts and this time enjoying afternoon tea!\n\nLuckily I found a voucher and this afternoon tea was offered for £7 per person. The place was as great as I remember, if not improved. \nThe waitress was really lovely. She asked if I wanted to get coffee already whilst I was waiting for my friend. When I arrived the place was not so busy, but filled up pretty fast within an hour (around 16.00 on a Sunday afternoon).\n\nThroughout, the walls are very colorfully decorated. Very \"arty\" and funky. Sweets (chocolates and ice creams and much more) can be found all over, from one display cupboard to the other. I believe they serve St Luca ice cream and children are particular keen (the young and the old :-) )\n\nI must confess I did not have high expectations for the afternoon tea, but it turned out to be pretty good and I would definitely go back. This place is a hidden jewel.\nThe drawback is that you would need a car (convenience wise).\n\nWith the afternoon tea you are getting the usual bits and pieces: Egg, salmon, cucumber sandwiches; little chocolate muffin, biscuits and a chocolate heart wrapped in red foil. They offered 3 types of scone: plain, fruit and cheese. \nFirst time I had a cheese scone and it was delicious; Really soft and did not crumble.\n\nLast, but not least a glass of Prosecco. Even if you should not get a voucher, they still do the afternoon tea for a reasonable price of £13 per person, including Prosecco.\n\nFor families the ideal place to leave your children playing in the play area at the back of the establishment. I can imagine the back room to be very popular for children parties ! I think I even saw a sweets dispenser. Just WOW!", "business_id": "BmBreVjwYTtZzHEm1NwYtA", "stars": 4, "date": "2013-11-27", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "eKc2gY6fPaQy3zNsbIYDvA", "review_id": "pwK4YCp49HxBj6aC13InfA", "text": "Nice little cafe....\nA good place for brunch and lunch...\nAfternoon tea too!", "business_id": "BmBreVjwYTtZzHEm1NwYtA", "stars": 4, "date": "2013-02-26", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "dgJiQm-f33AEOjJAzdCodw", "review_id": "wk9v2cYhsXfHZai2uwGVTw", "text": "There is only one reason to go here.  Okay, maybe two.  Great hot pizza and good cold beer.  The service is hit or miss and the ambiance is, well, typical local bar style. We've been here a dozen times and things really don't change despite the \"new ownership.\"  But, hey, you can get a good pizza, a couple of beers, maybe play some trivia or watch a game on the many TVs. Or, if you are really lucky, you can catch karaoke night....frightful, but entertaining nonetheless!", "business_id": "0tG3fXLR6SD388aXc3w_0w", "stars": 2, "date": "2014-12-22", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "hmirZIq5vRRwXNHra2uAHA", "review_id": "i1LM9qcT1R_BGYyJukprJQ", "text": "Friendly! I'm from out of town and stopped in for a beer. I don't know anyone.\n\nThe owner comes up to me and offers me some free pizza with two more in the oven? \n\nI miss the Ohio hospitality and this place is the perfect example of it. \n\nSo good...", "business_id": "0tG3fXLR6SD388aXc3w_0w", "stars": 5, "date": "2013-12-21", "useful": 3, "type": "review", "cool": 0}, {"funny": 0, "user_id": "UktEokKTibEh4Eb92FZN2Q", "review_id": "JSTuJ-fIS_OKn5Kaok7S6g", "text": "Stopped at the frog for some food walked in the door it had to be 90 degrees in the place we turned around and walked out, we keep trying the place but it never changes. Nobody wants to sweat while they eat", "business_id": "0tG3fXLR6SD388aXc3w_0w", "stars": 2, "date": "2014-10-10", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "VKP1tppEwu9m4JUmubRCFQ", "review_id": "9pPgkn-LO1VzxABREyF8_Q", "text": "What had potential has fallen like a rock to the bottom of Lake Erie. A change in the kitchen staff a year ago was a godsend, but they have since bailed, and so has the food quality. Pizza is still good, but that's about it. Everything else from the kitchen is either frozen and reheated, or from GFS. Had the Lenten Perch, it was tasteless. The broasted chicken is good, so I'm sure it will be off the menu by the time you read this. \n\nThe wait staff is slow and totally inattentive. They will bring you what you ask for, but at times I feel like a signal officer on an aircraft carrier trying to land a drink. \n\nAnd don't ever expect something for nothing.  The fine art of comping drinks has yet to find its way to SE Strongsville. And, keep your eye on the drink prices. They change more often than I change my underwear!\n\nGlad to hear the outta towner below was favorably impressed. Cleveland rocks!", "business_id": "0tG3fXLR6SD388aXc3w_0w", "stars": 2, "date": "2014-07-25", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "JFIr4bbO2zjQYdA3LwbbsQ", "review_id": "NkBHFqnFj8xVBH8u9bZ-rw", "text": "This is a great shop that we (happily) stumbled upon our last day in Edinburgh. We had some time to kill before lunch, so we wandered over to the Grassmarket area, and my husband spotted Helios Fountain at the bottom of the street. \n\nWhen we walked through the door and I saw the large selection of beads, I was instantly happy, as I'm a crafter and had wanted to visit a bead shop anyway. When I saw the selection of Celtic knot beads, though, I literally squealed with joy, causing my husband to shush me!!\n\nKnowing I would be buying beads, I decided to wander around the rest of the store first, and I'm glad I did. This is a lovely shop for the young, or the young at heart. Tons of craft items, interesting cards and gifts, toys, trinkets, and more cover literally every spot of available space (and hang from the ceiling and shelves as well)! Really, this is the perfect place to buy a gift for pretty much anyone in your life...or yourself. I could've spent hours browsing.\n\nI ended up showing some restraint and \"only\" buying my beads, a few other jewelry-making items, and an interesting polished fossil for the collection on my desk. If I lived in Edinburgh, I could see this shop being a favorite of mine, and will definitely be back for more beads and fun gifts if I'm ever in the area again.", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 4, "date": "2012-10-17", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "KPY6FvT6h-r0W0HAC1Buag", "review_id": "feAVATqF7QVowVYuA0FDng", "text": "This may be a random comment, but I love this place for felt and origami supplies. That's all I have to say really.\n\nBut I like to talk so...\n\nThis place is like a toy shop on the telly, all colours and dangly things and you feel that if you walked too far back you'd fall into a children's television programme where puppets come to life.\n\nI always go in intending to buy only what's on my list, but come out with some interesting bits and bobs too.", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 5, "date": "2012-04-28", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "mJJj_SZff6MEWG5Vx1r8Bg", "review_id": "wOHyEols2P6maYdvUFrUQA", "text": "Once upon a time I could be found in Helios Fountain nigh on every Saturday afternoon with a gaggle of other eleven year old girls. Our irresponsible parents let us make the pilgrimage down to the grassmarket on our own to um and ah over the superfluous treasures that they sell. I was always drawn to the many different bright colours of Fimo (that modeling clay stuff that you bake in the oven) and the millions upon millions of beads which come in every shape and size imaginable (slight over-exaggeration...). Invariably I would leave clutching a tiny paper bag filled with bits and bobs for making some rubbish jewellery with, 50p well spent. Not much has changed since I was last there, except I could have sworn there used to be a café. It still sells everything you could possible need to make some hideous home-made accessories and they still sell Fimo. I can't wait til I have kids to introduce to the joys of crafts.", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 4, "date": "2010-04-24", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "nhVvcPyRGLw466qHVbUjrA", "review_id": "Fqj7uyDzV1E0hNRrHVRghA", "text": "Helios means sun and this place is certainly sunny. Beads beads and more beads. This shop is like an explosion of colour, and trinkets hang all over the place like some sort of Aladdin cave.\n\nIf you are into crafts or after something a bit more different for a gift then this is a good stop. I was looking for a small chain and particular earring hoop and was told at other craft shops in the City to head here, so it certainly has a good reputation for its stock.", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 4, "date": "2010-06-04", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "tM-LuoQZFvLw8_pRo5qDcA", "review_id": "nJ0B2MexE3IlvALd3dzF7A", "text": "This is a wonderful shop for all thing unusual, a great selection of cards, things, stocking fillers, music boxes, puzzles. The list goes on, call in and become a child again!!", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 5, "date": "2008-06-07", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "hhTEZQNODA7xPLYRy7Jkew", "review_id": "WQZkITJ9Hfap9Cy2kIuO5g", "text": "I love this shop its got gifts traditional styled kids toys as well as some beading and jewellery making stuff. Not to mention dragon soft toys which i adore. Small but nice range of gemstones really got a little bit of everything.", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 4, "date": "2008-07-31", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "SJHZlBsy0GF_HYRN7wG-6A", "review_id": "XW6MWzFVQJNKkpQpKovf9Q", "text": "For some reason, whenever I talk to people about Edinburgh, about the time they spent there when they were kids, they remember Helios Fountain as being a truly magical place. A land full of sparkling beads and shining badges. And cakes that just didn't amount to anything next to the other shiny things. \n\nIt's in the same group as other Grassmarket businesses. It sells quirky things you really don't need. But everything's so shiny and appealing you really do think you need them. I've been warned quite a few times against going there for the sake of my pocket and I normally listen, but I've been in a few times to browse. It's a great place to buy presents when you can't really think of anything to get.", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 4, "date": "2010-07-30", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "OzEa6LtA5SZcnte0_AMKwQ", "review_id": "b5Qg5wnTuR-PK7f_9Ha9bw", "text": "Helios Fountain is a small shop at the end of the Grassmarket. It sells unusual gifts, wooden toys, some books and craft materials. My favourite area sells lots of beads and jewellery making materials: It stocks unusual stones and gems as well as wire/thread and clasps. It is small but it is a lovely shop to look around. You'll find lots of random craft materials and old fashioned toys as well as handmade paper and cards.", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 4, "date": "2007-10-26", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "1UFnVs1TUBqxqWPFvZvXWA", "review_id": "PGltR4Q7xYdysQaYN8NANg", "text": "A charming quaint little shop, perfect for buying gifts from. They sells lots of little curiosities and toys as well as some lovely candles and beads. I love this shop. You can spend hours in here browsing so only go in if you've got something specific in mind or at least 30 minutes to spend in here. A must visit : )", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 3, "date": "2009-06-02", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "5iRCT4uAsyP1UoEUoxbylA", "review_id": "wYfkSNtQCKjJ_1ia_H4czg", "text": "Helios Fountain has a name which sounds like a spiralling burst of light and colour. It conjures up images of magic and vibrancy.\n\nIt's appropriately named, since inside the shop is bursting at the seams with beads, dangly gifts and quirky items.\n\nLike Emma, I was also pleased to see the Fimo blocks. I used to love this stuff when I was a kid, and relived the pleasure of modelling with it when I worked in an after school club. As a general rule I would only ever make wee clay cats and dogs as a child (I was a freak like that) but there are enough colours in here for you to make your own lively, alternative universe (or at least a splodgy, multicoloured dinosaur!)\n\nHelios was more like an art store, but they also sell a number of crafty books, not to mention some lovely gift items of all shapes and sizes. They have some cuddly stock geared towards children, and unusual offerings such as books about dragons!\n\nThere is something magical about Helios Fountain that makes you realise you're a bigger kid than children these days. This place would be great for teachers looking for arts supplies, but what actually happens is adults get more excited about the crafty goods than you could anticipate! Bewitching.", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 4, "date": "2010-06-13", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "l_n89Nfn1BSJENwHy9nt-A", "review_id": "hTICM1xcJmmkD-nieuYaIA", "text": "An aladins cave! Everything from jewllery making supplies to cuddley toys. I remember a birthday when I was still at primary school, being taken into Helios fountain to buy some gifts and they had the most amazingly funstuff!\n\n\n i still love to browse and always seem to find something nice to buy (last time it was a cuddley moose)", "business_id": "ApZpHQf4H2Buf8OYF9mjuw", "stars": 5, "date": "2008-09-20", "useful": 0, "type": "review", "cool": 0}, {"funny": 2, "user_id": "uWhC9eof98zPkvsalgaqJw", "review_id": "6082NEYdZ9fm-hDPmZpIIw", "text": "My family and I stayed here during vacation after reviewing Trip Adviser reviews and it was great!.  First of all, the decor and furnishings were very nice and modern.  The facility was clean and quiet and the bed was very comfortable.  My daughter and I loved the work out room and used it several times.  Staff was very warm and friendly and very \\generous with those baked cookies, (something to look forward to in the evening).  The hotel is conveniently located right off of the freeway so it has great access to Akron or Cleveland.   However, you don't need to get on the freeway to find dinner.  You can just drive down the road in either direction and find eating options.  This was a great choice and highly recommended.", "business_id": "9HyDagvBOIcQ5DvJv9-Z7w", "stars": 5, "date": "2015-02-15", "useful": 3, "type": "review", "cool": 2}, {"funny": 0, "user_id": "rARcztwI2W7fUAMuTpUXZQ", "review_id": "8TOTq9IKg-Oi-aO3DE5rcA", "text": "Friendly staff starting with my check-in at midnight and continuing throughout my 2 day stay- above and beyond customer service from Shelly & Megan at the front desk!  A refreshing change from most of my work related travel.", "business_id": "9HyDagvBOIcQ5DvJv9-Z7w", "stars": 5, "date": "2015-11-12", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "sZIvgKtu0OSPcWMrppIqcQ", "review_id": "GbNBItcrvvpekEe4o213WQ", "text": "What brought me to Kent was a high school reunion for a friend.  I'm currenly staying at the Hampton Inn off SR43.  This place is very clean and extreemly comfortable.  The fitness center was perfect, the breakfast fresh and hot and the business center here didn't nit pick me, letting me use the internet for free.  The rooms are updated and cozy. The staff very friendly. No suites at this hotel, all the rooms are the same size but they are very nice and I'm happy.", "business_id": "9HyDagvBOIcQ5DvJv9-Z7w", "stars": 4, "date": "2014-08-22", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "Afv6PWGNoTCOu7DmUwvekw", "review_id": "QSUcVmtJZehOCtlYZdvf7A", "text": "I had a great experience here in Kent at this hotel. The room was clean, the staff was professional and helpful. Their breakfast was plentiful too. It's very close to the highway and downtown.", "business_id": "9HyDagvBOIcQ5DvJv9-Z7w", "stars": 4, "date": "2015-04-22", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "ZNAAVGPmblHEvR-kP__1DQ", "review_id": "T19FFZMXvkMFmE8u1IVPDA", "text": "This place is a great ice cream shop!\nThey have a HUGE menu to choose from with everything from soft serve to banana splits!\nThe prices aren't cheap but it's definitely worth it.\nThey recently opened up a new section with plenty of seating inside which is a bonus considering this shop is technically a front of a house and used to just be accessible through a walk up window.\nThey are open till 11pm everyday so it makes a nice after dinner snack!\n\nTheir website is detailed and has all the prices on it.\n\nI really like this place, its close to home and a great ice cream shop for those in port  credit. \n\n5 stars", "business_id": "43txhtN0GCFtHzd3XMQ0CA", "stars": 5, "date": "2015-05-31", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "to3PLMCLsSZTMl0YZvqtUA", "review_id": "GH1hfrTiFC9fEeseyQlZIQ", "text": "Great little icecream spot less busy than the other one on the same street and the banana splits are to die for.", "business_id": "43txhtN0GCFtHzd3XMQ0CA", "stars": 4, "date": "2015-05-17", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "U5YQX_vMl_xQy8EQDqlNQQ", "review_id": "YYvOHTXS7uSKr8xAmAhk0Q", "text": "Despite its name, Dairy 'King' is a much smaller operation than Dairy Cream/Tom's Dairy Freeze.  However, it offers the same product, re:  soft serve, \"hard\" ice ceam (the usual flavoured stuff that you get at the grocery store), banana splits, sundaes, etc.\n\nSince it's a seasonal operation, it's literally a order window, no indoor seating, and 3 picnic tables outside the window.  So best to go when it's hot out!\n\nDairy King is literally on the outskirts of Port Credit, so convenient when you feel like soft serve, outdoors, and don't feel like driving all the way out to Cawthra/Lakeshore (Dairy Cream).  Be warned, this particular spot is not much of a local hangout as there's no lot - just street parking - so there aren't kids blasting their sound systems, sitting on the roof of their cars.  Great for the slightly older crowd/families who've been there, done that.\n\nI got a regular sized twist soft serve, chocolate dip, and it was $3.50.  Good enough size for sharing.  I'd say it was more 80/20 chocolate:vanilla ratio, so if you gravitate more towards traditional vanilla, stick to vanilla.", "business_id": "43txhtN0GCFtHzd3XMQ0CA", "stars": 3, "date": "2015-07-20", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "MFFTDftUkNBIZQVhdrM5wg", "review_id": "qnH0_67PMZfR9VNthKccqg", "text": "Nice little spot along Lakeshore. We had 3 cones with chocolate dip and a milkshake. All were very good.  It is more of a walk up establishment, there are few tables/chairs in the room next door and benches outside. Seems  like they have a big menu. Would certainly return to try others.", "business_id": "43txhtN0GCFtHzd3XMQ0CA", "stars": 4, "date": "2016-08-23", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "_0DLxE1ZWnSLorWWLGsm7w", "review_id": "I831SgXrlWkMq7sxc9dFmA", "text": "I ordered online which was easy...I had to wait 1h for my pizza to finally come by...I don't live far from the pizza pizza...I did order on January 1st so maybe shame on me?  If your offer service on odd days...just make sure you can if you can't they don't open! They also messed up my order by giving me a smaller can of soda...So two stars because the pizza was good and the online service was great.", "business_id": "OTxGMvkHkPpU75QvMPHr9A", "stars": 2, "date": "2013-01-02", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "Ctrp5IoEKHkixDSIyYHDpw", "review_id": "qF7tShS18BTZSmN6rRXgjg", "text": "Solid delivery pie. On par with Pizza Hut and Domino's, without being greasy. Tried a large pizza with one half roma tomatoes and fresh garlic, and the other half pepperoni and extra cheese. The 'traditional' side tasted decent, but the tomatoes and garlic were surprisingly good.\n\nTheir policy is delivery within 50 minutes or its free, and my order came in under 25 minutes. Not sure how they managed that sort of speed.\n\nFor those who do cold leftovers - it fared quite well, even the next morning.", "business_id": "OTxGMvkHkPpU75QvMPHr9A", "stars": 4, "date": "2012-10-21", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "N4mIzFm7Qs9yKcRFXg4-1g", "review_id": "IfE_VqGiWVO9ms9taf6ZwA", "text": "This is a cute, convenient little pizza joint right on Rue de St. Catherine.  Perfect for you late night greasy food craving after a night of hard liquor!  Nothing too memorable though, a common pizza joint.", "business_id": "OTxGMvkHkPpU75QvMPHr9A", "stars": 3, "date": "2013-04-10", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "bpEXbNzDgOYINVOjDw_O_Q", "review_id": "mPrCZZXGXaPL58GV2SaZxQ", "text": "Ils n'arrivent jamais à l'heure qu'ils promettent, les livreurs ne parlent pas français et ils oublient les assiettes malgré l'insistance dans la commande.", "business_id": "OTxGMvkHkPpU75QvMPHr9A", "stars": 1, "date": "2015-10-04", "useful": 0, "type": "review", "cool": 0}, {"funny": 2, "user_id": "fAIza3zQHUsdUZMnqsJZ3A", "review_id": "YucAVgz7sISleJG_JjbnfA", "text": "Had a pizza delivered from this store.  Pizza tasted fine (seemed like it was cooked with a Domino's style pressure oven as opposed to the Baker's Pride oven which I prefer) but I don't recommend patronizing this place because I ordered a 12\" pizza and seeing how the pie didn't quite fit the box, measured it and found it was only 11-1/4\".  Totally unacceptable.  That 3/4\" shortfall is ripping off the customer tremendously.\n\nThere is NO excuse for this.  Pizzas are made on circular trays(?) which provide for relatively consistent sizes.  Even if the same amount of dough was used (it didn't taste extra doughy), that's a lot less toppings used.\n\nObserve:  12\" pizza = 3.14 * (6^2) = 113.04 sq, in....  11-1/4\" pizza = 3.14 * (5.625^2) =  99.35 sq. in. -- 12% less pizza or 13.69 sq. in less or a 3.7\" square of pizza missing.  I'm still hungry because of this missing amount.\n\nAlso, the receipt doesn't specify the delivery charge (Domino's does) but lumps it all together with the price of the pizza.  Something to hide?\n\nAVOID this establishment.  They must be taught a lesson.", "business_id": "OTxGMvkHkPpU75QvMPHr9A", "stars": 1, "date": "2011-10-02", "useful": 2, "type": "review", "cool": 0}, {"funny": 0, "user_id": "v_lWueG7V_vul4E8rCEdjQ", "review_id": "QYYsShAyWyfqA8TorDMq4A", "text": "Wow, there's a real mixed bag of reviews here!  Before I begin, I should say that I didn't visit the toilet here, and so can't comment on such matters!  I was here for a short visit to pick up a drink on my way to do some more Yelp research.  I found the assistant who served me to be very pleasant, greeting me with a cheery grin and serving me quickly and efficiently.  On the service front, I can't fault them.  I think I'd need to return here, and stay a while with some food to get the full picture of this place.  As far as I can tell, it's a great little local cafe.", "business_id": "DtuC7O4Aw63gPnG0eCxGKQ", "stars": 3, "date": "2010-07-23", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "o0WGr8L3BWfH2Bslpnqw6g", "review_id": "mI2ZwK6e-36LTm_qaRmGIA", "text": "I see Cafe Anfora is getting a bit of grief for their bathroom....!! It's a cafe, not a toilet - the toilet is a minor detail.\n\nANYWAY, the cafe itself isn't too bad! It serves cakes etc, when I asked if they had anything for lunch they said there was a wee problem in the kitchen, they were lovely about it so I wasn't too bothered. Ok my scone was a bit chewy, but it was edible. My coffee was nice and warm, just how I like it, but I noticed some people turning their back because it was too cold. Uhoh.\n\nIt's not bad, but it's not amazing either, and the toilets make it different!", "business_id": "DtuC7O4Aw63gPnG0eCxGKQ", "stars": 3, "date": "2010-07-16", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "XXqfjl1w2QolT4_r_XRiwA", "review_id": "mP_h8uXQn7h8uqLDJsV8hg", "text": "Ok, being an optimist, I'm usually of the opinion that no establishment deserves one star. Until I decided to get some lunch is Cafe Anfora.  It was quite possibly the worst experience I've ever had as a customer.\n\nAnd so let me begin.  I didn't even use the toilet facilities so I shan't complain about them, it seems that aspect of this place has been well and truly covered by previous reviews.  I was walking along trying to decide where to go for lunch and decided upon Cafe Anfora as it looked that a pleasant place to sit and enjoy a tasty sandwich.  True enough, I imagine it would have been, had I been allowed to do so. The interior was very bright and open, with just a few tables and simple chairs arranged in the shop front. \n\nAnd so I walk up to the counter with a smile and a greeting to whom I assume was the owner, and was welcomed with a scowl. I gazed up to the board above his head displaying clearly what fillings I could have, yet found myself squinting to try and decipher the crude pictures of the types of sandwich available (toasted, non toasted, baguette, wrap etc). Upon enquiring that these strange hieroglyphics represented, I was again greeted with a very rude response from the man behind the counter along with any enquiry from him as to what I was doing there (?!?). At this point, if it hadn't been for my increasingly ravaging hunger, I'd have simply walked out.  \n\nYet persist I did and ordered a sweet chilli chicken toasted sandwich with a dash of mayo. Yet what I received, as I found out later, was a overly chewy sweet chilli chicken cold sandwich with garlic mayo. Not a great combination at all, it tasted foul. Upon attempting to take a seat in his empty cafe, I was informed by a series of grunts that I had not paid to sit in and that I would have to leave. I was in no mood to argue and so leave I did. On the way out the door, I stopped to take note of the opening hours. Upon seeing this, the owner came forth from the counter and ushered me off the premises. \n\nOverall, the experience was one of extremely unfriendly (bordering on hostile) staff and poor quality of food. I hadn't even been offered brown or white bread, and the order was wrong. As the shop wasn't busy (I was the only customer), there was no excuse for this terrible performance of customer service. \n\nAvoid.", "business_id": "DtuC7O4Aw63gPnG0eCxGKQ", "stars": 1, "date": "2010-07-07", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "Cy1PV2TdYeDFA16mUOlr3Q", "review_id": "hRNDncosek2m0CMb4yzzNQ", "text": "Clearly, I hadn't read these reviews or you would not have caught me anywhere near this cafe. The thought of having to go outside for the loo is pretty grim, and I wouldn't really expect that sort of thing from a cafe nowadays (it was my only complaint about University Cafe in Glasgow!)\n\nI have to be honest and not allow the previous reviews to cloud my judgement, but this place was pretty bad by my standards, and I really felt like the staff didn't want me there.\n\nIt's a bad day when you feel like an inconvenience in an almost empty cafe, but I ordered my tea and cake and took a seat, and the conversation with the staff was zilch. The tea was fine, it is tea after all, and the cake tasted as if it had been left over from the day before, bearing in mind this was just after midday. It wasn't expensive but even at that it didn't justify the money I paid, it was simply below par on a huge scale.\n\nBest avoided, unless I just got the staff on a grumpy day.", "business_id": "DtuC7O4Aw63gPnG0eCxGKQ", "stars": 2, "date": "2010-07-07", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "SxV1Jq7UANuSYpn42JXvOA", "review_id": "M9tSEbtkyHDrVxMcu-sXhA", "text": "Ok, ok, ok... I can see your point with the toilet - if I had wanted to go number one outside I would have travelled back to the 1800's thanks. I mean seriously - who the fuck designs a cafe where you have to pee outside?! Idiots, thats who.\n\nThe tea I had was cold and over stewed, and when I asked for a better cuppa I was instantly afraid I would get my tea back with a few 'extras' for good measure. Food was awful, cake was hard enough to shatter teeth.\n\nBAAAD.", "business_id": "DtuC7O4Aw63gPnG0eCxGKQ", "stars": 1, "date": "2010-06-19", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "cmC-EMKQMxXycAfkgd0g4A", "review_id": "brViiRi3S4Hs9sg1xMjj1w", "text": "I have only once stopped by this wee tearoom, but for one reason in particular, it's unlikely that I'll resturn.  The toilets...are out the back of the kitchen.  And by out, I mean outside, as in out of doors, as in, not inside teh cafe!!  Very strange and made worse by the fact that the toilet roll was damp, there was a gap between the bottom of the door and the ground (not floor, GROUND!), and the sink was out of order.  Enough said.  \n\nAside from the toilet fiasco, the tea was nice, although its pretty difficult to prepare bad tea, but my scone was pretty rough.  The only reason this place clawed back an extra star was the magazines provided for the lone customer, i.e. me.  And had I not been on my todd that day I probably would not have noticed the discreet magazine rack and so, Cafe Anfora may only have received 1 star.  Bad times.", "business_id": "DtuC7O4Aw63gPnG0eCxGKQ", "stars": 2, "date": "2010-06-19", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "xXQTdJXPGOP-NUYctcQw8g", "review_id": "vmt5xur6RU3P6TQryA7oDg", "text": "I think to label the owners of this cafe as \"idiots\" is a sign of idiocy itself. I seriously doubt that the bogs are outside just for a laugh, and would suggest myself that lack of funds / ability to extend the property, or planning permission issues are what's to blame, rather than mere lack of intelligence. \n\nAnyway, the location of the toilets doesn't bother me much. I'll quite literally shit anywhere, and have marked my territory in far worse places than the grim, damp shed given over to defecation just outside Cafe Anfora. The complaints are just a sign of how mollycoddled our society has become. In 1916, our boys in the trenches lived for years at a time in our own filth, before heading over the top to be ripped to pieces by machine gun fire. They didn't complain. \n\nFeces based issues aside, it's not the greatest cafe ever, but will do for a coffee and a sit down if you find yourself out in the suburbs for whatever reason. Nothing wrong with it in my experience.", "business_id": "DtuC7O4Aw63gPnG0eCxGKQ", "stars": 4, "date": "2010-06-19", "useful": 2, "type": "review", "cool": 1}, {"funny": 0, "user_id": "tG5s3vgVpHun0unatapjMg", "review_id": "aYLKCZBZIVdL2ALmDWjzzw", "text": "Jackie and friends are the best. I am taking a class here and they are very helpful and Jackie and Patti and teaching assistant Peggy are great at teaching. Very patient. If you get frustrated and need help you are welcome to walk in. Beautiful tasteful samples to choose from. Things you would truly wear are shown in the store to tempt you to try to make for yourself . They have wonderful patterns! Thursdays they are open later and you can park in the lot across the street! They are expanding their store to a brand new spot right next door it will open in August!", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 5, "date": "2014-03-12", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "AyK9b__pYqdnt_EqmeIohQ", "review_id": "bKdPitLt6OFCHhRdjkt9XA", "text": "Love love love the Knitting Tree! Jackie and staff are very helpful. Anytime I need help with a project I sit in the store and work and they help me along. They are very encouraging too. Will order other colors of yarn for you , mine came in within the week.  There is one staff member who isn't very patient or helpful, so just ask someone else if you get her.  The new store is lovely with lots of knitted up projects throughout.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 5, "date": "2014-12-05", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "hQr6u2dX5wI7DzWAI6gX0A", "review_id": "7FK78OvPUqF9mcUP4EHfsw", "text": "I have to say, this shop is very cute and will fulfill the needs of any dedicated knitter.  The store clerk helped me pick out a gift, a nice book, for a friend of mine.  Unfortunately, the gift was not what my friend was looking for.  I was told later by another employee that they do not do returns on books as they have had issues with people photocopying the knitting patterns and returning the books.\n\nAfter speaking with the owner, she agreed to give me an exception after explaining the policy.  It is not likely that they are willing to do this again for anyone.  So, if any shifty knitters are reading this, SHAME!\n\nAlso, if you had read my last rating of this store, please disregard it.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 4, "date": "2014-04-18", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "DljN8oWW6gxJdZ2zOEyTkA", "review_id": "uhQIF1HJU3i1bF1Rz62IMw", "text": "I have had two opportunities to buy yarn from this store. Great yarns. Lousy customer service. Sales staff seemed put out by my questions. I will give them one more try--but if I am treated poorly I will take my business elsewhere.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 1, "date": "2014-10-19", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "yuUPTnIWqnKqMpoqw5YXbA", "review_id": "71J878JpFEEZxHv6Yw18Tg", "text": "A gem.  Great displays of sample knits.  Good books and magazines.  Quirky staff.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 4, "date": "2012-05-12", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "NBExFi81ALj1QvjcDckKjw", "review_id": "atM5MefLKRqY66LtyMr7vg", "text": "This is a strange place. I went to buy some yarn and asked one of the clerks for a recommendation. She told me I would have to choose a pattern and handed me a book. I already had a pattern, but she told me to pick one. I flipped through the book for a second and just picked one at random so that I could just buy some yarn. She finally helped me, but then said that I would now HAVE to buy the book, since I had used it. There's really nothing wrong with the place, but after that bizarre exchange (I refused to buy the book; she relented but seemed pissed about it), I'd prefer not to go back.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 2, "date": "2012-01-09", "useful": 7, "type": "review", "cool": 0}, {"funny": 0, "user_id": "u2NjjrFtg4ZMsoDXtDBqjA", "review_id": "km5Ap6Bxpxh1tKbmpO37Ig", "text": "The Knitting Tree looks so cute and inviting. Years ago, when I first started knitting, I was excited to finally get some \"real\" (aka: not cheap acrylic) yarn and embark on a major project. I was treated rudely and dismissively by a clerk who couldn't bother to have her personal conversation interrupted to help a customer.\n\nFlash forward a few years: I give them a 2nd chance. i ask for some help. I am ignored. I wait patiently. Finally, I am snapped at with \"can I HELP you!??\" and in the end I leave without a purchase.\n\nFlash forward another few years and, even though I have had bad experiences, and have seen how the mutual management has ruined Lakeside Fibers, I go in as a yarn company online notes that The Knitting Tree carries the yarn I seek. I was in search of a particular color. Not only did they not have the color, but they seemed to not have the yarn type. And that was fine. It was probably old info on the website that referred me. But the salespeople are always just so rotten and unhelpful. \n\nThree strikes: you're out. No matter how much they spruce this place up on the outside, it's like an evil beauty queen: pretty on the outside and coldhearted on the inside.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 1, "date": "2012-08-30", "useful": 7, "type": "review", "cool": 0}, {"funny": 0, "user_id": "fD95ZidPzEtfzm4yLsY84w", "review_id": "uaYSugAXjlOSqGPdxCAcUw", "text": "The woman working was friendly and the customers who were also there seemed like happy regulars.  The shop isn't nearly as big as other places, but it was stuffed with great yarn.  There were many many books, beads, and knitting supplies to choose from, as well as some cute stuff.  I'd recommend a visit if you're into crochet/knitting at all.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 5, "date": "2009-04-07", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "5Iokhs9ONNdT_mbE4Fe4BQ", "review_id": "bYd5K5oaKWqFtcsQwJx7jQ", "text": "Love love love this yarn shop. It's only my second time visiting the Knitting Tree, as it's a bit of a drive from MKE, but it is a lovely shop. The woman who owns the shop (she has a business partner that I've not met) is helpful and very friendly. \n\nBut the best part about this shop is the variety of yarn within its four walls -- Malabrigo, Madelinetosh, and plenty of other hand painted yarns to choose from, and in many different weights.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 5, "date": "2013-10-23", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "1SIp4vDCDDydDy-IG-afww", "review_id": "nHf_4cVsnIbSs-hs2Hvz6Q", "text": "A great selection of natural fiber yarn.\n\nHowever, they could be clearer on their policies.\n\nI went to exchange some yarn because the project I started needed less than what I anticipated. Did not think it would be a problem because the receipt clearly states that store credit would be given with a receipt within 3 months of purchase. Check, check.\n\nI go to exchange my yarn and I'm denied because \"We don't accept yarn that's already been wound. You might have knitted off it already.\" Fine, whatever, get a scale. 100g = 100g. \n\nBut my biggest complaint was that I never asked to have my yarn wound when I bought it -- I went to check out, and the yarn was taken from me and wound. No explanation that it nullified my ability to return it, nothing.\n\nDespite the fact this store is half a block from my house, I won't be back. The flippant manner in which I was treated (as if I should have known this by osmosis?) soured my experience.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 2, "date": "2014-02-22", "useful": 6, "type": "review", "cool": 0}, {"funny": 0, "user_id": "0_tQ4ikFhSEwP5VsgEk7NA", "review_id": "0r68IO6yXZ8zUyup3L3RTg", "text": "The Knitting Tree has been THE yarn place on Monroe Street for many years. My daughter has gone there many times for help with her knitting projects over the years and the people there have always been friendly, helpful, patient and understanding with her. They have a great selection of yarn and loads of experience. If you need yarn or help with your knitting, this is your place.\n\nLocal tip: since it's street parking only, try to avoid going there during the evening rush hour as there's no parking on that side of Monroe St. then.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 5, "date": "2014-02-19", "useful": 1, "type": "review", "cool": 0}, {"funny": 1, "user_id": "9VcyKGiKdci7ngrnRJeVTQ", "review_id": "m6aiYs9Rp92kWCHPcypi-w", "text": "I used to work at the knitting tree, way back in the 70's.  I was at Edgewood College then, and Dottie, Suzie and the gang helped me learn more about knitting than I even realized possible.  I was so happy to walk in recently ( Early Feb '09) to discover things are better than ever!  Jackie gave me the grand tour, and things were much improved since I worked there.  The selection is wonderful and the space is bright and open.  The \"library\" is inspiring and the pattern selection rocks.  \nThanks to Jackie and the folks there that day I felt welcomed and was so happy that I stopped in.", "business_id": "-0b86isaXMY0v4g-V8GZ9Q", "stars": 5, "date": "2009-02-09", "useful": 2, "type": "review", "cool": 1}, {"funny": 0, "user_id": "y65L2SiuGWYUrjQbB4-Wrw", "review_id": "kkAAA2pTpkNV4pcXmbL3nA", "text": "I've been using Neon LV for my property management needs for years. They've always rented my property within a few weeks of being vacant and I've had absolutely no issues.", "business_id": "2m6iTNa-ONhRQ4rYd5xmpw", "stars": 5, "date": "2016-08-18", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "b5UMbBRdn5T5fnzLTWh5sA", "review_id": "YMKrG55ahc-PRGopzHIkMg", "text": "I have been using Nancy and the services of NeonLV to handle the rental and property management of our house in Las Vegas for about a year and half now.  She has been very valuable to us.  Not having any experience with property rental ourselves, she assisted throughout the entire process, taking care of our house and tenants.  She found us very suitable tenants and managed everything wonderfully!", "business_id": "2m6iTNa-ONhRQ4rYd5xmpw", "stars": 5, "date": "2016-08-08", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "2UVvX9fjqpuUJkJOAk_FMA", "review_id": "-pBxS5Vn7H0qIbZR21jl4w", "text": "NeonLV is great property management and real estate service company. Nancy is wonderful, friendly, very professional and caring. Whether it is a buying/selling a house, investment property or vacation house, she is the person to make things smooth and easy. Nancy is a excellent problem solver who knows how to take care of any property she is managing. She treats her clients like family members. Nancy and Steve build long term relationships with their clients. I really think that this company is a rare gem of fabulous Las Vegas.", "business_id": "2m6iTNa-ONhRQ4rYd5xmpw", "stars": 5, "date": "2016-08-08", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "IWG7BL2mr5dxSnIxPG_G1Q", "review_id": "dl-uUM9aszaz_xqSoESkHA", "text": "EA Restoration came out and took care of a moldy wall in my garage.  They were awesome!  They were flexible to find a time that worked with me and when they showed up, they got right to work and worked late into the night to get the job done.  They were polite and exhibited very good communication on exactly what they were doing.  I'm very impressed with their service and would definitely recommend them to someone else.", "business_id": "462v8p6VFqbuG93WWpvnbw", "stars": 5, "date": "2015-09-24", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "vUsdx2bloNoVKawcYWsz9w", "review_id": "xoTwlsljmCQhVc2X8GOvUA", "text": "I worked with EA Restoration twice this year and both experiences have been tremendously great. This past summer my hot water heater burst and flooded my home, and during the initial clean up I discovered that my house was full of asbestos. EA Restoration conducted the asbestos-related clean up issues. They were efficient and fast and their crew was meticulous when cleaning any mess that was made. The owners, Craig and Cavin, were incredibly thorough in their explanations of the work being done on my home, and they were both quick to respond to my voice messages, emails and texts. I was very impressed with their work and hired them again to perform an asbestos abatement demolition of a home renovation project. Again, EA Restoration was a super choice. I am very pleased with their work and highly recommend this company.", "business_id": "462v8p6VFqbuG93WWpvnbw", "stars": 5, "date": "2015-12-16", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "1KAGYuNOH3Lys2w_gl7GSg", "review_id": "oUgeM8_k8zmuPpyTTWBWFw", "text": "I was referred to EA Restoration because of a leak in my roof above my garage via Facebook from a wife of one of the owners. I called and left a message. A few minutes later the owner called me back and set up an appointment for him to come out  today to give me a quote. That's a plus in my book. I'd rather someone come out asap since if it rains again we'll just have more damage. \nI'll update my review after he comes this afternoon.", "business_id": "462v8p6VFqbuG93WWpvnbw", "stars": 5, "date": "2016-01-08", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "hBV5Og_UYpbzkpv04zWYAQ", "review_id": "ffApaWqC3Yn536pTHqv2wA", "text": "I'm an air conditioning contractor and I have been involved with jobs and referred to jobs by EA Restoration. These guys know what they're doing and they do the job right. That's what you look for with the kind of work they do. They know how to deal with insurance agents and home owners alike to make sure you get all the mold or whatever it is that they are eliminating from your house. \nHighly recommend them. Craig is really good at estimating the jobs and not missing anything.", "business_id": "462v8p6VFqbuG93WWpvnbw", "stars": 5, "date": "2015-10-15", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "_AzH6zJraPQmIf8dfXhjxA", "review_id": "Opb-4Y4G7q2NXAEsLw1T9A", "text": "As a local insurance agent, I see first hand how frustrating and hard it can be when catastrophe strikes. EA Restoration is the best at helping people, and their homes, get back to normal as smoothly as possible. They have done numerous jobs for me personally and my clients and neither I nor them have had one complaint.", "business_id": "462v8p6VFqbuG93WWpvnbw", "stars": 5, "date": "2015-10-12", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "whi3zl33tysaMgU2Lutumg", "review_id": "OYYSKMlpit9DCsSnli-FlQ", "text": "I am a fairly new resident to the Dufferin Grove neighbourhood so I decided to explore other options around here. I've been to Blood and Bandages and although I like the straight up masculine ambience it was too far a walk to head to and I didn't want to get rained upon as the day has been threatening with petulant showers all morning. \nAs I made my way down Bloor west of Dovercourt I went into the first place I saw \"Hair by Lina\" a generic looking salon that offers a variety of services but most likely specialized in unisex haircutting. Of course I was hindered from entering because the place was having their hardwood floors varnished. I did a 180 degree and walked back along bloor looking for another venue that may provide me with the means of a fashionable haircut. \nI then heard a \"Mister hey do you want to cut your hair\" I turned around I saw this warm portuguese woman inquiring if I had just checked her store to see if it was open. I replied \"Yeah I need my hair cut\" and right then and there she just started asking me what I was looking for, what style and we made our way back.\nHey Salon has modest but old world charms. The television plays WNED and the pundits have their decadent political banter. Her husband must have been the one working the varnish on the floors. The place is clean and what I most enjoyed was her person-ability, her worldly knowledge about trends and what the kids are doing to look their best. I got my currently typical homage to the 1950's haircut. It was only $18 and well thats amazing for her speed and experience. I certainly encourage anyone who wants a true Toronto experience to indulge in Lina's services, if she has espresso she may even share hers with you.", "business_id": "Pumz9xgviOv3KSTXsNNtqw", "stars": 5, "date": "2012-08-12", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "n8bVVkguaX65aISnJifZmw", "review_id": "vzmlgmy4Zr2L3f2OUUiFxg", "text": "I went in this morning to get my armpits waxed. Awful experience stay away!!! I wish I would have read the reviews first.  She charged way too much and I still have hair stubles and the burning sensation has not gone away. I just hope I don't get worse. :(", "business_id": "Pumz9xgviOv3KSTXsNNtqw", "stars": 1, "date": "2016-04-09", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "ydxz85O44KBw9IwFIeUAwg", "review_id": "P_9T3MHlhLEY0IojIqHQoA", "text": "I was looking for a hair salon last minute once and went here with a friend.  I did not feel comfortable at all.  When we went in it was completely empty and there was a sign outside that said \"walk ins welcome\" so I thought it would work out well both for us to be seen immediately and to provide her some business.  She cut both our hairs, but stopped in the middle of mine to answer a private phone call for several minutes.  It was unprofessional. She apologized afterwards but it was still rude. When washing, drying and brushing our hair, she was too rough.  When it was over she said \"next time, call ahead and make an appointment\".  I could not believe it, she had no customers and yet spoke as though our business was a big inconvenience.  The salon is nicely decorated, gold and a bit extravagant.  But it put on airs just like she did.  She could be nice and conversational, but I just found her personality to be  aggressive or fake overall. For the bad customer service, the price was too high.  It was a terrible experience. n terms of the haircut, it was okay.  It was very angular, severely straight.  We will never return.", "business_id": "Pumz9xgviOv3KSTXsNNtqw", "stars": 2, "date": "2014-09-13", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "if8j9-uEiMpQ-Bq6YugCtA", "review_id": "uCPUolD1qMdtaE0IGl2IvQ", "text": "Love this place for several reasons. 1.) chill and unpretentious atmosphere 2.) good deals and unique selection for NE ohio and 3.) last but not least, the GM Margot knows her stuff. Shes a true gemologist and makes buying jewelry cool. Thanks for everything guys!", "business_id": "3Cnonn4ook40H8Pu1NeDMw", "stars": 5, "date": "2015-01-17", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "VQcFZXYBAgB3OueJMxkkTw", "review_id": "gnTi3JwwJQRbV2q4uIvIjA", "text": "THE ABSOLUTE BEST  store I have ever been to. The staff is courteous knowledgeable and kind.", "business_id": "3Cnonn4ook40H8Pu1NeDMw", "stars": 5, "date": "2016-06-10", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "OqKTl8NXc4Lt4v3BjKjCQg", "review_id": "7BNaNvnXHUoFH2svDnL2Ow", "text": "Thank you Cambridge Jewelers for working with my wife and finding the perfect vintage diamond ring and customizing it to have my daughters birthstone added to make it exactly what my wife wanted.  For anyone looking for Jewelry or have an idea for a custom piece start here!", "business_id": "3Cnonn4ook40H8Pu1NeDMw", "stars": 5, "date": "2015-10-24", "useful": 0, "type": "review", "cool": 2}, {"funny": 0, "user_id": "un8hyjksSsQVYXhq1A7WNQ", "review_id": "lofLXpJR8DMqd3eH6WtkLw", "text": "I had both my first engagement ring and wedding band custom made by Cambridge Jewelers, Jen Kline, and even though the marriage wasn't perfect... My rings were!  Platinum with diamonds. I have attached the best picture I have, as you can expect I don't have too many from the first marriage, lol, but by the photo does not even come close do doing the rings justice.  If I still lived in Ohio, they would be the only jeweler I would turn to because they strive to make the customer happy and the craftsmanship, thank you Jen Kline, is as flawless as the diamonds!", "business_id": "3Cnonn4ook40H8Pu1NeDMw", "stars": 5, "date": "2015-01-24", "useful": 0, "type": "review", "cool": 1}, {"funny": 2, "user_id": "JH7wOBMZQA2mf3C1S-h2AQ", "review_id": "w8CAfEWwUa7VtCX0vo6lFg", "text": "I like this place for a cheap, tasty bowl of Pho and some spring rolls that always are fresh and not skimpy on the ingredients. The decor is like some old whore who gave up trying long ago, and I am totally okay with that. Am I wowed when I come here? No. Do I always get the tight lipped mamasan who almost growls my order back at me? Yes. Do I always get good food at great prices, in a place I feel comfortable wearing track pants and a bandana at? Hells to the Yesss...", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 4, "date": "2008-02-12", "useful": 2, "type": "review", "cool": 3}, {"funny": 1, "user_id": "DgZO2UiUoAJQ5pw5vnJhlA", "review_id": "1cRIAZtC7ajjSsITyrHNsw", "text": "So, this place has one vegetarian entree... and I am not completely certain that it was 100% vegetarian. My dining companions seemed to enjoy their food, but I don't think I will be going back.", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 3, "date": "2008-12-10", "useful": 1, "type": "review", "cool": 1}, {"funny": 1, "user_id": "ExI15M-oXjHcF42-G1xv9w", "review_id": "dBkmZ0Ku_1gHkUqj3iWjyg", "text": "This place is solid for lunch.  Yes, it is a total hole in the wall, but that is part of the charm!  Right? I went with regulars, who ordered for me, so perhaps the menu may be hit or miss.  What I can tell you is that my meal, what ever it was, was great.  It was a noodle/BBQ pork dish.  And the deep fried spring rolls were fantastic.  And guess what was even better?  My whole meal, which was more than I could eat, was $4.50!  I will be back.", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 4, "date": "2008-10-10", "useful": 2, "type": "review", "cool": 1}, {"funny": 0, "user_id": "Az1nO4BWv3WBIu__lCvWwQ", "review_id": "563XVN7oauypuMBHNNmvKw", "text": "The \"new\" Pho Bang opened today.I was on my way to Da Vang for my weekly pho fix and I thought I'd see what was going on over there.I had a love/hate relationship with the old Pho Bang;the pho was no good,but the \ncanh chua tom and tom bo nuong vi (grill -your-own shrimp and beef) were the best in town.The shabby decor and slow service didn't put me off,and the ladies there knew me because I was a semi-regular for many\nyears.\n  The new Pho Bang is totally re-done,floor to ceiling, and now is a very modern and pleasant dining environment.I ordered my usual pho tai bo\nvien with the raw beef on the side,and an order of goi cuon (spring rolls).\n The pho exceeded my expectation and ranks with my favorites in Metro\nPhoenix(Khai Hoan,Da Vang,Dragonfly).The broth was oily and beefy like\nDa Vang,and a bit \"oniony\" like Maxim.Very flavorful and well balanced.\nThe tai was above-average in both quality and quantity.Leaner and more\nthinly sliced than Da Vang,it remimded me of Khai Hoan,sliced a bit thicker.Good meatballs too,like Little Saigon.The goi cuon was solid.\nGood size, no skimping on the shrimp and great peanut sauce.They\ndo use the poached pork,which isn't as tasty as the bbq'd pork in my\nfavorite spring rolls(Little Saigon,Khai Hoan,Dragonfly).They still hit the spot,though.\n  I'm only giving 4 stars because the jury is still out on the rest of my menu favorites,yet to be tried.Oh,one more thing...this place is Da Vang cheap!I And they open at 8:30am (hello,breakfast pho!).I was very impressed with the new Pho Bang and can't wait to go back.I hope my fellow Phoenix pho addicts will check it out!", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 4, "date": "2009-05-04", "useful": 1, "type": "review", "cool": 0}, {"funny": 1, "user_id": "5OoLuhH-ZHIre7VHGOPzbw", "review_id": "GF-QNsL7jYd8qVJmk4IuKQ", "text": "This place embodies all of the problems that can befall a hole in the wall restaurant and none of the charm.  The dining area was filthy!  The blinds on the windows where literally covered in dust and some sort of ancient splattered liquid.  Their was a television in the corner of the dining area blaring some inane program that the staff was watching.  We sat at our table for ten minutes without anyone so much as acknowledging our presence.  Finally one of my companions got up and dragged a woman back to our table to take our order.  The food came and our waitress sat watching her program for a half hour before we had to once again leave our table and pull her over to get refills on our drinks and get our check so we could leave.  I had the pho which was bland and lifeless and my companions shared a pho and a crispy noodle dish which wasn't half bad.  I would say avoid this place at all cost.", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 1, "date": "2008-10-23", "useful": 1, "type": "review", "cool": 1}, {"funny": 1, "user_id": "e--whH51bx5mDaMo3aJ-hg", "review_id": "VH8myFMBDX9TPDQwobakwQ", "text": "Love their marinated shrimp that you grill on your table.  Then take it, along with fresh Vietnamese veggies and wrap up to make your own rice paper roll (or summer roll).  Delicious!!!\n\nGood pho too.  When I still ate meat, their grilled pork chops over rice was sooo good.\n\nGo there with a group so you can order lots of dishes to try.\n\nService can sometimes be slow---not the place to go for lunch if you're in a hurry.  The wait staff mean well & are good people.", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 5, "date": "2008-10-12", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "IKJANPEhzge5nQ1TwzkueQ", "review_id": "2G7KBfOSDWyh_f0Vefbm9w", "text": "ALERT !! ALERT!\n\nPho Bang is now Pho THanh. The only thing that I had here was Banh Mi. So far it  is very good but it takes forever!!! There  are too  many waiters and not enough cook. \n\nI don't know if this is true anymore but waiter from this restaurant does not get tips, the owner takes it all. That's the price waiters here pay for getting paid under the table.", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 1, "date": "2009-07-21", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "5YmebJqh7Wd-g3Bh4-vvmA", "review_id": "tAtsxpcQ_TDS-DUkxSReqA", "text": "It's crazy, but I could live on the greasy fried rice and spring rolls from here for about a month or so. If I kept cash ready, and smiled into the face of scowldom on the other side of the counter, that is. I once tried to debit my $4.36 bill and thought I met the Soup Nazi. I don't care, it's addictive. A little lightrail construction should not stop you. Bring cash if ordering under $5 and don't look around if you don't like 'greasy spoon' kitsch. Fried rice.... mmmmmmmmmmmm.", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 3, "date": "2008-02-26", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "FrTbdArfBQsmWWqdNKR5dw", "review_id": "h21b2s56qJryLlVsoW3LAw", "text": "Yeah. The place could use a once over with oxyclean, but the yummy food makes  up for the charming patina on the floor and walls. One of my favorites is the rice noodles with grilled pork, sprouts and crispy spring rolls on top. Comes with this sweet and sour sauce stuff you pour on top. Perfect light summer lunch. Also, the pho is a nice bowl of goodness. Squirt some hot sauce and hoisin on that and that is a perfect meal. Remove any eyewear to prevent steamage.\n\nBonus is the Vietnamese market next door. After lunch you can stock up on Botan Rice Candy, steamed buns and reasonably priced dishware.", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 4, "date": "2008-06-25", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "oaaEXgQ3x51cXE3GTXrT1Q", "review_id": "3gW9PmJSmCI8fIGjZcsIHg", "text": "My father died of cancer in 2002 after a 7 year struggle... when he could still get around (and even when he couldn't), we would regularly go to Pho Bang to eat together. The owners were sweet and would always ask how he was doing when I would go in by myself. I've been eating here for over a decade and the place hasn't changed one bit... they haven't replaced one thing. It's old and as the other review said - shabby. The owners are very sweet, but most of the customers they get are local and speak Vietnamese. \n\nI have to say - this place has the best spring rolls of any vietnamese place I've ever eaten at. This is the main reason I still eat here... the food is still very delicious. It's really rough finding decent asian cuisine in the Phoenix area. Specifically Korean and Vietnamese. \n\nIf you can overlook the unwelcoming ugly old appearance and you aren't intimidated by the scary neighborhood and locals-only attitude - the food is delicious. I'd give the food 4 stars and the family that owns it have always been so sweet to me and my dad. I just wish they would relocate or fix the place up a little bit. It once won the Best of Phoenix - but that was a long time ago... at least the food is still the same as it was back then.  Give it a try if you're brave enough.", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 3, "date": "2007-09-13", "useful": 3, "type": "review", "cool": 0}, {"funny": 1, "user_id": "Yej5B4nd8PqpHMQcmCTDrg", "review_id": "qqQuf7oG7EZaSxRMEVvuTA", "text": "It's a bit of a hassle getting into the restaurant's parking lot these days from light rail construction.  But that's probably just as well.  I'm not in a hurry to get back to Pho Bang -- so no biggie.\n\nSome respectable ethnic eateries aren't much of a looker when it comes to decor.  No surprise there.  But Pho Bang takes shabby and RUNS with it.  The floors are worn, and so are the classroom-like ceiling tiles.  \n\nWhen I walked in there was no greeter, or anyone around to direct you to a table.  I later see that two little old ladies were running the ship in what became clear was a family operation.  Since I wasn't sure about seating protocol I walked to the back counter where it looked like one woman was counting the cash register (it was only 7 pm).   She looked at me all confused and flustered.  \n\nIt wasn't that busy either.  Two tables in particular were messy upon my arrival - and were for another 20 minutes after that. \n\nI was finally sat at a table near their Best of Phoenix awards - all four of them.... from the late 90s!   Figuring that many Vietnamese places have popped up in recent years to make it more competitive - I didn't think much of it.  I noticed on the menu that Pho Bang is a chain with locations in Manhattan, Dallas and Houston - who knew?  \n\nI place my order of shrimp summer rolls and pork and veggie vermicelli noodle bowl and assess the scene - 3 tables at about 6 -10 mostly Asian and Hispanic people (some family, and some friends) each dining and laughing. \n\nTo make the atmosphere even more sketchy than when I arrived,  I notice this grey moving cart that was wheeled from table to table.  Servers here don't clear the table and take the mess to the kitchen - they just dump it in a cart and wheel it all over the restaurant until closing.  Nice, unsavory, and klassy.\n\nMy food arrives and the summer roll and dipping sauce tasted alright.  The roll was heavy on the mint leaves, but otherwise it was OK.  The noodle bowl was OK too.  Nothing to write home about.  The one I've had at a Vietnamese place in Chandler was much more flavorful.  I'm not a soup person so I'm not sure how the pho is.\n\nSo, there you have it.  An average food experience coupled with unsavory ambiance and so-so service.", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 2, "date": "2007-06-05", "useful": 4, "type": "review", "cool": 4}, {"funny": 1, "user_id": "a0PKxg11MMpwn6s8--5-ww", "review_id": "K2dKdtYu6yDt1203WiiNdg", "text": "I'd been here about three years ago... maybe under different management. But when I went again this past week there was nothing left of the good memories from the previous visit: Indifferent service; mediocre food; and it wasn't even cheap. I'll not be going back.", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 2, "date": "2009-03-10", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "nSlsIBTgWkhmRKJfu3vgAg", "review_id": "86bp7My3vg4OykbZaCnJ0w", "text": "After looking many a place for a nice new bookshelf, my husband and I found this place. This place is awesome (and smells phenomenal too), nothing beats real wood.\n\nThe owner, Michael, was very helpful. He looked up a few styles for us and told us exactly what to expect for each. We ended up deciding to buy a bookshelf that was in store instead of having to order it. They delivered it to us and even exceeded expectations and got it there same day.\n\nAll-in-all, a very friendly place to get some sweet furniture. If and when we need any furniture in the future, we will be coming here again.", "business_id": "-Lw3SAntwmG47xRoufGzfw", "stars": 5, "date": "2015-03-21", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "W3qxpz4lZ-hXN5jVURfCBQ", "review_id": "0USUUXyGf-Dve9g2LYzuGg", "text": "Gordon came out to fix my dripper system and replaced a value in the backyard.  However after his visit water began pooling in the front yard at the side of my house and when he returned Monday to look at it refused to fix the issue stating he didn't do it Then proceeded to leave saying he \"pittys my husband.\"  Which I found highly unprofessional on top of being deceitful.  Do not use this service seems like he purposeful did something to my system for more money.", "business_id": "5FBVPdHXYNHk7Pzop3h4Uw", "stars": 1, "date": "2015-06-15", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "YNpAPZjbfM3Xs7mXjj0ytw", "review_id": "bgfi22eFvDjM2DjS53Uwww", "text": "Had good reviews so I was excited to use Gordon. he fixed my Pressure regulator 50$ cheaper than another company quote. When I checked his work, a valve just a few inches from the regulator was now dripping. i called to make him aware- he became quickly defensive and denied he had anything to do with it- then said \"just dont pay me.\" I said; I called to ask if you are coming back to fix an issue that was not an issue prior to you doing your work.\" He said, \"I didnt have anything to do with that so just dont pay me and call someone else.\" -then hung up on me. I had every intention of paying him IF he fixed his mistake, shot himself in the foot by becoming defensive and angry to a customer so fast.", "business_id": "5FBVPdHXYNHk7Pzop3h4Uw", "stars": 1, "date": "2016-08-05", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "rhE4gLtM0gb3XLwSz6HPCw", "review_id": "GqVWan0oE8p6zJm54uHgGQ", "text": "Gordon has worked on my crazy sprinkler system at my house several times now.  He replaced a broken timer, extended my sprinkler layout and disconnect a leaky set of heads that were unused in my front yard. Excellent service and very reasonable rates.  I highly recommend him.", "business_id": "5FBVPdHXYNHk7Pzop3h4Uw", "stars": 5, "date": "2012-08-22", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "e3QjvzdsMaTRLZ9lVZYzeg", "review_id": "dxIilBT9NGk2UdTQW_CMEA", "text": "Ich kann nur die schlechte Bewertungen bestätigen. Ein geschmackloses cappuccino und eine Cola für 8.30 EUR. Beim St. Mark Platz in Venedig wäre es billiger gewesen.", "business_id": "3Ca0qUk3X5dVGlk79w40hw", "stars": 1, "date": "2013-01-14", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "001hGTbZBshxc4y7rokYpA", "review_id": "fFdMTd_mBzZBGJ9PCODvxw", "text": "Ich vergebe wirklich ungern Bewertungen mit einem Stern, aber was ich hier erleben musste geht einfach zu weit.\n\n\n Im Gate-Bereich eines Flughafens erwarte ich wirklich keine kulinarischen Highlights, aber mich für bei hohen Preisen und mieser Qualität auch noch schlecht behandeln zu lassen geht einfach zu weit.\n\n\n In Stuttgart gibt es hinter der Sicherheitskontrolle eine Trattoria die neben einem Tresen auch einen \"Restaurant\" Bereich hat. Der Betreiber ist die Autogrill Deutschland GmbH (so steht es auf der Rechnung).\n\n\n Der Restaurant Bereich ist von Kübeln mit Grünpflanzen umrahmt. Einziger Eingang ist zwischen dem Tresen und einer Säule. Mitten im Weg steht ein großes Schild, dass ein \"Willkommen\" heuchelt. Mitten im Web bedeutet, dass sobald dort jemand am Tresen sitzt diese eigentlich aufstehen muss, damit der Gast da durch kann... ich bin nicht besonders breit gebaut :-)\n\n\n Schon mal sonderbar und etwas dämlich.\n\n\n Mein Flieger ging um 20:00 Uhr und ich war ca. 30 Min vorher dort. Fast alle Tische waren nicht mehr eingedeckt, nur noch ein Tisch genau am Rand zum Tresen und zur \"Einflugschneise\" des Personals. Gar nicht schön. Ich wollte gerne am Rand sitzen, wurde aber pampig aufgeklärt, dass da nicht mehr eingedeckt wird - wir schließen gleich. Aha... Abendessen am Abend ist nicht vorgesehen .... hmmm\n\n\n Die Karte lässt nichts guten hoffen. Diverse Sorten Nudeln zu kombinieren mit diversen Soßen. Einige Salate. Die Preise erwartungsgemäß hoch. Nudeln Spagetti Carbonara 12,50 Euro. Ein Glas Wein 0,2 für 7,50 Euro. Ach nee die Tüten für die Mikrowelle mit Spagetti waren ja schon alle :-/\n\n\n Leider war die Qualität der Nudeln mit Sonderbarer Soße dann auch noch so schlecht, dass ich nach Käse fragte. Mit einem \"da haben Sie aber mal Glück gehabt\" Kommentar bekam ich das mühsam gesuchte letzte Rest Schälchen mit gehobeltem Plastik. Zum Geschmack hat dies gar nichts beigetragen. Nur mächtig Pfeffer und Salz konnte noch Geschmack an das sonderbar anzuschauende Mahl auf meinem Teller bringen.\n\n\n Am Ende hab beim Bezahlen mal aus Neugierde gefragt, ob es noch einen Eingang gibt, den ich übersehen habe... nee wieder eine recht flapsige Antwort und die Frage, ob ich an einer Umfrage teilnehmen möchte, da kann ich das dann auch drauf schreiben...\n\n\n Ich tippe der Zettel ist in den Müll gewandert, ich war an dem Tag echt sauer... zum Glück gibt es Qype. Wer am Gate was will, sollte unbedingt die anderen alternativen probieren.\n\n\n Ich kann nicht verstehen, dass der Flughafen einen solchen Pächter duldet.", "business_id": "3Ca0qUk3X5dVGlk79w40hw", "stars": 1, "date": "2010-09-16", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "Xtt3QEGFoL48l9UOH8pf6g", "review_id": "MSo1Xn_-7Xa4xMVEqHd6Rg", "text": "Teuer, dreckig, unfreundlich. Echt nix, aber auch garnix positives.", "business_id": "3Ca0qUk3X5dVGlk79w40hw", "stars": 1, "date": "2012-01-19", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "Blcn4w4hpVWN0-p6w6S1cw", "review_id": "x36q7cbLsxkLX-gyCaDbeg", "text": "Allgemein\nAsia Wok hat von 4 Tagen geöffnet. Es befindet sich in den Räumen der Eintracht. Die Einrichtung wurde renoviert. Das Essen war überraschend gut. Es war frisch, ideenreich und differenziert im Geschmack.\nEmpfehlenswert sind die vietnamnesischen Spezialitäten auf der Speisekarte.\nLiebe Eintrachtbesucher, das Essen ist nicht schwäbisch, aber trotzdem frisch und gut.\nBedienung\nDie Bedienung war eine Vietnamnesin. Sie war sehr bemüht und in ihrer Aussprache lustig, weil Sie am Ende immer das \"s\" weglies. Dafür kannte Sie sich aber sehr gut in der Zubereitung der Gerichte aus und war mit uns Unwissenden geduldig.\nDas Essen\nEs war sehr gut. Besonders die Vietnamnesischen Speisen waren gut. Ich hatte Ente auf einem Salat/Gemüsebett. Die Soße soll auf Fischbasis gewesen sein, das hat man aber nicht so geschmeckt, weil Zitronen-Verbene, Chili und etwas Süßes beigemischt war. Alle Soßen waren sehr gut, manche auch richtig, richtig scharf.\nDas Ambiente\nMan erkennt noch das alte Eintracht Ambiente und aus einem Altstadthaus macht ein Mieter trotz neuer Tische, Stühle und Renovierung keinen Palast.\nSauberkeit\nDas Lokal war neu eröffnet und damit natürlich auch sauber.", "business_id": "3uywq0g18yVP8-ccl4Zoqg", "stars": 4, "date": "2014-08-05", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "nbYOs5r6z_kQ6y61tPb58A", "review_id": "R4y26dnhBftfwCsp5Vp4Bg", "text": "Allgemein\nWir waren auf der Durchfahrt und hatten Lust asiatisch zu essen, auf die Schnelle. Dieses Restaurant hat uns sehr gefallen. Wir wollten ja nur \"auf die Schnelle\" essen, aber so haben wir es gar nicht empfunden: Gemütliche, mit Geschmack renovierte Gaststube, freundliche Bedienung und 2 Nudelgerichte mit frischem Gemüse und Kräutern. Und eine wunderbare Gemüsesuppe davor! Und alles sehr preiswert.\nBedienung\nWir wurden freundlich und gut bedient. Mit uns waren drei weitere Gäste anwesend, die das Lokal z.T. gut kannten und öfter besuchten. So hat uns ein Besucher gleich über seine Lieblingsgerichte berichtet.\nDas Essen\nZunächst waren wir überrascht, auch mißtrauisch, wegen der großen Auswahl auf der Speisekarte. Wir haben zwei vegetarische vietnamesische Nudelgerichte gegessen, einmal Reis-, einmal Glasnudeln. Beide haben mit  frisch zubereitetem Gemüse und Kräutern sehr lecker geschmeckt. Preis 7 €. Sehr gut war auch die Gemüsesuppe davor!!\nDas Ambiente\nGemütlich saßen wir in dem kleinen Lokal, das neu renoviert wurde, aber noch den Charme und das Mobiliar der traditionellen schwäbischen Wirtschaft besitzt. Das asiatische Dekor passt gut dazu!\nSauberkeit\nDer Gastraum ist sauber und gepflegt.", "business_id": "3uywq0g18yVP8-ccl4Zoqg", "stars": 5, "date": "2015-01-02", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "hqDmsR5UnqGw3FcOUMdjYw", "review_id": "NHE-7qSVoewn1CYvGAP2dw", "text": "Allgemein\nFamilienessen am Sonntag. Bei sehr unterschiedlichen Geschmacksvorstellungen und Ernährungsstilen hat jeder etwas gefunden, dass hervorragend schmeckte. Wir kommen gerne wieder! \nBedienung\nDie Bedienung war sehr freundlich, sehr aufmerksam und hat alle Wünsche erfüllt.\nDas Essen\ndiv. Vorspeisen und Hauptgerichte, auch vegan, knackig frisches Gemüse und Kräuter, sehr gut abgeschmeckt, vielseitig und a. Wunsch alles ohne Geschmacksverstärker\nDas Ambiente\nangenehmes Ambiente, geschmackvoll den gegebenen Räumlichkeiten angepasst, frische Blumen", "business_id": "3uywq0g18yVP8-ccl4Zoqg", "stars": 5, "date": "2015-02-08", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "fPrnpzgDgVppX_iPCLZbvg", "review_id": "NCWBIvixUpGHv5trI3c-Aw", "text": "I was on an extended vacation in North Carolina when I started having unbearable pain in my lower jaw. I saw a dentist out in a rural area, who told me I had an impacted wisdom tooth, but said he didn't feel comfortable extracting it. After toughing it out for about a week, I couldn't stand it any longer and started calling every oral surgeon in the Charlotte area to see who could take me within 24 hours. Dr. Marashi's office got me in for a consultation the same day, I believe, and scheduled the removal for the next morning. I opted for full sedation, even though it wasn't going to be covered by my insurance, because I just wanted to get it over with in the easiest possible way. \n\nThe day of the visit, everything went great. He and his staff were calm, professional and welcoming. He handled the IV sedation himself, and I didn't feel a thing. One minute, I was lying in the chair in excruciating pain, and the next, I was in the recovery room, and it was all over. He sent me home with detailed instructions, some prescription pain medication, and an antibiotic. I used the pain medication the first night, and then was able to switch to Advil the next day. I had some tenderness in the area, but absolutely no facial swelling or bruising. \n\nSo why not five stars? Because Dr. Marashi was supposed to call and check on me that night, and he didn't. He also didn't return my call when I left him a message about a concern I was having (which turned out to be nothing). Is that a huge deal? No, but it made me feel like I received a lower standard of postoperative care because I was a one-time patient from out of town. \n\nAnother reason for the four star review: when I got back to Chicago, I started experiencing pain around the area where the wisdom tooth had been removed.  I assumed it was a dry socket issue, but my dentist discovered that I had an infection and significant bone loss in the molar adjacent to the site of the wisdom tooth removal. He thought it was possible that the pain I had been experiencing in North Carolina had been caused by these issues, and not by the wisdom tooth. After battling several infections in the molar, and months of pain, I ultimately had to have that tooth removed, as well. Maybe Dr. Marashi was aware of these issues, but he didn't think they needed to be addressed right away. Or maybe he didn't notice it at all.  To be fair, I told him that I had an impacted wisdom tooth when I came in for the consultation, so he was probably just focused on that. \n\nThose frustrations aside, I would go back to his office in a heartbeat if I ever needed oral surgery in the Charlotte area again. Dr. Marashi has a very calm and professional demeanor, which means a lot when you're in pain and you just want someone to take care of you. His staff was also very kind and comforting. And after all the horror stories I had read about wisdom tooth extraction, I was truly shocked that I had no swelling and such minimal pain. So, all around, a good experience.", "business_id": "08JADvUBOgE5WSh3hGgBhQ", "stars": 4, "date": "2011-01-08", "useful": 1, "type": "review", "cool": 0}, {"funny": 1, "user_id": "ZvmC522FAwxt8qT1jxqliw", "review_id": "Kk6P9--JRCvQw1eJtUY4Dw", "text": "I hope never to need the services of an oral surgeon again, but in case I do I feel better knowing of Dr Marashi. The Doc's calm competence with the help of his super nice staff transformed what was an inherently painful and \"let me out, I'm freaking out\" situation into a mildly unpleasant but bearable experience. \n\nI'm not going to pretend that having tongue surgery was \"fun\" but under the circumstances I could have not expected better.  Thanks", "business_id": "08JADvUBOgE5WSh3hGgBhQ", "stars": 4, "date": "2013-05-07", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "aDYNz8cujkDdmbiOh95ANA", "review_id": "oAsOvdtzlBCxjtWJknp0vQ", "text": "When my daughter needed to have her impacted wisdom teeth removed, we were referred to Dr. Marashi by her Orthodontist.  We were very pleased with the level of care she received. Because my daughter suffered from asthma, Dr. Marashi recommended that the procedure be done at CMC-Pineville instead of his office, just in case she had a reaction to the anesthesia or had problems breathing.  The pre-op and post-op care was was very good and thankfully there were no problems during the procedure.  The swelling afterwards was pretty minimal considering... and she had no bruising and no other issues.  We both felt that Dr M and his staff were very professional, helpful, and friendly.  I would definitely recommend him for anyone needing a good oral surgeon.", "business_id": "08JADvUBOgE5WSh3hGgBhQ", "stars": 4, "date": "2012-02-04", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "XJWeIpI1BRRuOogFqtsXjQ", "review_id": "eFvqHxhPzutKIuPxEzdHlA", "text": "I hope to never have to go back to an oral surgeon again. But if I have to....I certainly know where to go! I was referred to Dr. Marashi by my dentist Dr. Ostrow to have all 4 of my wisdom teeth extracted (and 2 were impacted). I was so scared, but Dr. Marashi put my mind at ease as soon as I got in his chair! Here is my breakdown.\n\nPros: \n\n1) He is very professional and courteous. He takes the time to explain to you what is going to happen and how it is going to happen. There are no surprises. You are well prepared by the time you get in the chair. \n2) I chose the sedation because I was a wimp and very scared. It worked great. I have a medical condition, so I could not be sedated 100%, but to be honest it didn't matter. I felt fine and comfortable. \n3) Dr. Marashi is very personable. When I got in the chair he talked to me about movies and what I did today. Honestly, we were chopping it up like we were old homies. \n4) He is on time. \n5) He checked in on me on the evenings after I had surgery. He personally called me to make sure that I was feeling okay. Now that is first class service. \n6) He is cute too! \n7) No pain! I did not have any pain whatsoever after my wisdom teeth extractions! I even went out to eat at the Olive Garden and had a full meal afterwards (and 2 of my teeth had to be cut out)! \n\nCons:\n\n1) He doesn't take insurance, so you do have to pay for the surgery! But who really deals with insurance anymore??? It's worth it to pay for his services.\n\nBottom line: I can't recommend this guy enough. I don't want to be put in a position where I need oral surgery again, but if I do I am going to Dr. Amir Marashi!", "business_id": "08JADvUBOgE5WSh3hGgBhQ", "stars": 5, "date": "2014-07-04", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "Ioq5kgGOSLFV6E2QE705mQ", "review_id": "TZ4IsTnfVIPWRLvQHMH1KA", "text": "I've been here twice. Once was late at night about an hour before store closed and\nTwo sales women where still on. One appeared to be avoiding me so she could get her work done and leave for the night. I get it I've worked in retail before... Sad thing is that this is how it is everywhere and not only at closing time. Big corporations really don't seriously care about the consumers experience just enough to appease for desired profits.  Mind you I don't have the highest opinion of employees also, I think too many are not grateful for having a job and lack professionalism. The other sales women was extremely helpful, she identified herself as a manager. She took some time to answer some questions and help me get what I needed. This is much appreciated and lead to visit this store again today.\nToday two sales women were on the floor and quite rude. One at cutting counter griped behind customers back as she went to look at tracing paper near counter. Really? Boy I can't wait till you gripe\nAbout me while cutting my fabric. One was at cash out. She was just too cool and was curt with polite small talk for everyone in front of me and me to.  She had the attitude \"it's us against them\". Made me feel like saying, \"hey, I just spent $25 bucks in your store\", \"I just helped YOU keep YOUR job by giving this store a sale\"!!! Hence two stars. Way to go Joann's. I'll drive out of my way to go to another store next time.", "business_id": "EVcYmgGgO1ZVi1raaG8SpQ", "stars": 2, "date": "2014-10-10", "useful": 2, "type": "review", "cool": 0}, {"funny": 2, "user_id": "zPNgvx8y9_-G-Y_nGHS_IA", "review_id": "UnymUnNT9Tn3bbRIw00HKA", "text": "Never have I seen such unhappy employees! I also work in retail and I would never treat my customers as an inconvenience to be in my store. Sighing in front of customers because they brought a discount printed out from the store website is beyond terrible customer service.", "business_id": "EVcYmgGgO1ZVi1raaG8SpQ", "stars": 1, "date": "2013-07-21", "useful": 1, "type": "review", "cool": 0}, {"funny": 2, "user_id": "LPXQ4i57bfVSoHLQFe-VnQ", "review_id": "b914APAW2CWHMhH-p5-J3w", "text": "This is the WORST JoAnn's I have ever been in!  Everything is complete disarray -- looked like a tornado had just gone through. Their inventory was minimal at best.  Walmart has a much better selection of yarn, fabrics, beading supplies.   This place was like ghetto!!!!!!", "business_id": "EVcYmgGgO1ZVi1raaG8SpQ", "stars": 1, "date": "2013-10-23", "useful": 2, "type": "review", "cool": 0}, {"funny": 0, "user_id": "CPVlcRPqrj5mOJHynvflVw", "review_id": "c6S9T1ZRTBKUXQn42Dli3g", "text": "Just finished having a 1 hour massage here and Sammi is just lovely! I was a walk in but she was still willing to accommodate me. \n\nThe massage itself was great! I was having some soreness in my shoulder and I could really feel her working out the knots. \n\nI would definitely recommend this place to anyone interested! They have a special packages for multiple massages/facials/etc.", "business_id": "6rLkU3ztvY4OcY6DMXFiVA", "stars": 5, "date": "2015-01-19", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "m7z-tX6XDZ27xGhGjnI21w", "review_id": "kndnpitSqgstH8vSw0stxw", "text": "What a pleasant surprise! A Groupon featured spa that was better than expected! \n\nIt was a bit difficult to find at first since they're located in a relatively new plaza, so I was around 15-minutes late. The owner was very nice, and allowed me to take my time to get ready for the massage. The interior was spotlessly clean - the washroom paper towels were freshly laid out and there was not even signs of water spilled around the sink. \n\nThe massage was also one of the better ones I've had. My masseuse, Mika, was very skilled in finding the knots in my shoulders and spent quite a lot of time trying to loosen them up. I felt bad, because I could hear her stomach growling as my appointment was at 6PM. I almost fell asleep near the end, as with most massages, this one ended too quickly. \n\nI will be back! Hopefully they will have more deals in the future!", "business_id": "6rLkU3ztvY4OcY6DMXFiVA", "stars": 4, "date": "2012-12-14", "useful": 3, "type": "review", "cool": 0}, {"funny": 0, "user_id": "2K8GAYdC_nIDvThehpwQ9g", "review_id": "PrahhET_2e_hgGv5yc9zqw", "text": "WOW! What a pleasant surprise... This place is a hidden gem.\n\nI found a deal for a Facial on Groupon and it turned out to be one of the better facials I've had... for 1/3 the price I normally pay. \n\nThe spa is difficult to find but great once you arrive. Very friendly and professional staff, calm and quiet environment, and my skin was left feeling fresh and literally glowing after the treatment. She also gave me a 10 minute shoulder massage while the mask was on - something that other places would leave you in the room alone.\n\nI would highly recommend this place! I've bought 3 more facials and I'm looking forward to the next one.", "business_id": "6rLkU3ztvY4OcY6DMXFiVA", "stars": 4, "date": "2013-11-22", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "K7Ah2cRn13NojszG0keJew", "review_id": "bsSujVvohgp2_KLPbs0G0Q", "text": "I had a very good deep tissue massage with Erica yesterday.  She was very professional, she did a very adequate deep massage.  Only issue was that it was all back, neck and shoulders and did not do legs.\nStill it was very worthwhile", "business_id": "6rLkU3ztvY4OcY6DMXFiVA", "stars": 4, "date": "2014-06-19", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "yGFRQFQeZ0Np97zgPwEt8g", "review_id": "FZpmN0gzgqosGbPgw1O2eA", "text": "average environment and services but the staff who gave me a facial was sneaky and rude. throughout the treatment, i warned her about my extra sensitive thin skin but she still gave me a harsh facial scrub and massage, my face was horribly red, hot and discomfort because of her, yet she didnt even feel sorry. i was the one who requested to have some ice to cool down my face but that didnt help much either. as i left i looked like i had \"asian flush\". not recommended at all.", "business_id": "6rLkU3ztvY4OcY6DMXFiVA", "stars": 1, "date": "2014-08-26", "useful": 0, "type": "review", "cool": 1}, {"funny": 0, "user_id": "n6xzxbSSr6dJ0KRIx8GOfQ", "review_id": "Nsh9CbrgZanGoM1aX1P6hw", "text": "I found this spa on groupon. I was a bit leery so I checked out the reviews on here before buying it. The reviews are accurate. The spa is spotless and has a great ambiance. The staff are friendly, patient, and give you your money's worth. My masseuse did not rush any part of my appointment. She was very thorough. I will definitely be returning!", "business_id": "6rLkU3ztvY4OcY6DMXFiVA", "stars": 5, "date": "2014-05-12", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "XWeQPpiiRvswNVPuaG5HCw", "review_id": "LpEqcTo3BUpkMmjWB1o9Ww", "text": "Went here today for a deal I Found oh groupon.. BTW you don't need a voucher to get a 60 min massage for 39 dollars.\n\nThe masseuse was great, I think her name was Cindy. She was attentive and didn't rush through it. She also took the FULL hour to do the massage. The facility was clean and well kept. Her English is not that great but she gave a relaxing massage. I'm always a little iffy about most massage places but this one was legit!\n\nCan't complain for the price, well worth it.\n\nCheck it out!", "business_id": "6rLkU3ztvY4OcY6DMXFiVA", "stars": 4, "date": "2013-05-09", "useful": 1, "type": "review", "cool": 0}, {"funny": 1, "user_id": "PhEpbB9cRdauHwoeqLa3Rg", "review_id": "tkjpIBIiR8j0CVx0kT4zFg", "text": "after living in this city for several years i finnaly gave this place a try.  i wish i didnt.  the food was just a greasy slob of mess.  i got their burger, the \"famous\" one that they are know for.  bleh.  oh and the girls dressed like strippers before the song starts is really not appealing.  if you wear white tank tops, have a mullet, enjoy coors light out of the can, then this might be your place.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 1, "date": "2010-01-27", "useful": 1, "type": "review", "cool": 1}, {"funny": 1, "user_id": "BIBtrVhWLdCvM5D-qCzaWg", "review_id": "ZKgsKIKQHE7k7RZhiOKNxQ", "text": "Okay, let me just say first off that most people are way too hard on this place. If you want posh atmosphere, shiny silverware and craft beers go to Delux (it's a couple miles away people). This not the place you go to for a date (unless your girl is cool like mine) or take your parents when they come into town, although mine would love it....\n\nWe all know it's a gimmick and I'm fine with it as I have no qualms about being served a tasty burger by a scantily-clad co-ed. The burgers are monstrous! I prefer my double with just onions and cheese with chili cheese fries on the side and that is just plenty for me. The bread is tasty and thick enough that your fingers don't go through it when you take a big bite. This is more than I can say for many \"gourmet\" burger places I have eaten at. The meat is always just the way I like it  and that is key for me. I am an unrepentant carnivore!\n\nA couple of people I know have complained that the burgers taste a bit like meatloaf and once again....I really don't care...\n\nI'm a giant beer fan and can absolutely enjoy the best you can find but this is not the kind of place I would be looking for that. This is an unassuming and  chill place to kick back with your friends and not feel bad if there is mud on your boots. I say enjoy your PBR and burger outside and feel free to wipe your hands on your jeans. The staff really don't care if you do and I like that", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 4, "date": "2010-01-23", "useful": 0, "type": "review", "cool": 1}, {"funny": 0, "user_id": "QHQ0y71kVDMBKvrq4OGsQQ", "review_id": "JHjpWkRN9yDFCtiYRJQldQ", "text": "Wow, I didn't realize Yelp was full of people lacking humor and personality. Get a fucking grip people. It's a small shack with neon Miller Light signs. Did you expect micro brews and the waitresses to have on black dresses, pearl necklaces and heels? A wine list perhaps? \n\nAs a few reviewers mentioned, this place is a gimmick. If you want the latest hipster food trend you read in Food & Wine all the time, go for it. If you want gourmet burgers, that's fine too. You can even eat at Ruth's  Chris or Morton's every night. \n\nThere's nothing wrong with any of the above of course, I've been to Ruth's Chris, Union Trust steak house in Philadelphia, I enjoy Fogo de Chao every once in a while, but sometimes, just sometimes, you want to just say fuck it and have some light-hearted greasy (see that?) fun and a fucking beer to wash it down.  \n\nThe only thing I can possibly relate to is if you did not expect the girl's to be dressed the way they are and you brought your family with you. Other than that, you folks need a reality check.\n\nPS: They offer a LE/military discount probably because the owner of the place \"gets it\". Damn shame they closed up.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 3, "date": "2011-04-15", "useful": 1, "type": "review", "cool": 0}, {"funny": 1, "user_id": "DCwQNY0Aj2Zip9vf2M9z3Q", "review_id": "uuH9_LSRBoYdLXxZO5YaAw", "text": "I didn't think my burger was very tasty. It was big, but not delicious. In fact, the meat reminded me far too much of a really thick Burger King patty. It just didn't do it for me. I was into the idea of a big, tasty burger, and it left me full but dissatisfied. I honestly wouldn't eat there again. Surprisingly, if the burger were better, I would not mind the cheesy gimmick so much.\n\nThe girls. Well, I've never been to a strip club but I hear that the girls at strip clubs love it when women come in. Probably because they're sick of being pawed at by the creepy dudes that likely frequent a place like this. There is a strip club caddy corner (is that even right?) from the place. I wonder if there is any correlation to the crowd at this place. So my point here is that the girls were nice, and flocked to me as a the sole female patron in the place. They were super sweet and pleased to talk to someone that wasn't checking for a nipple or a free glimpse of the cootie. \n\nThe location. Good. Parking fine. It's small. It's a rennovated Jack in the Box. \n\nBasically, a let down. I had hoped that a place that clearly wants to drawn in the male crowd would do so with a combo of hot chicks and good burgers (with limited veggies taking up valuable real estate on the bun). But no, they just went for the hot chicks. So if you go, don't expect more than nice girls serving gigantic Burger King quality food.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 2, "date": "2009-02-06", "useful": 0, "type": "review", "cool": 0}, {"funny": 2, "user_id": "nwea88g4mZpv_nD6AcLBbg", "review_id": "1ew7zePLw5m0sXHe4FTZEA", "text": "Holy Jesus this place is awesome....\n\nNever before in my life have I been to a restaurant where we sat down for ten minutes, were the only people in there didn't get served and left....\n\nI have also never been into a restaurant that made Hooters look like a place I would be comfortable taking my grandmother.\n\nThe long and the short of it.....if you like anorexic big fake boobed ugly cocaine sniffing waitresses begging for your tips serving you you will probably love this place.\n\nIf you like tables that look like they havent been wiped with anything other then a damp cloth this decade to eat off of you will love this place.\n\nIf you like food that smells like a used diaper filled with hot dogs and indian food you will love this place.\n\nIf you like all of the above at prices that are double the going rate of any other similar restaurant you will love this place.\n\nWe saw the big PBR sign and it had a clever name and we pulled over to try it....I will never make that mistake again.\n\nI do not love this place.....at all...... even a bit.  We couldnt stomach even trying the $6 hot dogs (with out fries and Oscar Mayer brand that you pay $3 for 8 at the store)\n\nOverall don't bother.....this place sucks.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 1, "date": "2010-10-10", "useful": 1, "type": "review", "cool": 0}, {"funny": 2, "user_id": "B--5Ih8GxneIQNSuHTnwUA", "review_id": "gGsVTJFcR93Zp3uIBC9GaA", "text": "This place is really foul.  If Hooters was full of meth heads and had inedible food, it would be this place. \n\nMost of their waitresses come from the strip joint across the street and while that should be a plus unfortunately they have the attitude that goes with the \"people pay me to shake it\" profession.  And keep in mind this isn a grade a strip club.\n\nThe burgers taste gamey, which i didnt think was possible with beef.  The menu is limited, the beer list has 2, maybe 3 beers, and the only saving grace is if you're walking around and really want a coke in a bottle.\n\nIt was a decent idea when it was heart attack grill and they all dressed like doctors, now it's just an extension of the strip club w/ a menu to match.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 2, "date": "2009-07-21", "useful": 3, "type": "review", "cool": 1}, {"funny": 0, "user_id": "Jwl_Z1zF1Aa9GNE6BkrBZQ", "review_id": "bqpceQfEFdnImetTSCclew", "text": "Ive only ever been in here for a hot chocolate and cake, but I loved it! The cake was so nice as was the hot chocolate !! Very nice wee cafe and even though its small has quite a few seats! Nice people, and theres always 2 or 3 different cakes to choose from each day", "business_id": "1UGlEnkVHXelTT7qaBCZOw", "stars": 4, "date": "2015-01-04", "useful": 0, "type": "review", "cool": 0}, {"funny": 2, "user_id": "Ga9DnmdmhE0Zzs_jRtmrfA", "review_id": "O0Wq4lDapC3CQBx6P846Lw", "text": "'Restaurant' is a generous label for Annabelle's, it's really a café, and a small one at that. Normally absolutely packed in the late morning / early afternoon by geriatrics, I can imagine this being a perfect place for a cup of tea and a good reminisce for them. Unfortunately, if you are not quite at bus pass age then you may find it a bit dull for your tastes. There is little atmosphere and it can be a bit uncomfortable when everyone else is a good 50 years older than you.\n\nThe food is good, but I honestly cannot see how they can justify the prices. There are the standard scones and cakes and all you could want for afternoon tea, as well as a few different sandwiches and pasties / quiches. But all of them are horribly overpriced. Maybe if you are a pensioner that has saved a bit of money and are happy to pay more for the better quality food (which cannot be argued), but seeing as Annabelle's is located right in studentville it seems they are alienating a lot of their potential customers.", "business_id": "1UGlEnkVHXelTT7qaBCZOw", "stars": 3, "date": "2010-07-28", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "xQChZzfGNm743JDEXBq2TA", "review_id": "kHgfR8NV2a8zKK12O7gtJw", "text": "Annabelles serves the best in homemade food. FACT. Everything is freshly prepared on the premises, in a rather modest kitchen. Specialising in hearty, warming wholesome fare - but sometimes throwing caution to the wind and making dishes like Moroccan chicken or carrot and orange soup. The owner - Annabelle funnily enough - also specialises in outside catering, so it's worth considering her for any special occasions. This is a regular home-from-home for many customers and it's easy to understand why. AND I happen to know that there is a small freezer downstairs that is home to some of the best ice-creams ever. I recommend you start with the vanilla Malteaser munch. NOW!", "business_id": "1UGlEnkVHXelTT7qaBCZOw", "stars": 5, "date": "2008-04-20", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "oEshN5oq98_g23MvEnRc5A", "review_id": "hfk9jdR5naoUI7cy2n6Cgg", "text": "This is definitely more of a café than a restaurant, as it's not open later on in the evenings and they mainly serve lighter eals like soups and quiches.\n\nThe first few times I walked past this place, I was a bit put off by the fact that every single table seemed to be occupied by old women. When a friend suggested we met for lunch there, I have to say I was a bit dubious. I was wrong though...\n\nThe food was absolutely gorgeous. Everything was authentic and home-made, but still presented beautifully on the plate when it came, and more importantly it was extremely tasty. I'd never really understood what people meant when they talked about food being 'lovingly prepared', but you can really taste, see and smell how much Annabelle's love serving up gorgeous home-cooked food.\n\nYes, the windows have lace curtains draped across them, and yes, there were quite a few older people in there. But they've got the right idea: if I still live in Edinburgh when I'm a pensioner, I'll be doing exactly the same thing.", "business_id": "1UGlEnkVHXelTT7qaBCZOw", "stars": 4, "date": "2010-05-01", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "0w0dA3MuiGN3B4apJxJ0Fw", "review_id": "9zOsA925gSYQCXikJZVgXw", "text": "Annabelle's is a strange beast. It is probably my nearest place for a coffee/breakfast/lunch and I use it fairly frequently. It is often pretty empty, very, very  occasionally full of yummy mummies with buggies blocking the aisles having just picked up their older kids from the nearby school. I often tend to see the same people, which must be a good sign. Decor-wise it is a non event. I don't know what they need to do but they should do something. The food - I've eventually got round to it! - is freshly made and good. French toast with their own home baked bread and bacon is great - but if you order it and they rush to the newsagent/general store next door - it is much less of a treat. (Has happened just a couple of times.) The scones are probably the best in Edinburgh - really! - however it isn't clear if they bake them every day. Just occasionally I have thought one to be a fraction stale. But for the fresh baked days - no question, just perfect, and they are giving out no secrets about the recipe! (We've asked several times.) Coffee is well up to standard.", "business_id": "1UGlEnkVHXelTT7qaBCZOw", "stars": 4, "date": "2016-08-08", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "FO0mjWGV3Z1mBRvdxCAwPA", "review_id": "jG65RqhgrTq84u_CbXL-Tg", "text": "Very nice little cafe/restaurant. Food is delicious tho a little on expensive side for a main course. Very handy for visiting Meadows, Sick Childrens Hospital or local schools. Staff friendly.", "business_id": "1UGlEnkVHXelTT7qaBCZOw", "stars": 4, "date": "2008-04-25", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "OQKx_Xd4s3yrzNUWkdybYQ", "review_id": "LZ-HYLa5yl85Uqfs4_OK6Q", "text": "I moved to this practice over 3 years ago as I was unhappy with my previous practice.\nSo far I am extremely pleased with my move to Meadowbank. The receptionists and nurses are friendly and helpful. The dentist allocated to me is very professional and takes time to explain options and costs. He also gives a commentary during treatment on what he is doing. More importantly I have been treated by the same dentist throughout the 3 years. I have had some complex work done such as a bridge and all has gone well.\nFinally I would note that all of the preceding reviewers have made only one review each. I tend to ignore such reviews as they are normally made by people with an 'axe to grind' and so cannot be trusted. True objective reviewers will make a reasonable number and a wide range of reviews.", "business_id": "Ic5tD2Cdx2mHawnysQ6HbQ", "stars": 5, "date": "2013-04-17", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "OWFcHwB6AWEDA5nb9bFRZQ", "review_id": "2RQM0puVEdmgjjalC4kS1A", "text": "Always friendly staff and happy to help. Always sent a reminder text to let me know when I'm due an appointment. Had some altercations after a previous treatment but was rectified free of charge.", "business_id": "Ic5tD2Cdx2mHawnysQ6HbQ", "stars": 4, "date": "2015-10-13", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "2TosFPdAwhGoxIFxMBrQjw", "review_id": "-mOe7PiNz55djVZQrQoIrA", "text": "Don't send reminders about appointments, being a busy mum you can forget.\nMy teenage son was seen by a male dentist here who was not welcoming and kept negatively criticising my son about his teeth as he needed treatment, constructive criticism welcome but this was not the case. As he had missed an appt he told my son if he didn't come for next appt he wouldn't see him again! Not impressed with this practice at all. \nNow registered with a different dentist and what a massive difference in service and care.", "business_id": "Ic5tD2Cdx2mHawnysQ6HbQ", "stars": 1, "date": "2016-02-14", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "xan14G_7IU66GtQPAA2cKw", "review_id": "seR_FO4AoVc0xoxP-c7tQQ", "text": "I have been an NHS patient at this clinic for a few years and received treatment during that time which has mostly been satisfactory. \nDuring that time I saw 2 different dentists, both nice enough as people but I would consider to have issues with both. The first guy I found to be slightly careless and every time he descaled my teeth without fail he gouged my cheek with the descaler and it took me repeated asking at every appointment to pull my cheek away from my teeth to prevent said gouging. He is no longer with the clinic.\nThe second dentist advised me to get a gum shield to stop me grinding my teeth. I agreed and she recommended one for the lower teeth, I went with her professional opinion. After receiving the shield, I found I could not tolerate it in my mouth as it touched the sides of my tongue causing me to gag. I went back and she shaved it, however it still touched my tongue. I explained to her that I couldn't wear it like that. Her only solution was that I \"train\" myself to wear it. I couldn't keep it in for more than a minute without gagging let alone sleep with it in. A complete waste of £60 and I was disappointed with the lack of interest by the dentist. I have no idea if a top shield would have served me better.\nIt is a busy clinic and most appointments I haven't had to wait however on one occasion I waited over 40 minutes past my appointment time without staff letting me know the dentist was running over and subsequently I had to reschedule. \nThis clinic no longer sends out postal reminders due to cost and the only reminder you will get is via text message. \nI think you have to be realistic with regards to the type of service received from NHS dentists, fairly decent, basic dentistry.", "business_id": "Ic5tD2Cdx2mHawnysQ6HbQ", "stars": 3, "date": "2014-06-14", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "U_s__acaAyXUp70i2FFjyw", "review_id": "brAUwE7QAkbFDZwfINgNNw", "text": "My first visit. The receptionists were excellent  friendly and welcoming but I was startled by the dentist  unfriendly, impersonal, distant  bare minimum 'bed-side manner'. I was given absolutely no idea what he was going to do and given no idea how any problems he might find would be dealt with. I told him of two problems I knew of and he got busy with an initial inspection (I think that's what it was  he didn't tell me). When that was complete I was told my teeth were generally good but the two problems I highlighted would need filling (no x-rays????). I was asked if I'd want metal or white fillings because the NHS would only cover the former  I had not ever been asked if I was a private or NHS patient but I have every intention of being a private patient. I said 'white' and thought the chipped tooth at least would be treated. Instead I was told it was the end of the consult and I needed to make another two appointments for the fillings and to get an estimate of the cost. That was it  I was left confused, unnerved even! During the entire consult the dentist either had his mask half-on / half-off OR fully on when he worked on my teeth  I can honestly say that I hardly knows what the guy looks like. I found out his name only when I asked for it half way through the consultation!!", "business_id": "Ic5tD2Cdx2mHawnysQ6HbQ", "stars": 1, "date": "2012-10-29", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "Wu-yg4k0EgOeU2xuG6tcyw", "review_id": "cQ6uX3sA_oZWDx0mS7YBSg", "text": "I ordered the bacon cheeseburger.  Well to me its just another unseasoned burger.  The thousand island sauce was the first hint that this was just going to be another burger,  the bun was toasted and the condiments were fresh.  The service was good and the cashier was very friendly.", "business_id": "1_vpfu3RxcnX5z54vmnOMg", "stars": 2, "date": "2012-03-13", "useful": 2, "type": "review", "cool": 0}, {"funny": 0, "user_id": "gCp21sfvL6HnQOvapeV7sw", "review_id": "InHQVBF99kh6sgMnOMdY0Q", "text": "Today I decided to get in my car and try a new place for lunch. I was originally headed for La Paloma, but when I walked in all of the chairs were up on the tables. Having been in food service at one time I hate to go in right at closing so I decided to go elsewhere, though they assured me it was no problem. The time is 3:20. \n\nIn the same strip mall I spot Hamburger Haven. Their sign says OPEN, they have no hours posted, but there are people inside. I decide to try it out. I walk in to order and wait while another group gets its food then commences to ask for a bunch of little items that keep the guy busy running back and forth. He finally got around to asking me what I wanted. Not friendly, maybe a little annoyed. I order the food. I can see the guy cooking grumble in the back. I'm thinking to myself, \"what's so hard about a cheeseburger and onion rings?\" I am not feeling welcome. \n\nThe food came out. Not bad at all. Nothing great, fried stuff, but decent all the same. I'm sitting there eating, trying to tell myself the bad vibes are my imagination when a third guy appears behind the counter. He looks out at the people in the restaurant, frowns a little, then marches to the front door to flip off the OPEN sign. Ah, they were closed I guess. I suppose that is why the employees seemed annoyed. \n\nI have an idea for this place. If you want to close at a certain time post a sign with your hours. Also, remember to turn off the OPEN sign. Finally, if you don't want to serve someone just let them know. It will probably annoy them, but they might try you again in the future. With thousands of restaurants in the city life is too short to put up with an attitude of any kind.", "business_id": "1_vpfu3RxcnX5z54vmnOMg", "stars": 2, "date": "2012-08-03", "useful": 1, "type": "review", "cool": 0}, {"funny": 2, "user_id": "AOINdnFcpyLkWqXeciRe4A", "review_id": "rLzkXgSz-Ey_F77PH-0I0w", "text": "I heard that Hamburger Haven was under new management so I decided to give it a try with my co-worker. The first thing I noticed was the painted seascape was gone and instead was a nicely painted restaurant. The friendly guy behind the counter told me they are in the process of doing some remodeling and the booths and menu would be next. Both my co-worker and I ordered the bacon cheeseburger (however, unlike the name, there are many other sandwich and salad choices).  We both made it a combo with fries. The guy told me that they are using the technique of smashing the burgers on the grill to sear in the juices.  Shortly later, our orders came out hot and delicious! The burger was juicy and had great flavor. I ordered mine with caramelized onions- yummy! The fries were good, too, but the star of the mean was the burger! It was a great value, too! I will definitely be back soon!", "business_id": "1_vpfu3RxcnX5z54vmnOMg", "stars": 5, "date": "2012-12-12", "useful": 2, "type": "review", "cool": 1}, {"funny": 0, "user_id": "pG9y1uv735_8gqz3-fK-Bw", "review_id": "rGu7kwvyT4dzv6boonqODQ", "text": "I jumped in here for a quick bite on an errand-filled lunch hour.  The burger and fries were bland and unremarkable.  Kinda a bad place for a mediocre joint, since Lenny's is right around the corner, and lots of other burger joints are just a mile away.  Better than a standard chain fast food place, but not by much.", "business_id": "1_vpfu3RxcnX5z54vmnOMg", "stars": 3, "date": "2010-12-01", "useful": 4, "type": "review", "cool": 0}, {"funny": 0, "user_id": "5V8eXkTJb6IejJkMDaj_Bw", "review_id": "7WLqefva2C7-SRz9cG9ojQ", "text": "Would you make more of an attempt to visit this place if I told you that you could see sea birds and driftwood?\n\nIf so, have I got news for you!!\n\nHamburger Haven has black and white checker floors, driftwood AND sea birds. Don't worry. They only look real. They won't try to eat your hamburger. That's all for you.\n\nI was totally not expecting the decor I saw in this place once I arrived one day on one of those \"need food now, name the first place you can think of go\" type moments. Not with the name Hamburger Haven. Or with the typical strip mall dive bar look from the parking lot. And let me tell you. Hamburgers ARE more fun to eat by the sea!\n\nThe menu was vast and delicious. Some of them lacked descriptions of specific items on the hamburgers, but after asking I decided to go with a green chile burger, which is my typical go to and I was not disappointed. A good amount of grease but not too much I needed the entire napkin container. The flavor on both the burger and the chile was out of the world. \n\nI'm writing this review in hopes that I remember to head here more often, because I love a place with an unexpected view. Don't believe me still? I uploaded photographic evidence.", "business_id": "1_vpfu3RxcnX5z54vmnOMg", "stars": 3, "date": "2011-05-17", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "VQhvTClcf_Wcxm0Ei4GpqA", "review_id": "hj2jqvx0pp49BKxHdPOKaw", "text": "I had heard a couple of people mention Hamburger Haven. I stopped by to pick up a menu and was really impressed with the place. They have a huge menu of breakfast and lunch type items. The choices were overwhelming. The place is clean and the prices are very reasonable. Oh and they deliver with a minimum $10 order. I ordered a Ham and Cheese Omelet. It came with toast and Hash-browns or Home Fries. The cashier recommended the home fries. I think it was just under $5. They have an American Breakfast (eggs, Bacon, Toast and Potatoes) for under $4.\n\nThey have a HUGE menu as I mentioned. They have Hamburgers, Burritos, Fish, Shrimp and who knows what all else. If you are looking for a Local alternative to Denny's/IHOP this is your place. I predict they will do well if they can get the word out. Mmm.", "business_id": "1_vpfu3RxcnX5z54vmnOMg", "stars": 4, "date": "2010-10-03", "useful": 3, "type": "review", "cool": 1}, {"funny": 0, "user_id": "naGcg_vi336QxcuyvBHSkw", "review_id": "5QcCZxtgoZfxwrzudt1w8A", "text": "My aunt is one of those people that fixes up a house until it is perfect and then sells it immediately to move on to the next project. When I was interested in moving to Scottsdale, I obviously turned to her for advice on which realtor to use. She recommended Secure Real Estate (I worked with Charlotte Allred), and I was so happy that I followed her advice. \n\nCharlotte took her time to understand my needs and really worked with me to get a home that fit my specifications. I really appreciated the time that she took with me since I wasn't looking for a multi-million mansion or anything :)\n\nOverall, great service! I will use her again in the future!", "business_id": "QG0OBdxpFbwkoAiDuur9iQ", "stars": 5, "date": "2014-12-31", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "zTcEaWYZ09DMrhM8ujMzNQ", "review_id": "jeD55JoeONLZlr1W1vViWQ", "text": "Charlie and her team were great to work with. Being young and looking for my first house I was really out of my element. They have so much knowledge on short sales which helped my boyfriend and I find a amazing home in the Scottsdale area.\n\nI recommend Secure Real Estate if you are in the market to both buy and sell a home. They invested a lot of time with us to know exactly what we wanted and why we wanted it, which kept us from wasting time looking at homes that weren't right for us.", "business_id": "QG0OBdxpFbwkoAiDuur9iQ", "stars": 5, "date": "2014-12-17", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "DNVPQ2L7ZxvUD9W8UYD-Jg", "review_id": "Hs8LtRWziGMscUF2YiYylg", "text": "Secure Real Estate is the best in town! Charlotte is by far my favorite. Her knowledge of available homes, pricing and locations were exactly what I needed in order to find the perfect place. I needed advice and her willingness to help made my whole home buying experience better. If you are looking for a home in the Scottsdale/Chandler area, Secure Real Estate is the best!", "business_id": "QG0OBdxpFbwkoAiDuur9iQ", "stars": 5, "date": "2015-02-04", "useful": 1, "type": "review", "cool": 1}, {"funny": 1, "user_id": "rIe8edKKI8Irs9hAiTvS9Q", "review_id": "MTZHhCuG8oLsYXF7bd-UJg", "text": "The Odyssey Bookstore carries a good literary/fiction selection at prices from $10-$15 for a hardcover.  There is not much of a poetry aisle to speak of but the shop makes up for it in Canadian history as well as a great section in world history - this is where you may find a few rare and justly priced books.  They also have an interesting literary bio section that is small-moderate in size.\n\nStore was clean, well organized and quiet.  \n\nWill stop in again next time I'm in Montreal...The owner was very kind, friendly and appreciative of my business.", "business_id": "4wT0v1MJf9b0RG1Lb2GILA", "stars": 4, "date": "2014-07-30", "useful": 3, "type": "review", "cool": 1}, {"funny": 0, "user_id": "oRtFHQya_MgpWjlLIRjM1w", "review_id": "sKkHiRgXQJLjIgSNH0ziJQ", "text": "Cette petite librairie d'occasion, spécialisée dans les livres de langue anglaise, est située à proximité de l'université McGill et à quelques pas du métro Peel. Aussi, son emplacement central en fait ainsi une destination de choix pour les bouquineurs de tout acabit, à la recherche de la perle rare. Également, fait rare pour une librairie anglophone, on y retrouve une minuscule section (une étagère) de livres en français, essentiellement composés de classiques littéraire. Du côté anglophone, la sélection est plutôt éclectique, alors qu'on y retrouve aussi bien des livres scolaires que des essais en sciences humaines. Également, du côté de la fiction, la part de lion est faite à la littérature canadienne. Aussi, ce choix a peut-être un lien avec la présence de deux universités à un jet de pierre de cette petite librairie. Finalement, les employés s'expriment dans un français impeccable.", "business_id": "4wT0v1MJf9b0RG1Lb2GILA", "stars": 4, "date": "2010-12-23", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "DKJhyuqfNiMrhXqVcokzxQ", "review_id": "y7evPrkqzBDRcj4ZOXHAtw", "text": "Great selection of literature/fiction. Very well organized. The myth of the curmudgeon owner are just that a myth. Never had any issues.  Prices are good. Not super bargains but about 10$ per hardback", "business_id": "4wT0v1MJf9b0RG1Lb2GILA", "stars": 5, "date": "2012-05-28", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "2GEKwUW0THMr1QKAaaDDEA", "review_id": "0wM-SADAzQ6T79fE4kvPMA", "text": "Hi, not sure if anyone ever reads these reviews, I did and am glad I did. I came from up north and had just settled in to Edinburgh. I had been learning to drive before I moved and wanted a school to get me to test.\n\n\n After looking around I came to The Driving Training Centre based on the reviews I had read. Must say, am glad I did. Unlike my last driving school, these guys are professional, reliable and patient. My instructor helped me focus and I found his explanation easy to understand.\n\n\n My advice, learning to drive, use these guys they are years ahead of the competition. Thanks DTC for all your help.", "business_id": "EJhvKcupXAqz0-eJsEV9LQ", "stars": 5, "date": "2009-02-28", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "1VU2tLlMMDd2M2NgF4wuPA", "review_id": "aMNspDDhaRDIzHB3fMPPlQ", "text": "I used about 4 driving schools before taking lessons with DTC and now wish I had gone to them in the first place as I learned more in 10 hours than I had in the previous 20 hours with other schools and they helped me pass my theory test as well.", "business_id": "EJhvKcupXAqz0-eJsEV9LQ", "stars": 5, "date": "2008-07-15", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "b0SIBUBr0cw7WvXi2B6w0g", "review_id": "49yTWxf3jlDgwKbMBlB-Zg", "text": "Excellent driving school and instructor Pat. Very organised, friendly, value for money and great quality. Pat was fantastic as an instructor. I've had three previous instructors.....two of which were awful....unfriendly, overly critical and poor standard lessons. Pat was just the opposite. Friendly and put me at my ease straight away as at 28 and putting off lessons after previous bad experiences it was difficult getting behind the wheel again. He was always super organised and prepared and even took notes on our lessons. He was very flexible and reliable. I passed first time too. Highly recommended.", "business_id": "EJhvKcupXAqz0-eJsEV9LQ", "stars": 5, "date": "2014-08-06", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "spmQ6KIl8ZaVhYj3s6qVaQ", "review_id": "8k73rzsLhC3KYalMbJ3bAw", "text": "Passed first time and never thought I'd even be able to drive.\nPatient does not describe these people  I was a nervous wreck when I first started.\nHad previous had 2 lessons with another driving school who had me out on a main road in busy traffic and I didnt even know how to change gear.\nDTC were totally different. Great teaching style.\nHighly recommended.", "business_id": "EJhvKcupXAqz0-eJsEV9LQ", "stars": 5, "date": "2012-10-23", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "DB8eZawJlQxbWc2I7aJ_vQ", "review_id": "zVBQjgKgxrkhSXXedwXSdg", "text": "If you've stayed at the Cosmopolitan Hotel & Casino for a few days, you've probably discovered the intoxicating fragrance of the lavender and peppermint shampoo and shower gels they place in your room.\n\nWhile I typically do not notice these things -- soap and shampoo is just soap and shampoo -- these unique scents perked me up. Not surprising, since peppermint has been said to augment alertness, while lavender has been used as a sleep aid and a muscle relaxant. Perfect. Balance.\n\nWhile you can hide the shampoo and shower gels bottles in your room in hopes housekeeping sets you up with a fresh stash the next day, you can also stop by Vitals, located a few steps away from the hotel's check-in desk and across from the Vesper bar.\n\nVitals sells the whole line of C.O. Bigelow beauty products, so you can buy larger versions of the same gels and shampoos that are in your hotel room, so you can continue to smell like your days at the Cosmopolitan long after you leave Vegas. They also sell assorted drinks (soft drinks, beer, and the harder stuff), snacks, and sundries, and are open 24/7.", "business_id": "F-aEq4SXwDCe8fRKcF42CQ", "stars": 3, "date": "2013-04-09", "useful": 1, "type": "review", "cool": 1}, {"funny": 2, "user_id": "U7NLhaVfOJrHb9XLsZbJnQ", "review_id": "yJZMZzo-r6mwlniFhYO9NQ", "text": "This place probably isn't what you came to Cosmopolitan for, but I bet you'll find yourself in Vitals at some point during your trip. Wanna bring home a souvenir? Vitals sell a variety of Cosmopolitan/Las Vegas stuff.  Had a late night and you're stumbling back to your room? Grab a bottle of water and a snack to ease your hangover. Came down with an illness or forgot something in your bathroom bag? Vitals is stocked with medicine. Forgot pool supplies? Vitals has sunglasses and sunblock. Got lucky and need some protection? Vitals has condoms for ya. Didn't get lucky? Vitals has adult magazines too!\n\nThe prices may be more expensive than your local convenience store, but this is a hotel in Las Vegas. What did you expect? Just be thankful it is open 24/7.\n\nPlease gamble responsibly.", "business_id": "F-aEq4SXwDCe8fRKcF42CQ", "stars": 4, "date": "2012-04-18", "useful": 1, "type": "review", "cool": 1}, {"funny": 0, "user_id": "ZTCk7-TML6os8ZRPE1xY8Q", "review_id": "AHMF9HC9Kv01jA4EEaTMkA", "text": "Ok. this place is very pricey. We paid 3x for a vitamin water. I think Walgreens across the street can serve your needs better.", "business_id": "F-aEq4SXwDCe8fRKcF42CQ", "stars": 2, "date": "2015-12-21", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "_5keMAmic7zzrnM5mVefBw", "review_id": "I0ao_NF8KQvKGau4NqGALQ", "text": "Staff helpful. A bit expensive for more than 2 pages to fax but glad they were there.  the staff was super sweet", "business_id": "4G3ptZapkPZwMCE-PX_7tA", "stars": 3, "date": "2015-02-25", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "GGTF7hnQi6D5W77_qiKlqg", "review_id": "vmm68CC1VJLAx3DxZk91uw", "text": "They take the hassel out of shipping parcels\n\nGreat place.  Rather you need a package shipped, signs made, a notary etc, this is the place to come in Cornelius.  We've been coming here for a number of years and they are great. They have all of our common ship to addrsses on files and make things quick and easy\n\nThey will also research shipping rates and delivery dates to make shipping prompt and economical.\n\nPlease note that they moved about a year ago due to Harris Teeter remodeling and taking their space.  Photo on file is from the old location and I've posted the new one evey though it's right across the parking lot.", "business_id": "4G3ptZapkPZwMCE-PX_7tA", "stars": 4, "date": "2014-07-06", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "tg1Eh5J9iqH5Y0ycb1bejw", "review_id": "_TjasNuhezdUvF67-MamIA", "text": "I needed to send something thru FedEx and this place came through for me in my time of need. \n\nAtmosphere - Basic CLT/ NC strip mall/ business area (meaning that is impossible to find due to the numerous trees, nondescript buildings, and meandering parking areas that do not connect), spacious inside, clean, friendly/ helpful mature staff. \n\nService - They worked w/ me to get done what I needed to get done. They even let me use their stapler! \n\nOverall - If you need to FedEx a package quickly or have any other shipping requirements, this place is helpful and will met your needs.", "business_id": "4G3ptZapkPZwMCE-PX_7tA", "stars": 3, "date": "2010-11-07", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "g2sdnSn0wVqow80iDB9RpQ", "review_id": "3NWkJcGk680nbVrIY3UAqg", "text": "took my car in for an oil change.car was done quickly and the price was reasonable.great service and friendly staff.", "business_id": "2Hw44bNS-G6HwIcVkTZRWw", "stars": 5, "date": "2011-12-05", "useful": 0, "type": "review", "cool": 1}, {"funny": 1, "user_id": "SvOoa558IxY91EhC3YNT5Q", "review_id": "7nt39deUlth_T2ffKfmQpg", "text": "Put head gasket on incorrectly and now the engine is having major issues. They have now had the car for over a week with no resolution in sight.", "business_id": "2Hw44bNS-G6HwIcVkTZRWw", "stars": 1, "date": "2014-04-25", "useful": 2, "type": "review", "cool": 1}, {"funny": 1, "user_id": "g3BkLzos4dynKWsAwoKHyA", "review_id": "-lc6UDx0VW8No7HJXKcDdA", "text": "I had a very bad experience here. They had my car for a total of three weeks and couldn't find the problem. Once they did, they installed it wrong! I had to bring it to a \"real mechanic\".", "business_id": "2Hw44bNS-G6HwIcVkTZRWw", "stars": 1, "date": "2012-02-09", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "IrOEV_ZfJKF3-L8hwJ1SEg", "review_id": "aPfu8ITpfbfLTH2FrYAKGg", "text": "I had a great experience here. They changed my oil in no time at all and at a great every day price. I asked if they could check out my a/c because it had been blowing cool but not cold. They fixed it for free! You can't beat that!\n\nI'm not sure if it's a recent ownership change or not but two brothers run this place and seem to take pride of it and their work. Tyler, who was working the front desk that day, is a hottie...\n\nI would definitely go back.", "business_id": "2Hw44bNS-G6HwIcVkTZRWw", "stars": 5, "date": "2013-08-02", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "lqMLVVrwJ0WYuZ5V76rVgw", "review_id": "ITkoBgI-JCw9IssiOAO71Q", "text": "overpriced and VERY small portions. Server was a pain too. Pass on this one folks.", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 2, "date": "2012-03-13", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "AlXx0P-OhUylep0jNi773g", "review_id": "l4JX_ZGWzjEKSgwJRBbWeg", "text": "Tacos; I love them... and I have eaten a lot of them.\n\nThese were okay but not amazing... 2.5 to 3 out of 5.\n\nI had the catfish and the pulled chicken tacos - the catfish was significantly better. If I had had 2 catfish and 0 chicken I would definitely rate this 3/5. The meat portion in the tacos was small for the price, but I thought it was an okay value when you add in the salad and other items for the platter.  $11 lunch with no drink. Meh... a bit too expensive, but not too obscene considering the neighbourhood.\n\nThere is a $9 chorizo taco on the menu that I did not get, because you know what... that is just way too expensive. I would go to Burger's Priest with my $9 over that taco, every single time. \n\nDetails:\n- semi-hard shell tacos ($5-$9[!] each)\n- \"platter\" option comes with 2 tacos, rice, beans, cold salad and is about the same price as two tacos purchased separately\n- interesting and good vegetable fillings, very fresh\n- mexican beers @ $6 each\n- large selection of tequila and other liquors\n- not a very young/cool ambiance - I wouldn't be excited to actually eat here vs getting takeout\n- good containers for takeout & well prepared for takeout orders\n- good service\n\nI'll definitely get takeout again [and try other things]. Even though it's just good and not outstanding, it's still a welcome addition to this strip.", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 3, "date": "2012-03-06", "useful": 3, "type": "review", "cool": 2}, {"funny": 0, "user_id": "mv1IeIs9H8Or5GOi3JHxrw", "review_id": "9Gdsw8PnZrT4yqajPUa2YQ", "text": "I really wanted to love this new taco bar since there aren't too many kick-ass Mexican/Taco places in the city, imo, especially in the east end.  Sadly, this definitely does not hit the mark.  \n\nI'd give the food 3.5 stars, but the service was truly atrocious.  I can't give it more than 1 star, which leaves us at a 2 star average.  \n\nWe had the chicken taco and veggie taco and the jicama salad.  All seemed fresh and tasty, especially the veggie tacos.  Portions left us wanting more, meaning the food was tasty, but the portions small. \n\nSadly, the service was literally the most awkward experience I've had in a long time.  For starters, the server/nobody greeted us when we came into the restaurant.  Apparently it's seat-yourself, but there is no sign to tell you.  We thought we were the only ones confused, but then observed everyone coming in waiting to be seated only to have the server ignore each new patron for an odd period of time.  She was super patronizing in her responses to our question and made us feel dumb, which was extremely infuriating.  \n\nI think Toucan Taco needs to replace/train their service staff, get a sign saying seat yourself (being casual does not imply seat yourself), and expand portion sizes.  Without these fixes, this resto does nothing for our neighbourhood.  \n\nEric", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 2, "date": "2012-04-07", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "nCRPCQE7E1PV83uQrIf7Cw", "review_id": "T6iePatdKWabnHqpMREiWg", "text": "I drove past this place multiple times and had always wanted to try it, but sadlythere was much left to be desired.\n\nthe staff was nice, they explained the food well and were excited about the food. but the food was not as flavourful as i hoped and was a bit expensive for tacos.\n\nthe food took a while to come as well, despite there being no one in there besides us.\n\ni had the chicken, which i thought would totally absorb all the flavours, but was a bit dry and did not have that much flavour. i had to keep putting that mild sauce that was on the table on pieces of my burrito to get some flavour.\n\nthe blackened fish tacos were a bit burnt too and there were only two pieces. again, not enough flavour.\n\nthe decor was nice, i like the coat hooks at the front! Apparently the patio has the sun shining onto it in the late afternoon, so beware of that depending what time you go.\n\ni'll take a pass next time for food in the area. wasn't worth the money.", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 1, "date": "2012-08-07", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "wxaAnhOsEpXj-kK7qBdMSA", "review_id": "fTPgtfY6bIE7Mu-kSWzsvQ", "text": "**Maybe a 2 star, only because it's the ONLY taco place around.\n\nI've lived about  a 5-minute walk from here pretty much all my life, and I love tacos! My excitement sky-rocketed when I noticed this little place opened up so close to home and finally came to check it out a couple weeks ago.  The owner of Le Canard Mort closed down the former Le Resignol and opened this new little taco bar.  I have never been to the other restaurants, but Le Canard Mort has definitely been on my radar, and I cross my finger it will be much better than this.\n\nThere were two of us when we came and thought it was closed because it was so dark and empty.  It could have just been because it was late afternoon during down time, but I've never seen more than 2 people in here at a time anyway.\n\nWe were casually greeted, and we picked up a menu off the table.  It consists of enchiladas ($13-$16), burritos ($9-$12), nachos, and a few salads.  The tacos range from $4.50 to $9 each, or you can choose to get the platter of 2 which includes rice and salad.  And so for a quick lunch:\n\nBlackened Catfish Taco Platter: $14 (2/5 stars)\nThe fish itself was cooked and seasoned well.  However, it was not hot... warm at best.  The yellow mole lacked flavour, and the mango salsa was... meh (I can make way better!).  Overall, a bit dry and lacking in flavour... and heat.  Very disappointed with the \"platter\" aspect since it was a tiny scoop of bland rice with what seemed like canned black beans heated in a microwave and poured on top.  The salad was several lettuce leaves with... I forgot what else (not worth the mention anyway).\n\nShrimp Taco Platter: $14 (1.5/stars)\nShrimp was cooked well, but definitely lacked flavour, chipotle mole was inexistent according to my taste buds.  The tomatillo salsa was alright, but missing the bold taste tomatillo salsas promise to deliver.  Again, a bit dry and I wished I hadn't gotten the platter... double disappointment.\n\nService: (2/5 stars)\n2.5 stars.  The server was nice, but there was really nothing that was done to put her above the McDonald's counter service.  We originally asked to get the food to go, but decided to stay after we got the food.  She brought some utensils, napkins, and bottled sauces, then she reached into our bag and took the packaged sauces back so we wouldn't waste it.  I mean, I hate to waste and would have probably given it back anyway... but SERIOUSLY?!\n\nI am a forgiving person and I believe (almost) everyone deserves a second chance.  Chef's and restaurants have their bad days too, so yes, I will go back ONE DAY to get ONE taco and hope that it will make up for EVERYTHING.  The concept is what I really admire, but the food, cooks, service, and atmosphere need to step it up BIG TIME!", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 1, "date": "2012-05-29", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "WHmabbfgdSW-JrOU9ePMrA", "review_id": "4373juarzzCgqOcnzNgrUg", "text": "I was SO hesitant to come here since all of the reviews were saying that is was ho-hum (or less than so). But my friend convinced me to come by so I obliged. I can't say no to a taco. And low and behold, the tacos suck (more later). But don't come here for the tacos. Come here for the nachos. \n\nVIBE \nStandard. I'd rather talk about the food. The owner, Lindsay, is really nice. She taught me what mole was (that red chile paste that you'll see on your plate). It gives everything a bit of a kick. \n\nWE ATE \nCatfish taco - no flavour but nice soft fish \nPulled chicken taco - less flavour --quite a mess with a hard shell\nChorizo taco - pretty good flavour but not sure what they're using as pineapple here. Let it ripen. \nNOTE: do not get the hard shell if you can and ESPECIALLY if you are on a date. It is sooo messy and so awkward to eat. \n\nWe got guac. MEH. Too much cilantro and lime and it was chunky. It wasn't mushed. I know avocado costs less than $1 Make it worth my while and mush, mush I say! \n\nBut the surprise was the nachos. The corn chips were really tasty (I like my salt!) and with the mix of ingredients they had on top of the chicken, was quite good. The small portion is more than enough and reasonable for the cost ($9). \n\nThe tacos were not worth it (except chorizo). My benchmark is Grand Electric. When Grand Electric is charging $3.50 for a cod cheek taco and you're selling me bland chicken for $4-6.50 PER TACO it's not worth my value. \n\nDRINK my friend got the tequila, coke and I think sprite cocktail and it was quite good (and I don't drink tequila). I was going to get the sangria but it seemed pricey at $9 for me. \n\nGuac, 3 tacos, nachos, a coke and cocktail came out to $46 with tax, NOT including tip. I was filled but the tacos weren't worth it. \n\nOBLIGATORY CATCHY REMARK \nNot flying here for the tacos, but nachos yes. Get the nachos. Nice to have some Mexican in the Broadview/Queen area.", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 3, "date": "2012-04-07", "useful": 2, "type": "review", "cool": 0}, {"funny": 0, "user_id": "2CzXeTWY2znqZpo3Irs2zQ", "review_id": "7Xa-_IegFjujTSG67HVWXw", "text": "Yay! A taco place in Leslieville!\n\nThey are just starting up so there's certainly room for improvement but there's lots of potential. \n\nNachos are just perfect! Blackened codfish and veggie enchiladas are very fresh and delicious. \n\nService is quick and pleasant. We'll be back for sure!", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 4, "date": "2012-06-08", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "XXzLfALnq787XRXP513acA", "review_id": "YX6wctL2zM51Y6lxZ4lSGA", "text": "My idea of quick fast Mexican in Toronto is usually hitting Chino Locos for yum yum fish burritos but then Toucan Tacos opened.\n\nMy fiancee had already ventured to the forbidden Taco land when I was away on biz, so first weekend back I decided to hold out as long as possible to starve him and suggest Tacos for a late lunch/early dinner. Taco mission success!\n\nWe went at an odd hour which meant we had the whole place to ourself, the decor is still in progress I think but at minimum was hoping for some cheesy Mexican music.\n\nI was freezing and used that as an excuse to order the sangria, which I thought was pretty good, especially when i wasn't expecting sangria as an option.\n\nGiven we had starved, we ordered guac and chips, the guac was fantastic and the chips once sprinkled with fresh squeezed lime were great as well.\n\nThe highlight was the catfish taco platter. The tacos were not too hard and perfect in density, the fish was fresh and seasoning great. This was all accompanied by jicama salad that looked like slaw but tasted like summer freshness and simple white rice and fried black beans that didn have the slimey taste that canned beans can sometimes have.\n\nI was mostly impressed by the overall freshness. I inquired about dessert which I was assured will make itself on the menu soon, I'm hoping churros with vanilla ice cream - pig!\n\nChino Locos I love you guys but I'm happy to make the slightly longer trip to Toucan Tacos instead.", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 4, "date": "2012-03-11", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "pOqLdXk217w2KlHOjiHRlw", "review_id": "_wVMwi2QtFr1bkwdYuyaDQ", "text": "My girlfriend and I stopped by here after a concert at the Opera House. It was completely empty, when all the restaurants around it were full. Usually not a good sign, but we gave it a shot anyway.\n\nWe had a pork taco and nachos. Pork taco was a 2/5: dry, the soft taco shell was not warmed up. The nachos, however were easily a 5/5. Amazing guac, tasty chips. Service wasn't great, it felt like we were intruding on the server's private conservation with the cook. \n\nSo in the end, a mixed bag! Would go back, just for the nachos.", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 3, "date": "2012-06-11", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "jn-qvg8tDX0npfGEw1ujXw", "review_id": "ZCkVb9kccn0XLIIWVVPMRw", "text": "Benefitting from exclusivity, suffering from sticking its neck out without the polish.\n\nThis place is getting better/will be good soon. \n\nNachos are excellent, sauces are nice and more subtle than you think.\n\nTake the reviews here with a grain of 'sal', if your idea of mexican food is either a 9 lbs, 4oz Burrito boy, or squishy Jack Astor's guacamole, these reviews make sense. \n\nAdmittedly, meat needs some work.\n\nOwner should swing by Rebezo's on Rogers Rd for a quality-to-price check.", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 3, "date": "2012-06-08", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "VVm-TFCpi9M1-k8ED0l1eA", "review_id": "xk3tZwvSA9q5hjh7BI8jkA", "text": "Actual rating 2.5.\n\nThis place is in my hood.  I really like tacos, so I was hyped.  Despite the poor reviews, my good friend/fellow foodie and I decided to try it ourselves.  Both of us hoped to be pleasantly surprised - you know, let the underdog win.  Alas, it was not so.\n\nThe atmosphere is dreary.  No attention has been paid to creating any sense of ambiance.  Honestly, it looks like a hodge-podge of left-overs from the previous restaurants that inhabited this space.  I suppose because of that it has a sense of being transient. just thrown together with little thought.\n\nStill, I can forgive weak decor if the food is stellar.  Unfortunately, nothing we tried was even remotely interesting.  We started with the chips and guacamole; the chips were decent but the serving size and complexity of the guacamole was pretty lame.  We shared the catfish enchiladas and the pulled chicken soft tacos.  Both were very boring.  The rice and beans that accompanied were abysmal.  The yellow \"mole\" was so lackluster I didn't even register what it was until my friend pointed it out.  \n\nAnd the service?  Forget it.  Bottom line, I will not return.  I would never recommend this place to anyone as it stands.", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 2, "date": "2012-04-25", "useful": 1, "type": "review", "cool": 0}, {"funny": 1, "user_id": "YRcaNlwQ6XXPFDXWtuMGdA", "review_id": "Erye_406MkRIPPdV1uHk1A", "text": "This place is not good. I wanted to like it. I really wanted to find some way to give these guys 3 stars, but I just can't.\n\nI came on a Wednesday night during what should be the peak of the dinner rush. The restaurant was dead, however they do have the patio out back and the guy in the kitchen was cooking so there must have been some other people around somewhere. A few doors down, Prohibition was raucous so it's not like there were a lack of people in the neighbourhood that night.\n\nI went with the blackened fish taco plate. With the tacos you get some beans, rice, and a salad. The sides were bland. The tacos themselves were just not good. The tortilla was a cheap flour shell that you can probably buy at your regular grocer store. Except for the fish, the individual ingredients were pretty good. The problem though was that the tacos were drowning in sauce. I couldn't really tell what was on the taco. The fish was bad. I actually thought they maybe put pork on my taco by accident until I pulled a piece out and tasted it on it's own. Also, for the price, there is not near enough fish on the taco. There needs to be double the amount if you compare to other fish tacos in the city.", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 2, "date": "2012-09-08", "useful": 3, "type": "review", "cool": 1}, {"funny": 0, "user_id": "zQuNkXGwkGpuzrXji1Pw-g", "review_id": "u9jL4xAvuVHdiH22jlK4cA", "text": "Just terrible.\nMy partner and I stopped in for dinner before a show at the Opera House, and we had probably the worst meal we've ever had in Toronto. \nThe nachos were totally burnt, and included hot, tasteless guacamole and dried out pieces of zucchini. And ZERO salsa or tomatoes. WTF?\nThe beef and pork tacos were okay, but totally FREEZING COLD. Considering there were all of three people there when we ate, I can't imagine the chef was overwhelmed with volume. Instead, I just don't think they care.\nThe rice and beans that came with the taco platter looked and tasted like what I assume prison food must be.\nThe server was nice, sort of, though she kept forgetting our drinks and took forever to take our order. This place seems like some slapshot pipe dream being run by the owners friends and family. Do yourself a favour and eat elsewhere.", "business_id": "4ZNr_HOSCXMCzY4xN4WACA", "stars": 1, "date": "2012-06-27", "useful": 0, "type": "review", "cool": 0}, {"funny": 1, "user_id": "NmuegbCURjJS8COo1Uqd3w", "review_id": "8TcMKjgeCVbKhf82psMwUA", "text": "What seemed to be a beautiful and affordable venue for our wedding turned out to be big a waste of money and time.\n\nWe booked The Estate as the venue for our wedding reception due to it's elegant looks and cheap price. We were concerned about the food as there were no pictures available on the website as well as the in-person meeting but we were assured that The Estate was \"known for their food\". During our tasting, not only did the food prove our concerns, it was actually worse than we expected. Everything that needed to be cooked were cooked improperly. Undercooked pasta, dry chicken, overcooked salmon, and the presentation of the plates were reminiscent of cafeteria food (ever wonder why you can't find any images of their food?).\n\nTheir quality of food matches their quality of service. Prepare to wait weeks to book meetings and booking your tasting. In our last meeting, we addressed our concerns and were granted a second tasting but we had to wait for another 1-2 months for it. George said that he would finalize the date in the next few days and we agreed. Four weeks later, after hearing nothing from George we decided to call and follow up on the tasting and were told the reason he didn't get back to us was because he was on a 10-day vacation (despite there being 2 other people running the venue). He said that he'll get back to us that evening with a date. After another week of waiting, it was clear that our wedding concerns were not going to be treated seriously and with urgency so we withdrew our booking from The Estate.\n\nAll in all, The Estate is either an overpriced budget hall or a mediocre wedding venue. You may fall in love with the place but not with the people.", "business_id": "Fd2RUB_FhhCklEMTLZTmeg", "stars": 1, "date": "2015-04-05", "useful": 2, "type": "review", "cool": 0}, {"funny": 0, "user_id": "-tWLPqpm5o145XexGi5J-Q", "review_id": "O-1Es6whEQkmEPwAYb14aA", "text": "I got married in January 2014. I really think this place is a hidden gem. The management and staff we dealt with there were very accommodating and the prices were incredible. The decor of the venue is very fresh and modern. Other banquet halls I visited felt stuffy, outdated and they were charging twice as much. I also really liked the fact that we didn't have to share the venue with any other party (we occupied the two upstairs rooms as one big room, there is another room downstairs). Our family really enjoyed the food and we both have picky family. The only critique was that we had arranged to have our cake sliced and served with the dessert (as suggested by the manager) but somehow this instruction was lost and it wasn't done. When we realized this, we asked to have the cake sliced and served as a part of the midnight sweet table but the staff person who was manning the cake did not appear to know now to dissemble the tiers and cut it up properly. We ended up taking the lion's share of 4 tiers of cake home. You can't expect it all to go perfectly. However, overall, the Estate had excellent food, excellent venue, excellent value and a very good experience with the staff overall. Highly recommend, wish we could do it again ;)", "business_id": "Fd2RUB_FhhCklEMTLZTmeg", "stars": 5, "date": "2014-08-27", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "BibzA2yOZw6kckE3erprcg", "review_id": "1iVNtp0fHEPi4fH_POCNSQ", "text": "Beautiful venue with the most superb staff and delicious food. Hub and I attended a family's wedding last weekend. We had such a great time. There was the antipasto buffet- fresh cheese & meat platters, spinach samosas, roasted pig, fried shrimp, shrimp cocktail, & fried cheddar balls. The 4-course sit-down dinner included: butternut squash soup, anti-pasta with a la vodka sauce, entree was either filet mignon & grilled chicken breast marinated in olive oil & garlic with mushroom peppercorn sauce served with roasted veggies and potatoes or salmon fillet in a lemon butter sauce with grilled chicken. I love the dessert- it was a tartufo with dark chocolate shell with a melted caramel center and chocolate ice cream. We were told by the bride that the owner's wife personally recommended the dessert. And of course the dessert table- wedding cake, various selections of cheese cake, chocolate cake, layered cakes, various petit cakes, fruits, and pastries. \n\nIt was an incredible wedding with an amazing rocked out band that reminded me of the Black Eyed Peas. Both lead singers were extremely talented. They can perform any song live- oldies, pop, hip-hop...you name it! The DJ skills on the other hand could use more work. \n\nLast but not least, we had so much fun making full use of the photo booth. It was so crazy that the roof fell on top since guests would over stuff the booth for fun. Crazy times and memories!!!", "business_id": "Fd2RUB_FhhCklEMTLZTmeg", "stars": 5, "date": "2013-10-16", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "5uiCy0vSIknuDEHc7yHRkw", "review_id": "vRItoLgCNhYbtRoRidp8ow", "text": "I was at a work training this week and was looking for something other than El Pollo Loco (what I usually eat when I need to grab a quick lunch in this area).  Our training had compiled a list of places nearby, and Jalapenos (Tio Freddys?) was one of them.  I had never heard of it and was with some other adventurous souls, so we checked it out.  I'm so glad we did!\n\nIt is totally a little Mom and Pop Mexican restaurant.  The food was solid and the service was amazing.  Both the wife and the husband (Tio Freddy!) came over to check on us.  The set up is similar to most places like this- you order at the counter and wait for your order to be called.  They actually bring it out to you here and help you out with salsa.  \n\nMy friend that is originally from San Diego was delighted that they had carne asada fries- something I have never heard of, but she said it is not often that she finds them in Phoenix.  I had a tostada and chicken taco- both tasty.  The chicken was all white meat which is a huge jump in quality.  \n\nThis place is in a very quiet strip mall, and I fear that not many people know about it (I've had trainings nearby several times over the last two years) so check it out if you are in the area!  A great little find for some quick Mexican food with awesome service!", "business_id": "IJrRJLKS7qxzzVUkh1U5iA", "stars": 4, "date": "2009-07-02", "useful": 2, "type": "review", "cool": 1}, {"funny": 1, "user_id": "Z128ihQea7BLPh2T9q9sKA", "review_id": "I1648FzAw2lG24qJ1my-ig", "text": "To think this place has been hiding around the corner from my shop for around 3 years.  I seldom go South and West from work but last week I was headed that way for lunch and spotted this place (Yelp has made me much better at seeing restaurants) and thought \"strip mall Mexican, need to check this out\".  \n\nThe place is brightly colored and clean.  The owner was bustling taking orders and serving tables.  It is set up as counter service only but the owner brings out plates and salsas when he has time anyway.  Interesting to note that all the regulars bussed their own tables and took the plates back to the counter, so I did too.  There are only 6 tables in there, each having 4 seats.  There is enough floor space to reconfigure a couple to make a long one.  If you get there during a rush there can be a bit of a wait for food as they is only a small kitchen.\n\nThe food was excellent.  I had carne asada fries and a fish taco.  I have not had many fish tacos but with Carrie's description of Baja style Mexican I figured it was a safe bet.  It was the best fish taco I have yet to have.  Lightly battered fish fillet on a soft corn tortilla with Pico de Gallo, lettuce and a bit of cilantro which I tasted before I saw or it would have been picked out.  The carne asada fries are a plate of fries covered over in marinated beef and then covered with guacamole, sour cream and shredded cheese.  I would describe the fries as fully cooked but not left in long enough to crisp up the outside, I would consider that limp as a stand alone fry but for this dish it works well.  I also had a medium orchata.  The food is served up without much seasoning, leaving the customer to modify it as he/she deems from the salsa bar.  I chose to leave my alone and was rewarded with food tastes that did not require hiding to make the meal.  There was no grease anywhere to be found.\n\nThis is definitely a place to try if you are in the area and want something a bit different than a 'bertos.", "business_id": "IJrRJLKS7qxzzVUkh1U5iA", "stars": 4, "date": "2009-09-12", "useful": 7, "type": "review", "cool": 4}, {"funny": 0, "user_id": "_CDP0zqXE3iqMYGitD_NjA", "review_id": "J-TBgHgXDB7qgweU-Tp8ig", "text": "I too was at the work training with Ayesha (see very first review) and like her I wanted something different than the usual fast food places nearby.  \n\nI'm an incredibly picky person when it comes to authentic Mexican food.  Growing up in San Diego, I grew up with some of the best tasting food around.  When I moved here I was unimpressed over and over again with the places I kept trying around the west valley and even the east valley.  At one point, I even swore off trying any new Mexican style restaurant altogether.  No more gross, greasy, no flavor Mexican food for me!  The Sonoran style food here just doesn't jive with me and my taste for flavorful Baja style food.  Yep, that's right...there's a difference.  Baja style is tastier with a lot more flavor per bite.  I have found that Sonoran is more bland and greasier.\n\nI was pretty skeptical when we walked into Jalapenos (Tio Freddy's).  But then I picked up their menu and saw they had Carne Asada Fries...a San Diego favorite!  Forget everything else on the menu, that is what I ordered.  It was delicious!  Not only was the food flavorful but Tio Freddy and his wife were amazing.  Even though it is a place where you order at the counter, they brought me my food, offered me sauce from the sauce bar, and came by more than once to check on how I was enjoying my food!  \n\nIt is a small place in a strip mall and I have never noticed it before, and I know others haven't.  If you want to try some great Mexican food at a really inexpensive price...try it out!", "business_id": "IJrRJLKS7qxzzVUkh1U5iA", "stars": 5, "date": "2009-07-05", "useful": 2, "type": "review", "cool": 1}, {"funny": 0, "user_id": "3oSWyq3y4BGtJ9xfyyH9og", "review_id": "VbXnpVjnIUGvaaSgLFugZg", "text": "The food here is wonderful.  Very authentic Indian and Nepalese food.  They have a wide variety of items.  Their prices are extremely reasonable and portions are good (actually loaded with meat). I've been to their all-you-can-eat lunch buffet (cheap at $9.99 a person) and for dinner.  Both times I've been very pleased with the food and the service.  Loved their tandoori chicken, butter chicken, lamb vindaloo, and curry goat!  The naan is great too!  The owner stopped by our table to make sure that everything was to our satisfaction (very friendly and pleasant) and our server was very friendly and attentive.  It's better Indian food than a lot of the other Indian places around here, in Richmond Hill, and a much better value too (you get a lot for your money and it's much cheaper than the competition).  The restaurant, itself, is charming and clean; I will definitely be going back again.", "business_id": "1eomYFLhoxC-y2PGnnNtlg", "stars": 5, "date": "2015-06-27", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "rvGQIM926N7IVerDpzxNUQ", "review_id": "MUlQGzqUqciJyMO1CB3Xvg", "text": "I like the food and their great customer service. Prices are affordable for daily buffet, just  $9.99 for variety of items. Great I will definately will go 2 times a week for my lunch.", "business_id": "1eomYFLhoxC-y2PGnnNtlg", "stars": 5, "date": "2015-05-05", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "AirTVnJxFaNsU5M3baZXQQ", "review_id": "17J-ecTQ8xFAPTVzwzO52Q", "text": "This place is very good.. Compared to Host which is nearby the food is better and even cheaper.. Moreover service is much better than host.. Portions are very good and would strongly recommend this restaurant.. Try their lunch buffet too.. It's a deal..", "business_id": "1eomYFLhoxC-y2PGnnNtlg", "stars": 5, "date": "2015-06-06", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "P239BrmNnjyQQ_waQ-yiqA", "review_id": "xIdL5aiP_OHgJnBaZ2bQWw", "text": "A hidden gem!  Everything was delicious!  The staff was friendly and made sure we were well taken care of.  Loved every item they had there especially the warm, fresh naan.  I will definitely be coming back.  It totally beats down The Host that's down the street from it.", "business_id": "1eomYFLhoxC-y2PGnnNtlg", "stars": 5, "date": "2015-06-25", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "87L_amkNITmdmLhuCgUZmA", "review_id": "Y2b1_47s6CfwrOYetRIBng", "text": "So the first rule of business says that keep your brand name intact and make sure ppl can relate to you by your business name \nBut I believe that's what went wrong here, They take over previous mgmt but didn't update Yelp business name\nThe new owner is under Punjab and I happen to be there as we were looking for Indian food in this area\nBuffett was good, Food was delicious but server was very reactive and had worse reactions for any questions / feedback\n\nI might try again if I happen to be around but not a must place to go", "business_id": "1eomYFLhoxC-y2PGnnNtlg", "stars": 4, "date": "2015-11-16", "useful": 1, "type": "review", "cool": 1}, {"funny": 1, "user_id": "uX4ay9X_87eiCvC5b8z-fw", "review_id": "E5bJettLZrF_EuVcWdZwdQ", "text": "This authentic Indian Nepalese restaurant offers an option for a la carte or buffet. Their dinner menu specifically offers an excellent variety of Indian cuisine, Manxhurian dishes and Nepalese cusine. My favourite personally was the one-of-a-kind tandoori chicken and the best saag paneer I've tried. Thumbs-up.", "business_id": "1eomYFLhoxC-y2PGnnNtlg", "stars": 5, "date": "2015-07-23", "useful": 3, "type": "review", "cool": 1}, {"funny": 0, "user_id": "rDDi1goME6SaXGyAO3SQmQ", "review_id": "9UvXc47eDw3CdcaOWHpYHQ", "text": "Went on a team lunch with ~ 14 people from the team. We tried the buffet and everyone pretty much enjoyed all the food - especially the $10+tax price tag. There isn't as much selection in the buffet here compared to some others in the area, but given the price that's kind of expected. All the tables are for groups of 4 so for bigger groups you'll have to split up or re-org the tables (and at max you can still only seem to combine 2 tables). The Naan was tasty, there's an even split of veggie and non-veggie options (like 4 of each), with a couple of sweet dishes. I'd like to give this place a 4.5 - I don't think it quite meets the \"5 star\" standard (in particular for me, it was missing both my favorite veggie dishes - malai kofta and shahi paneer) but its still really good.\n\nThe place is also very clean, according to one of the tips below they just recently renovated and renamed to \"Punjab Kitchen & Bar\" in case your favorite navigation app (or calling in and hearing the wrong name) confuses you.", "business_id": "1eomYFLhoxC-y2PGnnNtlg", "stars": 4, "date": "2015-10-13", "useful": 0, "type": "review", "cool": 0}, {"funny": 0, "user_id": "TH704PDluPOIL1CLRava7A", "review_id": "vaIUmMG68OATnTBL3RvkQw", "text": "This is my fourth visit! If you're craving delicious authentic Indian and Nepalese cuisine, look no further. Tucked away amongst several Asian inspired Restos, this place satisfies my tastes buds!\nThey offer a limited time offer of 2 can buffet dine for $9.99 ( which my sister and I will be back before the end of the month!! \nTastefully decorated and clean...they offer take out and dine in. \nI'm back for my usual Saag Paneer, rice and Naan....sooooo delicious!!!\nMenu has a very wide variety of dishes, very reasonably priced. \nWonderful & friendly service. \nDon't miss out on this Richmond Hill hideaway!", "business_id": "1eomYFLhoxC-y2PGnnNtlg", "stars": 5, "date": "2015-06-17", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "9JZ6VShZkwcbx0n43Y4LSQ", "review_id": "9nKARP7txiOWM67POb0pcQ", "text": "Looking at the few number reviews here made me a bit nervous going to try this new restaurant.  But at 9.99 for lunch buffet, it was certainly worth a try. Going in on the second Monday of June, I was completely satisfied with my meal. \n\nThe decor is clean, modern, yet comfortable. There are white table cloths on the table and the silverware is sparkling. The service was also very attentive and kind. Every time my glass was less than full, it was topped up promptly. The waitress had a smile on he face and genuinely seemed like she enjoyed serving us.\n\nThe selection is a touch smaller than India's Taste, but each item is done very well.  It is certainly now in the top three India buffets I have been in Toronto, and I have been to most all of them. \n\nFirstly, there is your typical salad selections, with a spread of various India pickles, chutneys, dips, and raita. Along with good steamed basmati rice, and papadums, these formed the basics in which most other buffets are the same.\n\nThe butter chicken is made with care, and very fragrant, not too spicy and has the aroma of cream and butter.  Absolutely divine.\n\nGoat curry was extremely tender. Did not fight with it at all. Even my toothless grandmother could chew it with ease.  The flavour was warm, inviting, and satisfying.  A good pair with rice and naan.\n\nThere were three different veggie curry selections this day: eggplant, okra, and mixed veggies. All three were unique and flavourful.  I especially liked the mixed veggies.  Seeing as this is a Nepalese and India restaurant (the owners are obviously Nepalese) the spicing is done a little differently than I am used to, but I am enjoying it a lot more.\n\nSamosa are probably the best I have had in Toronto.  Beats out all others I have had.  The pastry is just thick enough, crisp on the outside yet tender. The filling is spiced potatoes, but cut into very small cubes, much smaller than usual.  This made the filling creamy feeling, yet toothsome. A pleasant divergence from the typical gummy mash that others serve.\n\nThere is actually chicken biryani on the buffet, and I can attest it is better than most others that say they specialize in biryani. The fried noodles are also very good, utilizing their tandoori chicken as the protein.  It has a slightly smoky flavour in the background; what we Cantonese would call the 'qi of the wok'. I couldn't get enough of it.\n\nThe naan was equally impressive. Soft and tender on the inside, with a crisp and smoky crust. You can tell it was freshly made.  Better yet, it was brush with real ghee/butter! Most place use vegetable ghee (I can tell), but this place had naan with the distinct fragrance that only real ghee can give.  Kudos to them.\n\nAs a plus, they had shrimp on the buffet. Sauteed in butter and spices, they were done very well.  I am slightly allergic to shrimp, but I risked it anyway, to get a few pieces in.\n\nDessert was limited, but included my favourites: gulab jamun and kheer.  There was also fresh fruit (watermelon was in season and very sweet) and mango puree with fruits.\n\nLooking at their take-out menu, they even make momos.  I wish they had those on the buffet. As well, as some of their Nepalese specials.  Would make the experience even better.\n\nA stone's throw away from The Host, this place is definitely the superior competitor.  Come and try for yourself.  I can see myself being a regular at this point.", "business_id": "1eomYFLhoxC-y2PGnnNtlg", "stars": 5, "date": "2015-06-08", "useful": 1, "type": "review", "cool": 0}, {"funny": 0, "user_id": "4yGImSwdU9FZxVQIbZql3w", "review_id": "5Ylv_tgQsg2OwkNRTQ1_LQ", "text": "It's closed!  But it's reopening!\n\nThe new name will be Punjabi. I'll keep you posted....", "business_id": "1eomYFLhoxC-y2PGnnNtlg", "stars": 5, "date": "2015-12-15", "useful": 0, "type": "review", "cool": 0}]