[{"funny": 3, "user_id": "wnzfuir72IZFg5RAPOwWCQ", "review_id": "klVqdjXPM2aM8Y0RsDCPoA", "text": "Unfortunately, Yelp does not allow negative stars. I was very much looking forward to going to Modern on Melrose as my sister had raved about the selection and several purchases she recently made here. I was all set to help her select more furniture for her new home until I experienced a combination of disbelief, shock and horror. \n\nI was inside the store when I heard a man loudly say \"If you're going to start a sale, finish it!\" It took a few more seconds of loud voices before I realized an argument was taking place between two employees and not two customers, as I initially thought. The male and female employee continued to loudly argue, back and forth. Feeling very uncomfortable, I started to look for my sister. There were about four other customers and we all ended up outside as we all felt very uncomfortable in the store. \n\nAs I was walking out of the store to go out back, I heard the male employee say, in a tone that was beyond anger but instead violent, \"Don't you ever tell me to shut up! Ever!\" Shortly after, he walked past all 5 female customers, who had gathered out back, turned to us and angrily said \"Bitch!\" Not knowing what he was going to do when he returned, we decided to leave as we did not feel safe. \n\nIt is one thing to feel uncomfortable, it is completely unacceptable to not feel safe. The interaction between the two employees was the most unprofessional thing I have ever witnessed. The male and female employee were so caught up in their own negative interaction, neither of them offered any customer service. And after their argument ended, the female employee offered no apologies and still no customer service. \n\nToday was my first and last time in Modern on Melrose. How terribly sad for this store. I sincerely hope the owners get a handle on this and educate their employees as to what it and isn't acceptable behavior.", "business_id": "2LfIuF3_sX6uwe-IR-P0jQ", "stars": 1, "date": "2013-11-17", "useful": 4, "type": "review", "cool": 2}, {"funny": 5, "user_id": "B7ecAeAIrXg7sgmabS38pg", "review_id": "RAzbLYbgw3tNv8Tu0R7qmQ", "text": "Hmmm, what to say about Mint.\n\nOkay, if you are a girl and looking for clothes here, I'd say pass. Unless of course you have a tiny waste and are maybe a size 0-4 on a good day. If you are looking for funky earrings, it might be worth a stop, but the majority of their earring inventory was kinda weird and a little too 80's inspired for my retro taste. If you are looking for stellar quality (and priced accordingly) funky retro furniture, then definitely pop in here as their selection is really cool and there were a ton of pieces that I easily would have purchased. As for the rest, I'd say hit this store up every once in again and see what they have to offer and if they start carrying bigger sizes in dresses, lemme know :)", "business_id": "0czfEgv9KAD4VlIa7ANPWQ", "stars": 3, "date": "2007-12-15", "useful": 5, "type": "review", "cool": 4}, {"funny": 4, "user_id": "je5k8a3qIOM0VJE5MaxsfQ", "review_id": "dfL5TyVib8uZgxaNMwx7Aw", "text": "I remember really enjoying browsing through Mint (and their furniture friends Red) before, I love mid-century Modern (but what casually reading Dwell but highlighting Ikea pseudo-art bitch DOESN'T?) , I like interesting jewelry, I think the space is really intense, like I am in a dream of some sort.\n\nBut I went recently...and I just didn't like it. Sure, these are collectible pieces, goregous condition, the space is well cared for, I don't expect to afford these museum worthy pieces, especially at 11grand for a chair and ottoman (oh god, I hope the ottoman was included in that price....), but the affordable pieces of bracelets, earrings, clothing...um, it was a lot of the same items I saw here over a year ago...actually more like TWO years ago.....so, the inventory isn't very turnovering or fresh...so I guess Mint isn't so fresh?\n\nOverall, I was underwhelmed, I didn't feel particularly welcomed either time I was here, and the stock continues to center on polyster 70s clothing and BCBG tops (?) making an uneven style feel and chilly ambiance.  \n\nDefinitely not worth a stop.", "business_id": "0czfEgv9KAD4VlIa7ANPWQ", "stars": 2, "date": "2009-02-01", "useful": 3, "type": "review", "cool": 1}, {"funny": 7, "user_id": "i8hCMZN-0bHENsHZKHpC-g", "review_id": "6GBjCBVtPGsnQ67neAAkjw", "text": "Was boozin and cruisin with my canine comrade. Went all the way out to Hudson via Brecksville/82. Looking for anything to Yelp. Nothing. Not even in the strip mall I used to hit in Hudson on my dry cleaning route back in the day. There was a deli, but it opened at fucking 11! Who even wants to go to a deli after 11? Weak. Breezed through Peninsula. Winking Lizard? Bah. Ended up backtracking through Brecksville and I remembered an old friend. London Pickle Works! Was it still there some four years after I stopped in while house shopping? Yup. Incidentally, investing in a condo down there probably would have made more sense than buying a house in Lakewood. Live and learn.\n\nCozied up to the bar and ordered a Killians, plus cheesesteak to go(for pooch). Like the Unicorn, food was amazingly done before I could chug my brew. I could get used to this kind of service. The bar was all old men. Matt, I don't know how you do it. They were watching Fox news for chrissakes!! Total was eight dollars! Holy shit. I dropped a three dollar tip on that barmaid's ass. How could I not? A real meal at fast food prices, at fast food speed, served by someone not under house arrest with work privileges. Busted open the styro box. Big sandwich with mushrooms, onions, cheez and beef sliced so thin I swear it was a Steak'um. I never ate those as a kid, but I remember one time my friend had one in his bedroom where we were playing NES. He didn't want it, so we threw it all around the room. Fries were awesome. Also got a pickle. That's eight dollars with the beer, just to recap. Great value, nice location, old men. I won't wait four more years to come back.", "business_id": "4P-vTvE6cncJyUyLh73pxw", "stars": 4, "date": "2011-05-25", "useful": 7, "type": "review", "cool": 6}, {"funny": 3, "user_id": "24hyqUROHABynDLYTUpqkQ", "review_id": "vbuArRtzxYv6c359wj07mA", "text": "This place is weird.  So we were greeted by the hostess in front who looked like she was wearing butt pads.  No skinny Cambodian-looking girl would have an ass that sticks out ten inches from her back unless she stuck a basketball in there, seriously.  Then she told us to go upstairs because that's where the real restaurant is at and we were again greeted by another Asian hostess. While walking upstairs, you would feel like you're in a bank's safe box room because seriously, that's what it looks like, no joke.  Fun to play with, but weird.  Am I missing some sort of cultural significance here? \n\nThe place is dark with small tables, chairs and booths.  It took them ten minutes to hand us the menus after being seated which I thought was incredibly appalling because I'm sure they didn't forget about us.  They have candles on the tables which made it kinda uncomfortable because it seemed too romantic for our own goods (We were hungry and randomly walked into this place).  I ain't gonna lie, the food was good!  We ordered some noodles which tasted like mixed flavors of Chinese and Italian.  Surprise, surprise, it came in a tiny portion that can easily be confused as an appetizer.  WTF mang.  There were just too many selections on the menu (sarcasm) so I ordered an eye roll.  For more than a dub, it's not worth it.  But compared to other rolls I've had at other sushi places, this roll melted in my mouth with just the right amount of flavor, MmmM.  As long as its good, I like it.  \n\nI liked how our waiter came back to refill my friend's drink a couple times without being asked.  I like attentiveness.  I like staffs who pretends to be genuine as good as they're faking it.  Having missed our menus for the first ten minutes, the service is above average. \n\nEven if money grew on my orange tree, I wouldn't come here again though.", "business_id": "4uiijOUDzc-DeIb2XcKW_A", "stars": 2, "date": "2010-01-26", "useful": 0, "type": "review", "cool": 0}, {"funny": 4, "user_id": "fJ_qSZH_akvWzHUPMqab1g", "review_id": "d3zJSWMBlpBaYKXYKmTHTw", "text": "I feel compelled to update again.\n\nYES, THE HAIR IS STILL COMPLETELY OBLITERATED.  Some people wonder if electrology works for permanent hair removal, and it certainly does!  I almost was tempted to post a picture of my eyebrow area, but then I felt it'd be weird to have a Yelp cover page of a random swath of hairless brow.", "business_id": "78iZO7fwyQ_Bhq63p4uXxA", "stars": 5, "date": "2013-09-27", "useful": 3, "type": "review", "cool": 1}, {"funny": 4, "user_id": "wOGfOjBaP-lCS1NW_En2LQ", "review_id": "hnEB3NkryrZfG1_Tu58zdw", "text": "If I give Draft House Big Dogs 5 stars, the Big Dogs on Sahara deserves a 4 star review at least.  The beer is brewed at the Draft House location on Rancho, but its just as fresh here.  In fact, when the special brews run out at the Draft House, you can often find them here or at the Nellis location for another week or two.\n\nThe bar food is good too.  The menu is slightly different, but pretty much the same as the Draft House.  The only thing is that sometimes the restaurant has slow service on weekends.  This never used to be a problem, but lately when I have gone it has been.  However, after a few Dirty Dog IPA's, this is easily forgiven.  \n\nTry the cheese curds, and the philly cheese steak sandwich.  The fries are awesome too.  Overall, this smaller version of the Draft House has the best beer brewed in Las Vegas (at their Rancho location), and pretty darn good bar food.  This is a regular hang out for me and my coworkers.", "business_id": "1Lbq92b6B9z1FYk5mS2R9Q", "stars": 4, "date": "2010-12-09", "useful": 7, "type": "review", "cool": 5}, {"funny": 3, "user_id": "UYcmGbelzRa0Q6JqzLoguw", "review_id": "mLjXr-_-jz7Zmz_KvgEaEQ", "text": "On the look out for a new place to try for Sunday football specials, we decided to finally try Big Dog's. \n\nWe sat at the bar to be able to view a few of the games and were greeted warmly by the bartender. She was very friendly and helpful, guiding us through all the specials and giving her recommendations. We decided to start with a couple of pints of Leglifter beer and some hot wings. The beer was their own brew and a pretty good deal. The wings had a nice flavor and we enjoyed them quite a bit. We decided to order some more and went with the honey hot flavor, which were our personal flavor. Spicy, sweet and delicious.We also upped the ante with some Patron margaritas they had on special. Very strong, but still pretty good. \n\nOverall, the food isn't amazing but it was pretty good and the service and the deals were pretty good. Not the best place to view football, unless there are only one or two games you want to see at a time. They only have a few TVs scattered around and it's not easy to see all the games simultaneously. I'll definitely be back to try them again some time soon, though.", "business_id": "1Lbq92b6B9z1FYk5mS2R9Q", "stars": 4, "date": "2012-11-12", "useful": 6, "type": "review", "cool": 6}, {"funny": 5, "user_id": "QJI9OSEn6ujRCtrX06vs1w", "review_id": "uoo7pR86JYX02AlQvJ4RTg", "text": "For the past two Sundays, I've come here to hang out for a couple of hours while my Son is at a Church function.  I enjoy watching the Sunday night football game here and enjoying a drink or two.  Last night I decided to grab a bite to eat.\n\nI was dining by myself and wanted some finger food.  After browsing the menu for a few minutes, I decided to go with the Nachos ($10.50).  To wash it down, I had an Iced Tea.\n\nI watched the Giants/Bears game while I waited for my grub......it didn't take too long before it came....the waitress delivered the Nachos and they were a friggin' mountain of Nachos!  (see pics) Seriously.....I'm not opposed to large portions, but damn this thing could easily feed 4 people!  I was a little pissed because I didn't want to eat that much and the waitress didn't say anything.....also the menu didn't mention the gargantuan size of the Nachos either.  I reacted by saying \"Damn, that's a friggin' mountain of food!\".....she replied \"I know\"......well if you knew, why didn't you say something when I ordered it?!\n\nThis is where I am torn....do I knock off a Star because of this?  or not?  I personally feel that it's the server's responsibility to inform customers of stuff like this....especially when they see someone is dining alone and portion size is not mentioned on the menu.\n\nBack to the food....the Nachos were topped with melted Cheddar Cheese, Jalapenos, Guacamole, Sour Cream, Onions, Olives, Tomatoes.  The thing was so massive that stuff was falling off the edges of plate....another faux pas from the server is that she didn't offer me a smaller plate to eat my Nachos.....she expected me to pull pieces off this mountain and have it fall all over the table like a pig.  I tried for a few minutes but felt like a slob so I asked her for a plate, which she brought over right away.\n\nThe Nachos flavor wasn't spectacular, it was bleh.  The Cheese wasn't gooey....it was melted, but seemed to be sitting a little while because it was already coagulating and it was difficult to eat the Nachos without using a fork.  Also, it was top heavy with the toppings....meaning after the 1st layer of Nachos, there was nothing but bare chips in the lower sections.  What's the point of this dish then?  I don't know.....I felt bad because I didn't even come close to finishing it and it wasn't worth taking home......what a waste of food.\n\nI took off 1 Star because of the bad service.....still a great place to catch a game.  I've eaten here many times in the past with great experiences, but was an inactive Yelper at the time so those experiences are outdated.\n\nWill I return?  Because of my favorable history with Big Dog's, I will give them another chance.....next time I'm asking the server how large the portion is.", "business_id": "1Lbq92b6B9z1FYk5mS2R9Q", "stars": 2, "date": "2010-10-04", "useful": 10, "type": "review", "cool": 6}, {"funny": 4, "user_id": "pMefTWo6gMdx8WhYSA2u3w", "review_id": "EiiK6ayw26wEOb3bF8scqw", "text": "Seeing as there are reviews for Dine on L3 (Yorkdale mall) and Urban Eatery (Eaton Centre), I figure I would review the new food court in Square One which is going by the name of \"Food Central\".  It has the same concept as Yorkdale and Eaton Centre, as they give you real cutlery and dishes as opposed to the plastic ones.  \n\nCompared to Eaton Centre, and Yorkdale, this is a lot smaller, but there is still at least 20 places to choose from including some of the newer entries into the food court wars (Big Smoke Burger, Amaya Express, SU&SHI, Shanghai 360, Chipolte, Szechuan Express) plus the older ones (A&W, KFC, Manchu Work etc.).\n\nOverall, it's not a bad place to eat if you are on your lunch, can't decide what to eat or are just hanging out at the mall, but not worth a special drive (it is a food court after all right?)\n\nAlso, compared to Yorkdale, there's no special sit down restaurants close to the food court besides Earl's.", "business_id": "3Phhm4suJ-9fVakKXJSMxg", "stars": 3, "date": "2013-09-08", "useful": 6, "type": "review", "cool": 4}, {"funny": 3, "user_id": "TbhyP24zYZqZ2VJZgu1wrg", "review_id": "k9Th_Y14GNvDamuR5z8VEQ", "text": "I've been to Mt Everest countless times over the years for their cheap buffet lunch (believe it costs $10.99 now but back in the day it was only $8.99)\n\nTried out dinner here last week for the first time. \n\nI find the menu slightly overpriced. Most of the curries were $15 and that did not include rice or naan. Given this is the ANNEX and the decor/ambiance of this place is quite underwhelming, I think they are overcharging by a few dollars. Other similar type places with much better food (Banjara) have a more reasonable price point.\n\nMy date and I ordered the Dinner for Two special ($36.99) which was definitely the most bang for your buck. You get a platter of tandoori chicken, boti kabob and chicken tikka (two pieces of each), a lamb curry, mutter paneer, peas pulav and 1 order of rice and 1 naan. Some kind of rice pudding for dessert too.\n\nFood was pretty tasty, didn't blow my mind but was definitely good.\n\nService was bothersome for me - very spotty at this place. At times they were over topping off water every 5 minutes, and at other times we could not flag them down to get extra rice or the bill, etc.\n\nLunch buffet is still a great option!", "business_id": "0BJK4_RQnNiiXJcYPEgG3w", "stars": 3, "date": "2011-08-28", "useful": 5, "type": "review", "cool": 4}, {"funny": 3, "user_id": "ZS_SiPpiLocKfYNjRZTeww", "review_id": "OHQu1vhzCu_sr7vorsJIow", "text": "We waited for-ever.  Accompanied by a Nepalese friend we were here to try the Nepalese section of a mostly Indian focused menu.  \n\nThe Choyela chicken appetizer was fantastic; nice to try a different spice flavor than the usual Indian spices we're now accustomed to.  Khasi Ko Maasu goat was the Nepalese non-vegetarian entree I went with.  The menu de-emphasizes meat and lists it second; how dare they.", "business_id": "0BJK4_RQnNiiXJcYPEgG3w", "stars": 4, "date": "2010-12-08", "useful": 2, "type": "review", "cool": 3}, {"funny": 14, "user_id": "73DZUFYAXuycbJ_eEAox1Q", "review_id": "BNnYDdVMPHwHL80r4DfikA", "text": "With as imposing a name as Mount Everest, you might think that this Nepalese restaurant would be a place of epic food proportions. But instead of table-sagging selections of meat, rice, and heavy sauce, we left here after dining feeling full but not overwhelmed by the experience. It's a good place to come for creative and well-crafted North Indian food that will not leave a mark or make too heavy of an impression.  \n\nThe dishes we ordered included a delicious portion of Aloo Tama Bodi (\"Potatoes, bamboo shoots, and black-eyed beans cooked with mountain spices.\") and a vegetarian tasting menu for two. The naan was excellent, as other reviewers have mentioned. The service was efficient, friendly, and elegant. The wine was an Argentinian Pinot Noir from Patagonia, pleasantly different from the norm. It fit well the food that was familiar but with a slight variation in presentation, spice, and flavor that made things interesting without being too intense.\n\nI kind of liked the balance here. Nothing was overdone. Everything was savory and satisfying. It made for a very pleasant meal. And that's something to celebrate.", "business_id": "0BJK4_RQnNiiXJcYPEgG3w", "stars": 4, "date": "2011-02-11", "useful": 21, "type": "review", "cool": 19}, {"funny": 3, "user_id": "XEHZoTDWjw3w-gcQyYIe4g", "review_id": "AYwtdNJNAZvpM6kxqJeMxw", "text": "Maria was super nice and inviting. 5 stars for service and ambiance. This place was clean. The rest room was clean. \n\nThe chips and salsa were excellent, hot and chunky salsa. \n\nFood: I had the two soft taco meal with rice and beans. I mixed the tacos one with Chicken and one with Beef. The beef was carne asada on two small corn shells. Topped with pico. The chicken was chopped into cubes and was \"day old\" at best. It was not fresh. Topped with pico.\n\nThe rice was good but I have had better, the beans were ok but really lacked flavor. \n\nThe \"lunch\" was about 10 bucks and I felt cheated. Maybe I am not a Jalisco style fan?", "business_id": "29XtLRA0y7Nfi4eZF-ZI4A", "stars": 3, "date": "2009-12-10", "useful": 4, "type": "review", "cool": 4}, {"funny": 6, "user_id": "kCVPl2RumlSgSDx9PMfXDA", "review_id": "36sONrBJ8lFV6fDbxpC9iQ", "text": "So....You say you want authentico?? My family secret shhhh! This place is owned by a lady named Maria. We have dubbed this place just \"Maria's\" we have been going here for year's!! When the white folk's around me say let's go to Valley Luna I have to school them on what's real food. This food is pure Jalisco and it is what it is! If you want some good home style cookin' in this part of town I would stop in for a bite! You better believe that this place gets busy for dinner so plan accordingly or don't go at peak times for those who don't like crowds. This is a nice little place w a bar and tv's. My sibling's would live here if they could my sister swears by the green chili burro, not for the weak as it brings the heat. I don't eat meat so I get the norm cheese enchiladas, chile relleno, etc all super in my book. I will take pics soon in the meantime here is a recent write up about the place http://www.azcentral.com/ent/dining/articles/2008/03/20/20080320elconquistador.html\n\nP.S. Closed Monday's", "business_id": "29XtLRA0y7Nfi4eZF-ZI4A", "stars": 5, "date": "2008-04-23", "useful": 11, "type": "review", "cool": 7}, {"funny": 3, "user_id": "Q9mA60HnY87C1TW5kjAZ6Q", "review_id": "QiQlUN1Y51aG_gtuIiAmZg", "text": "This just in! This dirty dirty chain 'za (but come on... the crust is like deep-fried) location now has $7 walk-in specials before 4pm Mon-Wednesday. You know you want to hit it. \n\nNow I'm going to go wash my soul...", "business_id": "5ZQmIhBVOelUScK9UbSUqA", "stars": 4, "date": "2012-08-10", "useful": 0, "type": "review", "cool": 0}, {"funny": 26, "user_id": "zFYs8gSUYDvXkb6O7YkRkw", "review_id": "PE77K89-ELRxd2FuM8MocQ", "text": "\"Picks you up. Calms you down.  Coffee is the lifeblood that fuels the dreams of champions.\" ― Mike Ditka, Kicking & Screaming\n\nWaltzed into Hazelrock on Opening Weekend and I think I ruined someone's video/picture.  Oops?  I came here because my dearest friend told me to so I did!  I had snooped on their website and blog the week before so I knew I *had* to try the Ferrero cookie on top of some other goods.  Between the two of us, we had a cookie, a lemon bar that was recommended by the friendly barista with the cool hair, a macchiato, and an iced tea.  \n\nThe first sip of the espresso sent me straight onto Cloud 9.  It was rich, fragrant, and creamy.  It made Addiction stir and I was hooked by that vixen.  Girl, I will never give you up again.  The iced tea helped clean the palate as well as that super tasty and tart lemon bar.  Could this be fresh lemon juice?  If it was concentrate, it fooled me.  As for the Ferrero cookie, it was everything I imagined it would be and more.  It was crispy on the edges and soft and delicious in the middle.  Nutella and a very generous amount of hazelnuts decorated the top.  It got a tad too sweet with the ample amount of hazelnut spread but I imagine it being perfect with a foamy latte.  I wish they drew a tiny leaf in my espresso...\n\nThe coffee shop itself is very hipster industrial chic --- wood, steal, a bike, a marquee arrow, a mattress sans the cover and fluff, and glass bottles as lighting. It was very cool.  I like the concrete floors and all the reclaimed wood.  I could imagine a young Joyce sitting here with all her other art student friends, the WP Carey business majors working on their stuffy group assignments on the leather couch and arm chairs, and the regular Tempe resident grabbing a cuppa before work.  It's a large space with lots of chairs, stools, and tables for all. \n\nAnd if the drinks and pastries aren't enough to lure you in... they also sell snow.  SNOW!\n\n\"Way too much coffee. But if it weren't for the coffee, I'd have no identifiable personality whatsoever.\" ― David Letterman\n\n#Preach  #GiveMeThatBeanWater\n\n*** Featured in The Weekly Yelp, October 14, 2015 - Coffee Talk", "business_id": "0x2qB4R790SX3W4W8FQuWA", "stars": 4, "date": "2015-05-18", "useful": 37, "type": "review", "cool": 33}, {"funny": 22, "user_id": "M9rRM6Eo5YbKLKMG5QiIPA", "review_id": "Q71GCnterKVFlARdlVvcMQ", "text": "First visit was just OK.  Felt like I was sitting in a garage building.  The coffee and pastry bar sits in a corner far from the entrance doors.  Owners/management: please put up better menu signs to allow first-timers and those who do not know what's available to choose, instead of feeling pressured to order something fast at the cash register- the menu was on plaques placed right in front of the register.  There were a few pastries on display, but the ones that caught my attention were on one of the guest tables.  Looked like bruschetta, but with nutella and chunky nuts.  Apparently, these were being tested for an upcoming breakfast offering.\n\nI liked the cold brew tasting-- four cold brews of your choosing, for $6.  You then get to choose a 12 oz. pour of cold brew, or opt for any pastry/dessert from the case.  I chose Ethiopian, Apple Jack, Blackberry-Lavender, and Coconut.  Funny how the two I thought I'd enjoy the most (the last two) would be my least favorites!  I'd definitely order the Ethiopian cold brew again, and perhaps the Apple Jack with cream.  The blackberry-lavender was too tart, and I could only detect the berry, which was unfortunate, since I love lavender-scented anything: chocolates/truffles, ice creams/gelatos, shortbreads, soaps, and lotions, etc.  The house-made tiramisu was just OK.  Actually, I didn't eat much of it at the time, since I already had enough milk fat and sugar from the salted creme brûlée coffee here, and I ended up throwing away the leftovers at home that night, since most of the takeaway cup was filled with waxy cream filling.  The female rep here told the new guy that he must stress that everything here is made in-house, from the cold brews steeped with herbs, spices, and fruits the night before, to the hazelnut-chocolate spread and the caramel syrup and melted chocolate used in coffees.  \n\nI wished I'd gone with the huge chocolate chip cookie with the house-made hazelnut-chocolate spread, instead of the tiramisu...  I may come back for a second visit, but not before I check out all the other coffee shops I've bookmarked for years.\n\n#770", "business_id": "0x2qB4R790SX3W4W8FQuWA", "stars": 3, "date": "2015-08-14", "useful": 39, "type": "review", "cool": 36}, {"funny": 6, "user_id": "bpgbVPJcG-wQ4cNBcPPIxw", "review_id": "007u5zSRxQhZaF-vFcWQEA", "text": "Cheryl B told me about a new coffee shop that's pretty close to where I live, I'm always up to checking out new places, so off we went to try out some coffee and sweets.\n\nThis place is spacious! Love the light fixtures, they are too cool, the wall deco is great too, I'm sure most would just come for the sweets & coffee, but this place has a nice relaxed vibe to it that you just want to go head and have your coffee there, and just relax for a minute.\n\nAfter checking out the pastries on display I went with the chocolate vanilla bean cupcake and a salted brulee latte. The cupcake was heavenly, the buttercream frosting was just the right amount of vanilla, and the cupcake was moist and perfect. The winner though was the Salted Brulee Latte, oh that is a great latte, the torched of the sugar on top with the warm rich coffee below, it's a cup of heaven I tell you!\nGlad to have found a new coffee spot in my hood, I'm sure I will be back plenty of times", "business_id": "0x2qB4R790SX3W4W8FQuWA", "stars": 4, "date": "2015-06-01", "useful": 10, "type": "review", "cool": 9}, {"funny": 7, "user_id": "kc-rnN-ndnFTdHG4TfIgeQ", "review_id": "0iy3eeueTKOVIqowMwNBOw", "text": "If I would rather repeatedly shoot myself in the junk with frozen paintball pellets than go to a certain bar, then you know it must have a lot going for it.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2008-05-31", "useful": 3, "type": "review", "cool": 3}, {"funny": 7, "user_id": "Oay68SoCl5BcM4XAbt47zw", "review_id": "CSNU9cNiCQXIw_brGVsXbw", "text": "We can't stop here... This is cougar country!\n\nSeriously, this is such a cougar's den. Not just that, but this place has the biggest infestation of douche bags. You need a gas mask just to cut through the Axe, bronzer, and fumes of hair gel that linger throughout the air. If you want a visual of what this place looks like on the weekend, take a gander at: www.hotchickswithdouchebags.com . Click it. It's a real site and it's what this place and its patrons looks like. If you model your style of dress and behavior after VH1 reality shows, drop in for a swig and some high-fives from your fellow date rapists. If not, just pray in thanks that Scottsdale is where it's at and everything you love is where it is.\n\nThere's a live band that plays and I'm not a fan, mainly because it's not my type of music. They play alot of butt rock and the like... basically stuff you'd expect a cruise ship band to have jam sessions to in about 20 years.\n\nThe only reason I'm giving this place 1 star as opposed to none (if that were an option) is that the staff is pretty good. They tend to see that everything is going good and do a good job of bringing what you've ordered on time. Lastly, I feel bad for alot of the waitresses. How they put up with a crowd that takes pointers from episodes of Rock of Love and Tool Academy, I will never know.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2009-02-17", "useful": 5, "type": "review", "cool": 5}, {"funny": 6, "user_id": "zRRurs5wB7er42zvPktv9w", "review_id": "-G7dT6DCFsncKryYrjZGHQ", "text": "Barcelona has the worst way of letting people know that they're closed until mid-September!\n\nEverything was still up like they are still open, website, myspace, all with no indication of their closing. So yea, if you really want to piss me off that's the way to do it, be misleading and secretive about your business temporary closing. \n\nSupposedly, we were referred to PCL and someplace else, and were told to tell them that Barcelona sent us and they'd \"take care\" of us. Unless I'm getting free bottle service to make up for this blunder, I'm not interested!", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2009-07-04", "useful": 5, "type": "review", "cool": 5}, {"funny": 5, "user_id": "dIIKEfOgo0KqUfGQvGikPg", "review_id": "iQu5pgsbv_8aUMy4AQmMXA", "text": "Sutra no longer offers 50% off on Tuesday nights... but Barcelona does.\n\nSo, that's where we found ourselves meeting some friends tonight for dinner and drinks.\n\nIt was a beautiful evening, so we sat outside on the patio.  We went back and forth on using the heat lamps provided.  Chelsea was our server and she was sweet as can be but perhaps a tad bit on the ditzy side.  The guys seemed to admire looking at her (bustier) every time she leaned over the table, and I was nervous something was going to pop out.\n\nAside from that entertainment, the food was decent.  It was not amazing.  I had the chopped salad which was pretty good and big enough to share, followed by the sea bass (no surprise there) entree.  Jared had an 8 oz filet and Zack had a ribeye.  We all shared spinach and sweet potato fries as sides, and the guys each had dessert.  I didn't have any (ahem - wedding diet), but they seemed to be orgasming over the chocolate lava cake... the cheese cake and berry dessert also went over well at the table.\n\nWith the 50% off Tuesday special, this was $30 per person with tip.  For the amount of food we got, this was a deal, but had we payed full price? Not so much... \n\nIf I return, it will be on a Tuesday night for the 1/2 off special.  Other than that, I'm not really interested.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2009-04-01", "useful": 9, "type": "review", "cool": 6}, {"funny": 4, "user_id": "q5zFC4BW1xnIILAZNwbk1g", "review_id": "9urazmzLDBfGJBCKDTXPwQ", "text": "Oh, blessed Scottsdale. If only ye were as slick as ye has imagined. Therein lies the problem with Barcelona and her patrons.\n\nI've long heard this place was THE place to see and be seen in Scottsdale. I knew that wasn't true and had no plans ever to go there. But a birthday party for a fine young man fueled my trip on a Saturday night.\n\nThankfully, we arrived shortly before 10 p.m. --- ahead of many of the plastic millionaires and their shiny chariots. Being the lame, tongue and knuckle dragging fools we are, of course, men had to shell out $10 while women were spared. Once inside, we could see where it was all heading.\n\nIt's an older crowd at Barcelona than, say, whatever club on Mill Avenue in Tempe. But that's not to say they are grown-ups. In fact, it is a lot more like high school than anything else. The uncool cool people prance around while spiced up oldies make communicating with anything other than hand gestures and swirling hips worthless. The black-suited security guards talking into their sleeves every few seconds also offer a real --- if not short-lived and ultimately comical --- feel that this place is actually hip. \n\nIn a word: Underwhelming.\n\nMake no mistake about it, though, Barcelona is beautifully appointed. Leather chairs and sofas make for comfy private lounges for the lucky (or wealthy) few who occupy them. The sprawling patio is an excellent place on a late summer evening in Arizona. Multiple bars make for relatively speedy service. And the overall gargantuan size of the place makes the crowd seem less, well, crowded.\n\nBut alas, this is no place for me. By the looks of the joint, it's no place for diners either. Middle-aged partiers with bulging eyeballs and well- yet artificially endowed gold diggers, on the other hand, are apparently welcomed with open arms. Cha, cha, cha.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2006-10-01", "useful": 1, "type": "review", "cool": 1}, {"funny": 23, "user_id": "UmXzwFM2OkZHWJ5cJZlqkg", "review_id": "WbHGFXE7-nIoXfW2e8ZmCA", "text": "Lions and cougars and manthers! Oh my! Yep. I might as well have been on a safari....the cougars we're thick as thieves. We were here for an event and this joint was jumpin'! Thankfully, it must hold 10,000 people...it is enormous. Lots of different rooms, patios and lounges for the cougars to make their attack. I had VIP service so I can't complain about that. The food was a buffet and was actually quite good. Of course I could have eaten a dish rag and been happy as I needed something to soak up the free Patron. Yep. Free Patron. The crowd was typical for this neck of Scottsdale. Hello stereotype! Could you be any more accurate. I had fun mingling, people watching and leaving. Yep. Leaving. We made a quick escape after I was called a fag in the bathroom by some gelled up, steroided out cardboard head dude. Sorry, just cuz I tried to share a urinal with him. Jeez! What's up with that. Some people are so territorial! I'd go here again, for an event, but never, never for a night out. Adios Barcelona!", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 2, "date": "2009-04-28", "useful": 19, "type": "review", "cool": 19}, {"funny": 4, "user_id": "Iovy9ItislQQuQQVYHR1ng", "review_id": "akIoRd3R26HYQw56b8mOdw", "text": "All I have to say is......W.....T......F?\n\nScene: 6 people in their early to mid 20's walks into Barcelona. Half of them from New York, the other half from San Francisco (or San Fran as the folks in Scottsdale likes to say). Their mouths have dropped and they sit in udder amazement. A band from 1994 gets up on stage and tries to get the crowd of 40 year olds going.  With every song played, the folks from separate coasts, just stand there in complete shock....and then THEY DRANK because THEY HAD TO!\n\nThis place is oh so bad! OH SO BAD!!! Go if you need a good laugh.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2007-12-15", "useful": 1, "type": "review", "cool": 1}, {"funny": 3, "user_id": "CAshvtJZZSHySUQHqzlKgg", "review_id": "L5nMOOBT4Mmpuf5ZB85nMw", "text": "Damn, if this is not the perfect place to meet women. I read some reviews about cougars, well I like milf's. For one, for this fantasy to come true it better happen soon as, I am 36 years old, and the age I prefer to date for long term decreases by the minute. Anyway, this place has people of all ages that is what I liked best. I do wish they had a place of this caliber in the bay area then I wouldnt be single. Then, again, I never met a girl friend at a bar. Anyway, Arizona women are better than Miami. The jury is still out on Texas which most of my guy friends seem to say are the top of the states. Arizona women are amazing.  Okay, back to barcelona if you want to indoor lounge they got it, want to hang out outside got it, want to dance on the dance floor got it. Whatever type of person you are, this is a great place to go if you are the type who can make your own fun.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 5, "date": "2007-04-19", "useful": 1, "type": "review", "cool": 1}, {"funny": 5, "user_id": "sYQyXDjGaJj7wfaqz5u8KQ", "review_id": "bND4TPVQNyx2M75QUQAXqQ", "text": "Barcelona is pretty swanky, there's no doubt about that.  The decor is upscale, with a cascading fountain running down a wall of pottery, jars and other items right when you first walk in the doors.  This is definitely the secret hiding place of sugar daddies and their 21 year old girlfriends, as well as 50 year old women that have been botox-ed to the point that they now look like painfully taut 35 year olds.  Despite all of this, I like Barcelona.  The dance floor is always packed and they play pretty good music.  Personally, I'd rather listen to a good DJ than a semi-cheesy cover band, but hey- I can't win them all.  I made the mistake of coming here for their New Year's 4-course dinner and I still regret it.  The food wasn't good enough for the price and I almost lost an eye when our waiter tried to open our bottle of champagne.  All in all, I think Barcelona can be a fun night spot but I prefer Old Town Scottsdale night clubs to this one.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2007-01-22", "useful": 3, "type": "review", "cool": 1}, {"funny": 16, "user_id": "YORJi2JtQg5Mo4nmKOXzag", "review_id": "TwoZuk6hjydWxjF1W8Kwdg", "text": "So, up until tonight, I've primarily used Yelp as a dating website. A girl thinks my picture is kinda cute. I write reviews that demonstrate I passed high school English. She writes/compliments me... I'm cocky/funny. I offer to explore downtown with her. She turns me down. I try the next girl. Same result. But the intent is always there. After this review, I doubt I'll have to worry about succeeding with any woman who ever reads this review ever again. \n\nSo check it out. I'm a male slut. If I meet you in person and I lay my lines on you and smile in this certain way that I've discovered makes women look away and blush, you'll definitely give me your number and probably go home with me within one more encounter. That's my M.O. It works. If it ain't broke... \n\nI'm not altogether proud of the man I've become but I'm not going to stop either. From what I've gathered from movies and television, my life is fairly wonderful. Unless me writing about it causes some cosmic/karmic shift and I get disfigured in a car accident tomorrow and lose my mojo, I have several strong years of carousing left in me.  \n\nOk, all that said, I've been reading on Yelp about all the \"cougars\" who frequent this lovely establishment. I define a \"cougar\" not by age, but as a woman who knows what she wants (me). So my buddy, who's also a man about town and similarly successful in this field, and I decide that this is our new watering hole. We've been there twice in the last two weeks. Guess how many woman we've taken home or who have taken us to their homes in the last two weeks? Four. Guess how many we've given The Business to... The same four. Guess what our batting average is... .1000\n\nUsually, I need to take a woman out one more time before The Business is exchanged. Sometimes more if she's particularly prudish. Barcelona is where The Business is the understood currency. I like The Business. So if you're reading this and you think I'm scum, I used to be you. I've \"evolved.\" If you're reading this and you're a woman who knows what she wants, shoot me a message. And if you're reading this you think I'm lying because you didn't get laid last time you went there, I am willing to show you how. But you'd never take my advice because you don't believe me or think you'll succeed next time on your own or think I'm an ass for writing this and you don't want to meet me on principle. I don't blame you. I feel dirty. But just a little. Mostly smug.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 5, "date": "2008-06-16", "useful": 8, "type": "review", "cool": 8}, {"funny": 3, "user_id": "Df2qZ03Mjgl1NqprgWXcgA", "review_id": "8xAfq9aXNcc8wN6uP3QIRQ", "text": "So the guys are a little older.  What dont you people understand about free drinks?  I walked into this place on Friday night and was offered a shot of patron before I even got through the entry.  \n\nGod Bless Barcelona.  \n\nThis place has been reviewed so much so I'll stick to the basics:\n\nIts huge.\nLots of comfortable couches/tables/standing room.\nDance floor thats really really packed.\nCover band.  Think Zowie Bowie but lame.  \nOldER crowd, but not creepy-old and not too-poor-to-buy-girls-a-drink old.  \nGreat table/bottle/VIP service\nAWESOME, spacious, asthetically pleasing, modern bathrooms with an attendant.  No lines.\nNo cover for girls, $10 for dudes.\n\nIn summary, aside from the really bad band (if you can even call them that, they just sig over popular music...music that I like, but the singers are so cheesy and weird it freaks me out), I loved Barcelona.  Definitely worth the 15 minute road trip north from Old Town.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 4, "date": "2007-08-20", "useful": 2, "type": "review", "cool": 2}, {"funny": 5, "user_id": "DWbcEKJDBR6vPaNxb00sgw", "review_id": "pXJazWRqNQ3qUwdlFAVLLw", "text": "No doubt that this is Scottsdale's ultimate cougar den. I ended up here two nights in a row because it has a huge outdoor area, it's easy to move around, and hey if a cougar wants sink her teeth into me, and she hasn't escaped from a geriatric home then I wont hold it against her.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2009-05-01", "useful": 6, "type": "review", "cool": 4}, {"funny": 5, "user_id": "WPw0LDmsT5HLc5itX8YLVA", "review_id": "UYNrrxJf3FLeisyo0m4_-A", "text": "This place sucked. First of all, as an out of towner- I have never seen so many old fake orange women in my life. I felt like I was in an episode of The Real Housewives of Orange County: Scottsdale Edition. I am just bitter because I came here for a joyous occasion of a wedding VIP party, but I was denied access at the door because I was wearing tennis shoes. Gimme a break, my shoes weren't some  salvation army shoes. They were quite expensive \"plaid original chucks\" that had character and style. They still denied me in after I complained saying I have never had a problem in LA, SF, NY, VEGAS but clearly Scottsdale I do.  \n\nAnyways, after the $10 cover charge, they gave me a ticket for a free fish taco or something. Sick. I don't want to eat fish tacos at 11pm. This place reminded me of Cheesecake Factory after dark. Everyone is old. They don't have a DJ, instead they have a band that does bad covers of bad songs like \"Wind it Up\" and \"Glamorous\". \n\nWorst part? I saw old guys wearing phat farm tennis shoes and mandals. How the hell are mandals allowed at a club but trendy kicks aren't?\n\nAvoid this place at all costs unless you want to get picked up by a lonely horny housewife of Scottsdale. The themesong to this place should be Nelly's MANEATER.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2007-03-23", "useful": 2, "type": "review", "cool": 2}, {"funny": 5, "user_id": "045lA8joqI1vPm0wLgZPKw", "review_id": "8JqLUP07OyXNl_UYHZSe2g", "text": "I have actually never eaten here and from what I've heard I'm not missing out. \n\nI haven't noticed as many cougars here as everyone else. I tend to see more barely legal females with men who could be their fathers or grandfathers. But anyway, I always have a great time at this place. Yes, the dance floor gets extremely crowed, but the band is great!\n\nMost of the guys here adhere to the following dress code: Spiky hair, orange tan and Ed Hardy or Affliction t-shirts.\nMost of the girls here adhere to the following dress code: Spiky heels and not much else.\n\nIt's a great place to people watch.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2009-03-05", "useful": 4, "type": "review", "cool": 3}, {"funny": 5, "user_id": "Q9NlyapDA97_NA0qaq8w0A", "review_id": "f2S4qKbSPn6L0ZjQWSFtVQ", "text": "Don't quite think it's bringing sexy back....\n\nWhat can't I say about this place that hasn't been said before?\n\nFood:  they have a new chef, so apparently they heard others talking badly about the food.  I actually really enjoyed the food and our server was awesome.  Ridiculously expensive?  Yes.  Good to my tum?  Definitely.  We decided to try a little of everything so in our menu was the Seared Ahi, Chopped salad with bacon dates, Tenderloin empanadas, Mozzarella and heirloom tomatoes, and sweet potato fries.\n\nAhi was seared perfectly.  It had a slightly spicey musky sauce with it.  Very yum unless you don't like raw-ish fish.  Bacon dates are my new favorite.  Mmmm.  Empanadas were good, but you didn't really get much of a meat flavor.  Caprese was wonderfully fresh.  Sweet potato fries....god yes.\n\nPrice per dish around $9 to $14.  You're looking at about $25 for an entree.  Drinks were relatively decent in price...but $12 for a glass of wine.  My favorite Reisling is $12 per bottle, for crying out loud.\n\nThis place is AWESOME for people watching.  Young things with massive...melons of flesh, meat-head men trying to look cool, 50+ women trying to outdo the young things, and 50+ men ogling everyone creepily.\n\nThe singers on stage were quite cheesy.  Great choice in music, but I'd much rather listen to the DJ version than a upscale karaoke.  No dude, you're NOT bringing sexy back with those aviator shades and check shirt.  And whoa...the female singer...honey, you need someone else to do your extentions.\n\nWierd mix of dress code:  from prom date to stained t-shirts.  Ugh.\n\n$9 for a pack of cigs (I don't smoke, but I heard) and you can order a drink in the bathroom.  Wha?  So you can drink and pee all night long and never have to leave the room?\n\nFunny, funny place.  I'd probably go again mainly for the abundance of people watching.  This place doesn't get more than three mainly for the cheese factor and the prices.  At least sugar daddies abound at this place.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 3, "date": "2007-08-26", "useful": 2, "type": "review", "cool": 2}, {"funny": 10, "user_id": "VfZ62dxri2CxsSBXgrzqsg", "review_id": "3t7j4w2pG2JiY-Znacqblg", "text": "I wish I could give this zero stars, in the sense that this place is not negative or positive, it just Is. Barcelona is the simultaneously the most awesome and the very worst club I've ever been to.\n\nThere's some sort of Zen shit going on in this space where I should have been having the worst time of my life, but instead I was madly in love with this bar and its motley crew of inhabitants. \n\nThe \"band\" is wildly entertaining yet I also want to open up on them with a flame thrower.\n\nThe men are equal parts hot and cheesy.\n\nThe drinks are strong but taste awful.\n\nI would go here once a month if I lived in Scottsdale, as a sort of barometer for...something. As long as I know a place like Barcelona still exists, I know that the universe still holds mysteries that I'm not ready to comprehend.\n\nBut you'd have to be fucking nuts to eat here.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 5, "date": "2008-10-09", "useful": 3, "type": "review", "cool": 4}, {"funny": 3, "user_id": "9xCdyIxzfV6J-Out6XR2FA", "review_id": "PdvZX0tILXa5DHTydPmJeg", "text": "Massive Scottsdale scene - fake rich guys and plastic women.  Went here for a business meeting and we both ordered steaks which came out extremely rare and had to be sent back.  The waiter forgot other stuff and the food was mediocre at best considering the prices.  The restaurant is run very strangely ... bouncer type guys with ear piece walkie talkie things come around every 15 minutes to make sure everything is going OK ... but in a harassing way.  This place may be heaven for some, but if gaudy large scale club atmospheres with an annoying crowd ain't your thang... stay away.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 2, "date": "2006-12-11", "useful": 2, "type": "review", "cool": 2}, {"funny": 5, "user_id": "uqJ0kCrmZOEZzbt4qV3ODA", "review_id": "WmB7c0AVaPmhctggsaBP8Q", "text": "Oh Barcelona, I visited you with low expectations - and you didn't disappoint.\n\nA lovely young woman of my recent acquaintance invited me here recently for the purpose of attending a birthday party for a friend of hers. Neither of us would have come here otherwise. \n\nIf you're thinking about going, don't do it. If you care for the deets, read on. If not, stop reading here and.... go somewhere else. Please. \n\nWe show up at about 8 for drinks and dinner. I wasn't in a drinking mood, my date's Appletini was pretty Appley but the amount of liquor was tini. Must be why they call it an Appletini. Hm. Highlight was the bread brought to the table - the pretzel rolls were the highlight of the evening. How sad is that?\n\nNow... the place is called Barcelona. Barcelona is a city in Spain. THe closest thing to a Spanish dish on the menu us Paella, otherwise it's a steakhouse menu with a few obligatory pasta dishes. Totally uninspired.\n\nI ordered the ribeye, medium rare. It came out medium, and the glaze and whatever else they put on it were awful, save the two onion rings. I doubt this was USDA prime beef. It just wasn't that good, and the room was so dark that it was hard to see what I was eating. The shoestring fries side were a pleasant surprise - a giant mound of crispy potato. \n\nMy date had some kind of pasta with shrimp dish. The shrimp were overdone, the pasta was, ok. Denny's pasta is OK, too, and let's face it, so is Chef Boyardee... So don't read too much into the complement. \n\nBarcelona. Spain. The place doesn't look that Spanish on the inside. There is a giant mural on the ceiling, dim lights, it reminds me more of Las Vegas cheese than Spain. \n\nWhile you dine, there are two Scottsdouche (or is it Douchedale?) types crooning back and forth to each other on stage. Is this where failed American Idol contestants try to relive their moment of glory? I don't know. They made a reappearance later, singing along with a DJ to a selection of bad 90's pop music with the occasional 80's party jam. \n\nThe crowd is douchey. The food is awful and on the pricey side. The service, spotty. \n\nIf you're coming for the thing Barcelona is famous for, you'll find a lot of it. If not, stay away. Far, far away.", "business_id": "4P1h3LKaCkgQL5dSy5d9gw", "stars": 1, "date": "2009-03-09", "useful": 5, "type": "review", "cool": 4}]