[{"funny": 3, "user_id": "re1BRRyIgy6k7QpFUW1zVA", "review_id": "42lKg_DQg2Y855wuK2CafQ", "text": "I agree with my fellow poster - cool funky little indie shop with organic free trade delicacies, local goodies, wares,  artesians, and is happy to display them on the walls or wherever they will fit.\n\nYa, it's best kept secret alright - tucked away on Schomberg's main drag - not visible from HWY 27.\n\n.. and comes with a side order of \"across the pond\" UK English Wit ;)   ... you'll see... heh heh\n\n(there's a scottish store a few doors down if you're hankering for a home made steak n kidney pie)\n\nYou're gonna have to GPS this one folks...\n\nalso be sure to stop by in the summer too for organic icecream with real cream... and visit the local farmer's market every other weekend just around the corner.", "business_id": "5m-WYdtIUgfvZdStqmSiRA", "stars": 5, "date": "2013-01-17", "useful": 3, "type": "review", "cool": 3}, {"funny": 4, "user_id": "WeVkkF5L39888IPPlRhNpg", "review_id": "191cbG8V31zqprgKmo2aNQ", "text": "Huzzahhh! I had to drive quite a distance to find it but at long long last I have found the hip indie coffee shop of my GTA dreams - and it's in Schomberg? \n\nThe Grackle Coffee Company is located on Main street in the historical village of Schomberg (north-west of Aurora). If you're not careful you could walk right past this place as the tiny re-purposed house has only a tiny sign to let you know it exists.\n\nEntering, I was greeted by a crowd of locals, a room full of oscillating ceiling fans, and an artistic decor that would make an Toronto Hipster weep with joy. Independent art for sale adorns the walls, as well as freshly baked goods, preserves, hand made scarves, a giant set of antlers AND a friendly shop dog making sure everyone is enjoying their day (adorable)!\n\nI didn't get a chance to dine on their dessert and sandwich menu (diet) but I did grab a cappuccino on the recommendation of the tattooed barrista (told you this place was cool). The cappuccino was amazing! The beans were a unique custom, freshly roasted/ground blend, and the latte/foam art on the top was art all by itself. $3.15 for the Cappuccino (taxes in).\n\nEveryone here is incredibly friendly and I certainly recommend you come here if you're looking for great service, good food and a little peace and tranquility in the middle of your day. \n\nCash Only!", "business_id": "5m-WYdtIUgfvZdStqmSiRA", "stars": 4, "date": "2013-01-16", "useful": 4, "type": "review", "cool": 5}, {"funny": 3, "user_id": "ndtF7YJNv02TevAyhrxJlw", "review_id": "UMRrjA_FoIWSPqOSF4bjxw", "text": "Let me first clarify that I am Vietnamese.  All Asians know when they hear a restaurant is good you gotta ask, \" Did a white person tell you that or were they Asian?\"  Come on you know you do it too. And i'm not trying to say that people of the light skin can't appreciate Asian food ( I have a non asian friend who eats lots of asian food I wouldn't eat) , but come on when you've been eating it almost everyday for your entire life you know a little bit more than someone who's had it a dozen times.\n\nMy review is a little skewed in the fact that I haven't had too many things here.  I've really only had  cha gio bun tit nuong (Spring rolls, and grilled pork with noodles) , ca kho (fish cooked in a clay pot) and canh cua (sour seafood soup).  Let's start with the good.  The cha gio bun tit noung is good.  The cha gio particularly is good, I wish they would give you more they cut up one sorta small one but it's tasty.  I'm sorta jealous that mine cha gio isn't as good, i can't figure out what it is too.  The nuoc mam is pretty good, they julianne carrots in it ( pet peeve when they don't at a restaurant) and they serve it with green onions that are in oil ( hate when restaurants don't do this either).  It's tasty this is what I typically get when I go here.  The other two not so hot, the ca kho was crazy salty, and the canh chua was just blah.  I'm not sure what they are known for at this place, but that's how a lot of Vietnamese restaurants are they make a few things that are great and they specialize in those and just have the other stuff just cause.   \n\nI haven't eaten the Pho cause I am a snob to pho.  I really don't eat Pho anywhere, I really only eat Pho made by my dad (My dad used to have a pho shop)    I will maybe eat Pho in Orange County, NYC, or Toronto.  I'm North Vietnamese we came up with it I know my Pho.   and I'm a purist in that I think Pho should be eaten plain, no hoison no siracha, only a bit of lime.  So sorry no pho review, but it didn't smell bad. \n\nAnd all these reviews about the decor and untidyness.  Well that's just Vietnamese restaurants, and to be perfectly honest I don't think it's too bad even considering it's a Vietnamese joint.   Ha, and I know more than one person who says when choosing between two Asian restaurants in Cali, they go for the one with the lower letter rating.  I am included in that group : )", "business_id": "A2Sq5rBHCvO38tHXqAiAkw", "stars": 3, "date": "2009-01-31", "useful": 2, "type": "review", "cool": 3}, {"funny": 3, "user_id": "kc-rnN-ndnFTdHG4TfIgeQ", "review_id": "xjRAWiYDOB1wTeXondqHHA", "text": "This place is such an easy target, its like piling on the fat, pimply kid in high school.  Here's what you need to know\n\n1.  Girls in uniform with things out that you can sadly and quite accidentally observe\n2.  They have hamburgers, hot dogs, and beer\n3.  Beer is PBR or the Champagne of Beers.  No other choices.\n4.  Diner style seating, long high tops, patios with umbrellas\n5.  Three high quality HD LCD screens in a decent, elevated spot.\n6.  There will be some shiesty characters present. \n7.  Don't go here with your girlfriend.\n\nTheir screens and ironic selection of beers earns 'em two stars.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 2, "date": "2008-04-07", "useful": 5, "type": "review", "cool": 2}, {"funny": 10, "user_id": "jzjcDOIaiJOP5mci0FEStg", "review_id": "KSGPbcXIET_AYJugFxLkIA", "text": "That girl isn't wearing any pants.  Wait... none of these girls are wearing pants.\n\nDon't look down, don't look down, don't look down.\n\nUncomfortable, awkward, unneccesarily eye contact-y hamburger.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 3, "date": "2008-05-21", "useful": 2, "type": "review", "cool": 2}, {"funny": 4, "user_id": "yrGIgk5eaWy-eewLNv4KHQ", "review_id": "HQsmo-zyaa0GvVe_MSeLlQ", "text": "I went in here a couple of weeks ago thinking this was a cool fast food joint with burgers and beer, etc. I was surprised when I walked inside to see waitresses dressed real slutty like. Now, I'm definitely not complaining about the concept, but puh-leez employ a better selection of waitresses.\n\nThe burgers come with pickles and chili. I asked for a burger with no pickles or chili. I was served a burger that included pickles and chili. Oh well, I was hungry and in a hurry. The $8 burger sucked even after pulling out the pickles ( the chili wasn't anything special). It was like chewing on a hockey puck.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 1, "date": "2010-09-21", "useful": 4, "type": "review", "cool": 2}, {"funny": 3, "user_id": "ZyNaPQFOsaKOOLHTFVAdZw", "review_id": "DWiSgCtmR3feCeqXfmdXGw", "text": "I'm giving this place two stars because the food isn't THAT bad, albeit horribly overpriced and obviously not grilled to order.  Now, if I were giving stars for the number of times I unintentionally saw my waitresses... ahem...unmentionables, this place would get eleventy one stars.  I know it's a gimmick, but I really don't need or want to get a full view of my waitresses crotch while eating.  There's a reason strip clubs have buffets.  Nobody wants naked people serving them food.\nSpeaking of food, the burgers are eight bucks.  Eight freakin bucks.  You realize that that's about how much a burger at delux is?  Of course, the sides don't come with your eight dollar burger.  They're a la carte.  So you want a burger, fries, coke and maybe a tip for your half-naked waitress, $15 easy.  Save your money and go to Chuck Box.   The burgers are better and the employees actually wear clothes.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 2, "date": "2009-02-02", "useful": 6, "type": "review", "cool": 4}, {"funny": 12, "user_id": "5jn8w3DQTYiZ606epjYqBQ", "review_id": "sHYmeuK3Wka5bI4N7a3jQQ", "text": "I didn't come here for the anorexic Asian or the brunette who lacked personality. I didn't come here because they show off their rib cages.. I came here to eat. \n\nThe place is a gimmick inside a gimmick. They only offer PBR and Miller High Life. Their sodas are in bottles, with the Coke being Mexican glass bottled coke, which as we all know is fuckin' delicious. \n\nThe menu consists of Single 1/2 lb. burger, Double, Triple, hot dog, french fries or onion rings. \n\nThe burgers start at $8, going up $2 increments for every towering patty added. Fries or Rings are extra. \nThe god damn burgers are  monstrous. With a double being probably 6\" tall. But the Chef in me was a little puzzled at the timing of the food. The cook must of been bending the laws of thermodynamics because I got 1 lb. of cooked ground beef that was hot mind you, in 8 minutes. That tells me that they have the burgers \"sandbagged\" in the back. (Sandbag is a culinary term for partially cooked and ready to go.)\nThe burger comes dressed with chili, American and Swiss cheese, and tomatoes. \n\nI paid $14 for coke, Double Burger and order of fries. Not \"too\" bad. Tax is included in the prices. \n\nI'd come back again, with my Ol' man. The food is guy food and the flagrant arm touches the 19 year old servers dish out is enough to keep my old man breathing another day...", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 3, "date": "2009-01-22", "useful": 9, "type": "review", "cool": 7}, {"funny": 3, "user_id": "-0IiMAZI2SsQ7VmyzJjokQ", "review_id": "ePpc0LNGFpj9SXIox1Ll3g", "text": "On another road trip of gallivanting through Arizona, this time with another friend in tow, he asked to go to the Heart Attack Grill which he had been aching to see since we told him about it a couple years ago. \n\nWe drove to its new location in Chandler, where it was apparently closed for several days as it was trying to get a full liquor license. \n\nOur friend was dismayed as he really wanted to try the burgers (Seriously. No interest in the girls whatsoever. The guy is all about his meats). My boyfriend and I then remembered that the Heart Attack Grill's previous location was still open for business as its own T&A eatery.  \n\nWe'd eaten there once, around Christmas '07, before it had a name or a theme. The girls were wearing whatever costumes they could find, be it French maids or Catholic school girls, as Dr. Jon and his nurses had just packed up and left for Chandler. \n\nThe food tasted almost identically like Heart Attack Grill's then and still somewhat does now. \n\nThe Grill Next Door isn't bad, but its gimmick isn't as amusing as Heart Attack Grill's. It's almost like another take on Hooter's with the theme skewed more toward tacky and redneck in a space that looks like it used to be a Jack in the Box.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 3, "date": "2009-08-17", "useful": 4, "type": "review", "cool": 3}, {"funny": 3, "user_id": "YihBX_t432RRXOm-d7iZyw", "review_id": "l201hWYQH9LerkvSQgaYXA", "text": "Horrible beer selection.\n\nOverpriced burgers that taste like SPAM. \n\nLots of bare ass cheeks. This wouldn't be a bad thing if I didn't see them sitting on the same vinyl covered stools the customers use. I'm not a germaphobe but I really don't want to sit in the same spot thats already been marked by a sweaty bare ass that I'm not familiar with. \n\nI gave an extra star only because they have coke in a bottle.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 2, "date": "2008-09-23", "useful": 3, "type": "review", "cool": 3}, {"funny": 6, "user_id": "m-g1t6HXtcOu_DgQhAXjEw", "review_id": "t0LrSwPPtif4SDK5kint0g", "text": "Ugh! After an afternoon spent at home depot picking out doors and faucets for our first house, my lovely and I had worked up an appetite.  We knew we wanted a patio, probably a brew, some lunch and a comfy table to discuss the handful of paint swatches we had in tow.  So, Tempe was the answer until on our way there we noticed this retro looking hamburger joint with a Miller High-life banner hanging in the window.  We decided to skip the drive and go for it, there was even a patio.\nWe walked up and the first thing we saw was a freaky mannequin dressed in a stripper/\"nurse\" outfit placed in the window of the 500 sq ft building.  As soon as we entered the front door, it became clear that the mannequin wasn't the only one sporting this skimpy attire.  The waitresses also had on cheeky skirts, white fishnets, and boobs popping out of their blouses.  This was a sorry attempt as the class of the place left me feeling like I was at some Mesa dive bar, or better yet Band-Aids with burgers.  Creepy men were scattered throughout the tiny place drooling.  Just when I thought it couldn't get any stranger (or funnier!) I spotted the makeshift  bulletin board of the waitresses (all 2 of them) with 50+ pictures of them complete with handwritten captions, and numerous old creepy men like the ones there that afternoon.  It was hard for to believe this place was real, or that someone actually took it seriously!\nWith grumbling bellies and confused looks on our faces we decided to order a couple of PBR's (either PBR or High-life the only 2 choices of brew), and took it to the cement patio.  After a brief glance at the one page menu: Hamburger, double, hot-dog, or fries, we decided to chug our 3 buck beers and find another lunch spot.\nSumming it all up, my bf said to me \"I'm sure the burgers would've been good, I would just never eat there\", followed by \"Hey, they're just trying to make a buck\".  \nTry harder...What a waste of a great location.", "business_id": "3TintmVPo4Xu2drJ_iRpRQ", "stars": 1, "date": "2008-04-06", "useful": 7, "type": "review", "cool": 3}, {"funny": 9, "user_id": "w-w-k-QXosIKQ8HQVwU6IQ", "review_id": "t4mvHpg-i6mWTzdct7a-xw", "text": "***Like Wynn's The Drug Store, The Cosmopolitan's Vitals offers a pretty good variety of upscale packaged savory snacks and sweet treats; it is noticeably smaller than the mini gift shops and convenience stores at Bellagio and Wynn though***\n\nLike most Las Vegas hotels on The Strip, The Cosmopolitan offers both free valet and self parking.", "business_id": "F-aEq4SXwDCe8fRKcF42CQ", "stars": 3, "date": "2013-01-06", "useful": 10, "type": "review", "cool": 10}, {"funny": 14, "user_id": "TQo2DFe6O6LWALv_awgcCQ", "review_id": "T9GNLzIWdukHar4syFwWFg", "text": "I dunno if I have horrible taste or if everyone else is wrong, but the decor in this place is RIGHT UP MY ALLEY!  It's a cross between trips to grandma's house for some cookies, and... well... a trip to my OTHER grandma's house for some cookies. Except, you see, they don't ONLY have cookies. Oh No! They have sammiches!  Mass varieties of them. Types of sammiches your granny wouldn't dare to build for you on a sunday afternoon.\n\nMy buddy, Groovy P, and myself have been here on two separate occasions, and I also took my wife here once! I know, I know... I spoil her sometimes. Let me tell you, if you want to taste some of the BEST pasta salad on this good brown earth, order the seafood pasta salad.  You won't be sorry.  That is, of course, unless you are allergic to seafood.\n\nThe roast beef sammich is sometimes on special here, so that is what I usually get.  Watch out! If you underestimate this one you WILL be sorry. A single bite into this unearthly delight and I lose all control of myself.\n\nPair these two items with a drink and a pickle and you will be going back to work a pleasure ravaged ball of contentment. Hey! Grammy never gave me a pickle with my sammich! What was I missing!\n\nP.S. They have drive thru!", "business_id": "C1aGdueHoFXKcy-yaLoUWw", "stars": 4, "date": "2008-09-09", "useful": 10, "type": "review", "cool": 11}, {"funny": 3, "user_id": "dIIKEfOgo0KqUfGQvGikPg", "review_id": "dYw_YuaONMYzkx1wvorO3w", "text": "Time for an update...\n\nI must've been in a generous mood when I wrote my original Pugzie's review.  I've been back a couple of times, and I'm still a fan - it's \"A-OK\" or worthy of 3 stars in Yelp terms.\n\nAll 3 of those stars are for the food... the ambiance, bathrooms, service, etc... are just eh.\n\nThis is not a gourmet eatery... it's more the place you would go to when in a hurry or just need some nourishment of sorts and don't care much about atmosphere.  I'm sure I'll be back, but it's for sure not making my top ten favorite lunch place list anytime soon!  But kudos to Pugzie's for their history (they've been in business since 1981) - and as I said, I'll for sure return on occasion - it just won't be a regular in my lunchtime rotation!", "business_id": "C1aGdueHoFXKcy-yaLoUWw", "stars": 3, "date": "2009-08-02", "useful": 7, "type": "review", "cool": 5}, {"funny": 6, "user_id": "HtCPdVujYJAZF4FKr-C9Lg", "review_id": "JyI4VJNctDRlIi3yHR94dQ", "text": "So after coming here for the first time the other day, I'm thinking about starting a monthly \"Golden Girls\" fan club meeting and having here at Pugzies, anyone want in?    Wow, they have tried to keep this place unique with the entire building pained in the brightest teal blue you have ever see. The floral patterns throughout the place just want to make you run out and buy some Velcro walking shoes!\n\nAnyways, the food is great. A half sandwich is more than enough, I don't know any people that could eat an entire sandwich in one sitting.\nPlenty of sides to choose from, pasta salads and the like.  Several soup options with a few daily specials.\n\nThis place is open at 10am (my lunch time) so I'll be here about one a week from now on.  Why have I never been here before?", "business_id": "C1aGdueHoFXKcy-yaLoUWw", "stars": 5, "date": "2008-06-07", "useful": 5, "type": "review", "cool": 3}, {"funny": 3, "user_id": "Z128ihQea7BLPh2T9q9sKA", "review_id": "R1t3iuI-fWUjju5QDsdH_A", "text": "I had lunch there yesterday with some folks as part of this month's Yelp Office Hours.  It would fit right in in a retirement community. Right from the monochrome outside paint to the interior.  \n\nI had a grilled cheese sandwich and a cup of clam chowder.  Both were good.  But I think overpriced.  The menu lists the grilled cheese on\" fresh baked sourdough\".  The bread was fresh, but it was French.  Turns out you get the same bread if you order white, French or sourdough.  Not the first time I have run across this.  Some of my dining companions had meals that looked a little more substantial.   The restaurant was nice and clean.  Seating was open and airy and not packed in, even on a Friday.  The overall impression was Meh.\n\nSo why are they so successful?  Everything on the menu is edible.  There seems to be plenty of parking.  Remember when fast food restaurants all had 6 or more lanes?  Well these folks still do and two separate sandwich making stations.  They know how to fill orders in a hurry for the downtown lunch crowd they cater to.  And everybody I dealt with knows how to smile and be friendly and at least seem like they enjoy being there.\n\nIt by itself is not enough draw for me to drive to but I would not put up a fuss if that is where someone suggested to meet.", "business_id": "C1aGdueHoFXKcy-yaLoUWw", "stars": 3, "date": "2009-08-01", "useful": 3, "type": "review", "cool": 5}, {"funny": 4, "user_id": "hddbff7JsR4Wb273XmE4NQ", "review_id": "AdfVpNqvAyhCxesLmS-F5A", "text": "I feel sad to say this...because I know it is locally owned by a small family...but yucko!  I went there to lunch hesitantly, but my friend wanted to go there.  \n\nThe place felt old and dirty, too big for too few people and too quiet.\n\nI had the egg salad sandwich.  It was bland and boring and served between two slices of stale white bread.\n\nMy friend got a chicken salad and I could tell it was disgusting...she barely made her way through it.\n\nThe ice tea was ok....but it was really disappointing and I fear it is on it's last leg unless some changes are made:(", "business_id": "C1aGdueHoFXKcy-yaLoUWw", "stars": 1, "date": "2010-09-29", "useful": 8, "type": "review", "cool": 5}, {"funny": 3, "user_id": "dz7izpJ1dOlaOKbsqF6j2w", "review_id": "u98JOWFdD3TYLYT4CHE_pg", "text": "All of the excitement of eating at a cafeteria deli counter mixed with all the ambiance of visiting your great aunt at a Florida retirement home. \n\nGet ready to enjoy cold cuts or chicken salad on cold bread with as little condiments or additions as possible for three times the price you would pay if you just went to Fry's and made it yourself.\n\nThen plop yourself down and enjoy the louder then necessary ramblings of vintage Phoenicians at your choice of either the inside dining area that is somewhere between a Laughlin casino buffet dining area and a senior citizens hospital cafeteria; or the outside patio where you can soak in more lime green then is safely recomended by the FDA.\n\nAn Arizona tradition. For some reason.", "business_id": "C1aGdueHoFXKcy-yaLoUWw", "stars": 2, "date": "2009-03-24", "useful": 2, "type": "review", "cool": 1}, {"funny": 8, "user_id": "tJ1qdNdG0tZywbgH9uw9qw", "review_id": "-irwcFSu_PZ0fIYATFZM7w", "text": "I don't like sandwiches.  It's not that I don't want the carbs from the bread.  I mean, if you do this thing called exercise, a sandwich once a month isn't going to kill you.\nAnyway, they get a star simply by having a vegetarian option.  It's made with feta, which added another star.  It's nothing spectacular, though.  Lettuce, tomato and chopped mushrooms with a light ranch dressing.  Meh.  The other star was for having 12-grain bread.  Hard to come by.\nIt's pretty expensive for a freaking sandwich.  With tax, I paid $6.73.  For a sandwich.  No chips, no drink.  Just a sandwich.\nIt's so close to work that I'll be back, just not often and not because I really crave Pugzie's.  It just beats Subway or Chompie's or Blimpie's is all.", "business_id": "C1aGdueHoFXKcy-yaLoUWw", "stars": 3, "date": "2009-10-14", "useful": 11, "type": "review", "cool": 9}, {"funny": 4, "user_id": "ily1SwEn7vpFVX1Jt3FdzA", "review_id": "Fb8LgrwUZnOsvXqjy8F3wg", "text": "What an excellent Italian restaurant.  I cannot figure out why no one else has written a review yet...\n\nRegale is located inside the Excalibur Hotel and Casino and as of this writing is only open Friday-Sunday evenings.  It is an excellent middle-high end Italian restaurant with very good food.\n\nI happened upon Regale after meeting my mom and grandma at the Pai Gow table, asking of course, if they were ready for dinner.  About 5 hands and 100 dollars later, it was decided that I would buy Italian.  I was not disappointed.\n\nMy grandmother and I ordered the Taste of Italy special (Soup/Salad, 3 mini portions of lasagna, chicken parmigiana, and fettuccine alfredo, and tiramisu for !!19 bucks!!).  My mom ordered a side order of meatballs with a tomato/mozzarella salad..  The house salad was served with an Italian vinaigrette and was delicious.  The tomato/mozzarella salad was even better as I was 'begrudgingly' assigned leftover duties.  For the entrees, all 3 were excellent.  As I was already stuffed, I had my portion of alfredo, and smaller portions of the lasagna and chicken (and mom's leftover meatballs).  All 4 were excellent, the lasagna being especially tasty.  But then came the tiramisu.  It was incredible, and probably the best tiramisu I've ever had.\n\nAll in all the ladies and I enjoyed a great meal at a relatively inexpensive price tag.  The next time I'm at Excalibur I will definitely make a point of coming back to Regale.\n\nEditor's note:  I misspelled every Italian word at least twice.  Auto-spellcheck is a really nice Firefox feature.", "business_id": "F2daTLKFb2-hG5ysrJIQ5Q", "stars": 5, "date": "2008-11-04", "useful": 4, "type": "review", "cool": 5}, {"funny": 3, "user_id": "0UI9KTPdtkwl9lMdMT-Sgg", "review_id": "yzLvrlt6OFlyJhiq9dOKgw", "text": "The Room Store was not our first pick for buying new couches but they seemed to be the only ones in the valley that carried what we liked that was in our budget.  (don't get me wrong, there are amazing sofas and sectionals all over town but $5,000 plus for one is not \"doable\" for us).  The sales staff is very nice and can answer all your questions without some lame-o runaround like we got at some other stores.  \n\nSo we picked a really great leather set (sofa and love seat) and did the no interest thingy, it was a loan set up thru a bank, we didn't realize it was going to be done that way but whatever, we paid it off with zero interest b/c you CAN NOT and I repeat CAN NOT be late on a payment or else you end up paying for all interest and more.  These zero percent interest things can be tricky but with diligence and proper payment scheduling, it can be done.  Just watch it.  Don't be a foolio.\n\nSo once the first set was paid off, it was time to buy the next set.... a beautiful leather sectional.  Again, searched all over town, didn't find one we liked that was in out budget.  Went to the Room Store AND VOILA!  there she was )yes, the sectional is a she, she is too pretty to be a boy).  SO here we go again, another year of stressing out to make sure to NEVER miss a payment and we can say we survived the \"zero percent interest\" scam. \n\nWe are receiving the new one this weekend, but in the past, the delivery was on time and it came in perfect condition.  I am hoping for the same tomorrow.  \n\n***FYI-- Furniture business is down right now, so it might be a good idea to purchase some if you need it b/c they have more wiggle room to sell you at a good price.***", "business_id": "DkfuZHLg1QLYHlYwqLpxfA", "stars": 4, "date": "2008-08-15", "useful": 8, "type": "review", "cool": 5}, {"funny": 3, "user_id": "oUst55rUuv2nKEQ0FgJ5GQ", "review_id": "7MdiRdCGHWFC2HvhqouxvQ", "text": "Large selection and big showroom. This location used to be a Kay Bee Toy store a couple decades ago. Still has that vibe and plenty of room to run around with your Lego cars attached to a string.\n\nWent here looking for some New Leather for the living room. Been to most of the other stores including the really expensive ones off of N. Scottsdale Road. Most of the cheaper stores have either really thin leather or a mixture of cow parts and plastic like cheap sausage casing. The more expensive stores in Scottsdale are very nice but out of our current budget.\n\nCame in knowing what I wanted and met up with Jett at the front door. Just like the airplane. He was very friendly and most informative. I told him what I was looking for and what I was expecting and he took me directly over to a few choices that were just right. Nice!\n\nWent home and got the wife and came back that same evening. I typically know what she wants. The biggest issue is that I am tall and she is a bit vertically challenged. Found a Couch in a style she liked with a matching Chair in a slightly different style that fit my larger physique. 100% top grain leather for a reasonable price and no monkey bidness.\n\nDelivery was just when they predicted. Noticed a small defect in the stitching on one of the items and called customer service. They were happy to send out a replacement the SAME DAY to correct the issue. \n\nAsk for Jett and tell him Mr. Mark sent you. SCORE!", "business_id": "DkfuZHLg1QLYHlYwqLpxfA", "stars": 4, "date": "2013-06-30", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "b4Dvi7D0LkrJcyzEsP0w4A", "review_id": "tQXzECqeYxH1l0d3ETWidg", "text": "Went to John Anderson's near my work location for lunch which is kinda still unknown. John Anderson's looks very much like your run of the mill small neighbourhood diners. They serve breakfast, lunch and dinner eats of the diner variety.  It's in a location where this type of food is severely lacked, so they have a niche here.\n\nNow I got a quick homeburger combo with added cheese which cost a very reasonable price of just under $6 after tax (drink not included). The burger does take a while to make so make sure you're not in a hurry like I was. I believe if you can, call and order ahead for pick up cause the wait was about 10-15 mins.\n\nNow once I got back to work to eat my lunch, the burger was literally drenched in grease.  Now I know burgers aren't the healthiest food available, but let's be honest... I wasn't expecting this.  The wax paper that was used was pretty much dripping in grease and the fries... well they're also of the greasy variety.  They are the thick cut fries and weren't really crispy at all (I had some fresh on the way back to work).  So they were deep fried without any REAL purpose as you probably could have baked them and would have turned out the same.  \n\nFirst bite, not bad... but I got a feeling the grease played a huge part.  The patties weren't dry (grease) and they did give me a ton of toppings.  I got the traditional garnish with ketchup and mayo.  The taste was there, but if you can feel worse than McDonalds, here's your winner.  I wasn't thrilled with the fries as I think they were deep fried without any purpose.  They were a soggy and uninspired mess.  The only possible redemption would have been, if it was a poutine, maybe... but c'mon fries not crispy, sorry not feeling it.\n\nSo overall, John Anderson's isn't horrible.  I mean if you're a healthy type I would say stay far away.  If you can feel worse than McD's, here's the place to visit.  I haven't tried their breakfast or dinner, so who knows maybe it's better for those meals.  I think if I am really in need of grease, I would come back.  Cause it wasn't bad in that regard.. the flavour was there and it's very reasonably priced.  But for this level of unhealthiness, I think I rather go to something just as horrible like Popeye's Fried Chicken, but that's my take... what's yours?", "business_id": "UUT3f05dbse6ar-2Ws5GUA", "stars": 2, "date": "2011-08-03", "useful": 4, "type": "review", "cool": 4}, {"funny": 3, "user_id": "CvIEHZF79KLrpNachZzDjA", "review_id": "5ZMpN6wd9TmyBlAj5ILynA", "text": "GROSS. So disgusting. I don't even know what to say, other than never coming back here again.\n\nWe had breakfast here on Sunday morning. Next time I'm taking the bus to Dufferin and Steeles and going to Cora's....\n\nI don't know why I didn't just buy a carton of eggs and some ham and made his myself. The eggs were normal, the sausages were small, the place was DIRTYYYY - the floors looked like they have never been washed and it smelled like a Detroit crack house... \n\nThank you, John Answerson's, for not giving me food poisoning... I'm actually really surprised.", "business_id": "UUT3f05dbse6ar-2Ws5GUA", "stars": 1, "date": "2012-10-22", "useful": 3, "type": "review", "cool": 1}, {"funny": 10, "user_id": "BlKCEQcc03mNdLA1pVG-XQ", "review_id": "cACXP5MlHh8D-UfJllRCEw", "text": "As many of you loyal Yelp readers know by now, I'm in town to help my brother recuperate from surgery. Being the giving soul that I am, I agreed to shop, cook meals, as well as other less glamorous tasks.\n\nToday's mission led me to this aptly named store to collect the ingredients for tonight's dinner of chicken picata & a bottle of white wine. I thought that this menu sounded gentle for a guy that had recent intestinal work done.\n\nAn interesting side note: This store has a very large beer cooler housing dozens & dozens of beers from around the world. If I would have had winter clothing on, not just my stylish Elite '08 hoodie, I might have settled in for some illicit on-site drinking right then & there.\n\nSeriously, wear sturdy shoes, this place is big!\n\nPhotos:  http://www.yelp.com/biz_photos/Sjw7C2DrT5InBQNfRZt1DA", "business_id": "H3yWdDu1Gnxkhx8DrOUEWQ", "stars": 4, "date": "2008-12-16", "useful": 15, "type": "review", "cool": 14}, {"funny": 3, "user_id": "BYHm-dCBHRtiUDgOfFgLhw", "review_id": "-xeu4dAYUBDN72vJF_KtuQ", "text": "Clean and HUGE!!!!!!\nI was looking for flesh to char on open flame but didn't see anything on sale that would slake my zombie like hunger....", "business_id": "H3yWdDu1Gnxkhx8DrOUEWQ", "stars": 3, "date": "2012-09-17", "useful": 1, "type": "review", "cool": 0}, {"funny": 6, "user_id": "9gZ4pQHdK6v8xMLig6EEFA", "review_id": "rXZ-gjUEv8LW0NsMAOfjNg", "text": "Hot Topic has Miyazaki gear! My teenage son is super hard to shop for. Fortunately, there is Hot Topic, and what teenage boy does not need more T-shirts? This store has cool fan tees with prints from Studio Ghibli, Steven Universe and more. Although the shirts are on the pricey side from someone who prefers to shop second-hand. These make great birthday and Christmas gifts. The store was well-organized and the staff were efficient and polite. Can't think of a birthday gift for a teenage boy, check Hot Topic out!", "business_id": "OivhGTXE97VQy3k2y4TEzQ", "stars": 4, "date": "2016-05-28", "useful": 6, "type": "review", "cool": 6}, {"funny": 4, "user_id": "TVkU2gHhe05v_lgsE_NccA", "review_id": "hyLXH0AEU4tZtH4YMPvMzw", "text": "Back to school shopping what can I say? Not so fun for sure but meh it has to be done. So here I am in teenage land & am happy to report I lived. The staff was helpful & quick which is all I ask of staff really. What else could they do? give me a scone or latte? Nope I'm good. So thanks Hot Topic for being one of the few stores that was the least painful for back to school shopping.", "business_id": "OivhGTXE97VQy3k2y4TEzQ", "stars": 4, "date": "2015-08-21", "useful": 5, "type": "review", "cool": 6}, {"funny": 3, "user_id": "TryfbZaaGtedncOMq9k86g", "review_id": "_tUCphTEO0g6jJzYYacnaQ", "text": "2 out of 3 times, this isn't my magazine.  But then that 3rd time it is SO good, I wonder if I just missed something the other times.  I'm thinking it must just be hitting topics on those other times that I have no real interest in or something because I can never quite put my finger on what I don't like when it's not good, and when it is good, it's often the topics covered, and they way they are covered that gets me.  \n\nAs of writing this the mag out at every Coffee shop and trendy bistro is about design.  I'm in love w/ the edition.  Love. Great in-depth articles with designers that are doing big things both locally and nationally.  A wonderful interview/review of the new Phx Art Museum (Lovingly referred to as PAM, which I'm sure will stick in some circles.)  But next month?  I may flip through it while sipping on my Chai, but I will most likely not even bother to take it home.  Who knows for sure.  Maybe it's the models who I often wish to either put in a drug treatment center, force feed cheeseburgers or look like they need therapy deeper than Dr. Phil can provide.  \n\nMaybe it's the fact that even their self description on their web site javamagaz.com uses the word \"hip\" far too often.  Anyone that obsessed with hip will just never be hip, and sometimes their trying, is just trying.", "business_id": "3sVoCRDBRBuL_njT2LaNyA", "stars": 3, "date": "2007-03-05", "useful": 2, "type": "review", "cool": 1}, {"funny": 3, "user_id": "Xj9-p-_zm37ALyR1Qq34fQ", "review_id": "SpVEWFBDrMuYsYNmOP60Pw", "text": "Paradise Bakery &Cafe at The Falls at Ocotillo is always -- always -- busy. That's usually a sign of greatness in a restraunt. Unfortunately, in Southwest Chandler, it's more a sign of the dearth of quality eating establishments... but I digress. \n\nAt Paradise Bakery, all of the menu items are made fresh daily, and it shows. The service is generally good, although sometimes the staff still seems unprepared for the crowds. My favorite menu item is Irish oatmeal served in an oatmeal-cookie bowl. Try it. It's much better than the overrated croissants and muffins.", "business_id": "-YfDhpfSesaoEPWWJvlKQg", "stars": 4, "date": "2007-01-24", "useful": 1, "type": "review", "cool": 1}, {"funny": 3, "user_id": "z-xURZKh4i-OnIzBN3cK_Q", "review_id": "ba4vzZr1TQT_rH3BCX0yFg", "text": "Ahhh, the Decatur! Went there on Thanksgiving day with my boy Dahmer and was plenty surprised by the hospitality. They actually had a complete turkey dinner spread out on the pool table, available for free for everyone. Home made by the local clientele and delicious! Huge beer mugs and a decent tap selection, as well plenty of local characters. Highly recommend this classic dive.", "business_id": "OWaa5zRoKoPj0uEH2nkwKQ", "stars": 5, "date": "2010-08-24", "useful": 2, "type": "review", "cool": 3}, {"funny": 7, "user_id": "BGzavA_ddMr-jGmhArv7fg", "review_id": "m0_pu5rpe-lCl6_i9gon5g", "text": "I can't believe I never climbed these steps before in search of Toronto's best shawarma. I popped in here late last night for a handheld snack I could jam into my mouth en route to a concert. Wrap & Grab delivered. The service at the counter was very warm and friendly, and the guys whipped up some hot and fresh falafel balls for our order. I gotta say, I really enjoyed it. The ingredients tasted fresh and the structural integrity was above average.\n\nThey also offer chicken, beef, tuna and veggie shawarmas, lunch/dinner plates and salads. There isn't a tonne of seating here, but it's not cramped. And for the amazing prices (three dollar fidy cent per falafel wrap), I will be coming back soon.\n\nObligatory Title Pun: It's a WRAP! (Bad Pun Police: \"GRAB him!\")\n\nMenu Readability: Imagine Comic Sans, now make it 4.5 times worse.\n\nNeed to mention: They're a juice bar too? Apparently they offer juice and smoothies; I'll check it out.\n\nWhat this place teaches me about myself: That's right officer, I did the pun. And I'd do it again.", "business_id": "0tMhUM4FJy-onBd8ppUDng", "stars": 4, "date": "2010-11-02", "useful": 6, "type": "review", "cool": 9}, {"funny": 3, "user_id": "W8MlgzACF88yMeWNxQNiRw", "review_id": "RIDrkW_0WjzkeMCxDvQT2g", "text": "A bit out of the city center but close to the highway, which is all that we needed it for anyway. You have to drive through a short stretch of not-quite-trailer park neighborhood even though it's visible from the highway. I like it because it's brand new and therefore clean, but I'm sure in a year or two it'll be properly grotty.", "business_id": "6hIWPCdWD180v7qoHPGFCA", "stars": 3, "date": "2010-12-13", "useful": 0, "type": "review", "cool": 0}, {"funny": 4, "user_id": "77wo69hNeqoPVBRRLzO1hw", "review_id": "3W_wNm1IQw5Bqy5SRoBB_A", "text": "VooDoo Beach is now open daily at 10am.\n\nThe pools here feel more like a decorative piece for a tanning salon than anything else.  Everyone was getting their tan on but not their dip on.  TG4SB, at least the small kiddies took advantage of the waters.  Hey, maybe everyone was just digging on the DJ's jamz...maybe.  You can hear the music all the way up from any poolside/strip view rooms.  My ears are still pulsating...\n\nThank goodness for the adults only pool.  Too many kiddies around for Spring Break...", "business_id": "17V-PM_2t0QIAvU0euBovg", "stars": 4, "date": "2011-04-25", "useful": 3, "type": "review", "cool": 3}, {"funny": 6, "user_id": "HyAAsCY79JtNBjjU7pn_dQ", "review_id": "tzLCL-dQuxJdhe4lpWPrYg", "text": "VooDoo Beach is an impressive and beautiful pool located in Las Vegas. This spot has a few different pools to pick from and scenic views all around from the hotel view, to the palm trees and waterfalls around and even sand to give the beach feel. VooDoo has a great ambiance to get some sun, make a splash in the water, and just overall relax and take it all in. There was DJ spinning up on his deck when I came and the bartender here was awesome! 4 Stars for fun times at VooDoo Beach.~", "business_id": "17V-PM_2t0QIAvU0euBovg", "stars": 4, "date": "2016-06-26", "useful": 12, "type": "review", "cool": 13}, {"funny": 3, "user_id": "Bl2N1Lxp3DODFmnAdhiCfg", "review_id": "EAmfKhTz3q3-Gzfg0ebalw", "text": "This review is solely for JOSE who works at Cruzan island bar. He's a very rude guy! Very bad bartender with terrible customer service.", "business_id": "17V-PM_2t0QIAvU0euBovg", "stars": 1, "date": "2016-07-06", "useful": 0, "type": "review", "cool": 0}, {"funny": 5, "user_id": "NfU0zDaTMEQ4-X9dbQWd9A", "review_id": "Lmoceo3y0AD8jn4oQ4EbFQ", "text": "OK, I admit it. I'm no theater guru by any stretch of the imagination. I'm purely an supporter of the performing arts, and I love seeing shows at the Cleveland Play House. \n\nFirst off, they totally make up for being on the pain-in-the-ass-to-get-to east side of Cleveland by providing ample, and close parking. I'd like to personally thank them for that. I mean, theater tends to be a wintertime activity for me and I do not find joy in journeying through the blistery cold of Cleveland, thank you very much. \n\nSecondly, the venue itself is just awesome. You walk into the huge atrium with a bar and snack stand. Hello, wine. Hello, live theater. Have you met? Oh, you're best friends? That's what I thought. The staff was super friendly and trust me, they know their stuff! I know it's custom for them to come through with the standard flashlight escort to the restroom, etc., but these people seem to go above and beyond. I noticed and I appreciated. \n\nThird, the shows always sound interesting and I know they're hand-picked by the Cleveland Play House. They try to find a mix of compelling dramas, cheeky comedies and more. Even one-man shows! There's always something new and fresh. I saw a few shows, but one that stands out was Emma. Such a fun and touching story, acted out brilliantly. Like I said, I'm not expert, but this show had my attention the whole time. If you know me, you know how hard that is to accomplish. Bravo, Cleveland Play House!\n\nBeyond all this, Cleveland Play House is involved in the community and in social media around town. They're always having contests, interacting with Clevelanders and giving out tickets. I really appreciate their effort to branch out and get new theater-goers out to see a show.", "business_id": "AsktFvI950JNROlcDtcMJQ", "stars": 5, "date": "2010-12-01", "useful": 5, "type": "review", "cool": 4}, {"funny": 4, "user_id": "lEw2VL9JCDFk3R5NzahqnA", "review_id": "f9L9DoaX8rj53Rt1SNCn0Q", "text": "I work downtown. I have disposable income and a lunch hour. Since the most interesting thing in Tower City is the olive oil store, I often find myself wandering aimlessly through the streets of downtown looking for a clothing store to take my money, to no avail. And while I am a banker, I just don't think I'm uptight enough to shop at Brooks Brothers, nor do I appreciate the Chinese-made crap they insist on selling at Italian-made prices. So, I was really excited when DU moved in on E 4th. I paid a visit recently and was happy to see a sidewalk sale, from which I selected a cute dress at a deep discount. I was a little worried that the clothes would be too young for my thirty-something self, but inside, racks were filled with stylish things that grownups, not my pre-teen nieces, would be happy to wear. Along with the Made in the 216 label, lines like French Connection are featured. They also have a lot of unique home accessories and baby things. I'm happy to have this in my work neighborhood. I hope they're around for a long time.", "business_id": "K8bHTdwfJ0G03mnlOTJv3A", "stars": 5, "date": "2011-08-28", "useful": 3, "type": "review", "cool": 2}, {"funny": 6, "user_id": "FqSlXUQPOb5AjdVoJcfNNw", "review_id": "DQVTRQKsnWgKQycBUtmaaQ", "text": "I'm just smiling today, because I KNEW it. Leaving NYC was probably the most difficult decision I've ever made (and I'm including my divorce in here)...but I wanted to return to school...and I just *knew* something good was percolating in Cleveland. The drive toward a more localized economy, the sustainable living movement, the beautiful blue lake...just everything coming together in this town for probably the first time since the 1800's.\n\nYou know what is a good indicator? Retail business. When people say \"Wow...there's a buttload of people walking around here...at pretty much all hours...this would be a great place for a store!\"\n\nAnd now we have the Dredgers Union, opened right smack dab in the middle of East 4th Street. \n\n\"But...but...THAT's not a strip mall....\". \n\nYeah, we know. Go back to Fairview Park.\n\n\"But...but...I can't drive my Hummer to the front door...?\". \n\nUm. Yeah. It's called walking. Just go enjoy your moving skywalk into the casino and leave us alone.\n\nWhile searching for lunch today I stumbled across the open doors. I had thought it wasn't opening til the \"grand opening\", so it was a nice surprise. But yes, this is a clothing store, with a small bit of home/decor goods. Guys and girls can find stuff here. I looked at a few shirts, couple pants...nothing really too pricey either! I was looking at a shirt I expected to be $100...it's $78. Hell...them's Banana Republic prices nowadays. Pants were also around $78. There's a messenger bag I'll probably be back to buy, as it was kick-ass. \n\nThe labelling system was pretty cool, as much of their stuff is made in this area. If it is, it'll say \"Made in the 216\". Their stuff from overseas and such will not. I read labels, so this is a nice touch. The staff was really, really nice. And not syrupy, just actually nice. She picked her people well, it seems.\n\nAnd the store itself? IT LOOKS HOT AS SHIT. Awesome. Very well designed, spacious, yet packed with stuff. Easy to walk in. \n\nThere's a whole basement area where they're going to do the official\"Made in the 216\" events from now on (formerly in Gordon Square). Which I think is a good idea. Get your asses downtown, people.\n\nThe official opening party is July 8th. But it's open now unoffically. On the webblog (the actual website wasn't really active yet) she made a neat point of referral to the Summer Solstice Party. \n\nConnectivity with the community, anyone?\n\nAbsolutely. I'll take a large order of connectivity, for here.", "business_id": "K8bHTdwfJ0G03mnlOTJv3A", "stars": 5, "date": "2011-06-17", "useful": 10, "type": "review", "cool": 10}, {"funny": 4, "user_id": "PrwnAL82LL4Ewt_wJpHWCA", "review_id": "LGo_XJExu0oSxuCwawog6w", "text": "Hip. Stylish. Cool. Contemporary. Artsy. Unique. Made in the 216. By far, one of the coolest, hip, one of a kind clothing stores. And what's best about it? Yes, it's in Cleveland.\n\nMy friend and I were walking around E.4th looking around for coffee to resolve my caffeine fix.  We turned the corner, and both did a double take at Dredgers Union. We looked at each other and were both like, \"whoa! Let's go in!\" and off we went.\n\nWhat's great about The Dredgers Union is the pride that the store shows. . Most of the store is fully represented by local Cleveland artists and fashion designers. The clothes, the furniture in the basement, the art along the walls, the kitchen tools, the books, etcera- all local artists and designers. How cool is that. This is the type of pride that Cleveland needs.\n\nThe clothes are great. Great fashions, all different for all different type of styles. From hipster to classy to more rugged, they got it all. The prices range all over- from pretty cheap to more club monaco prices, but nonetheless, the fashion here is great.\n\nAlong the side of the store are lots of other items- kitchen tools, books, kitchen appliances, you name it. Then, walk down the stairs, where in the basement, you'll find more clothes, and even furniture. Yes, furniture. We saw this chair which was pretty much fashioned out of a tree stump of some sorts. Crazy.\n\nMy fave part? The art along the walls. All completely Cleveland inspired- landmarks, words defining Cle, everything you can think of. Not something you would find in some Cle touristy store- but art that represents the heart of Cle. \n\nDefinitely a stop when you're in Cle downtown. Utterly cool. Hip. Modern. Everything....something that you wouldn't think you would find in Cle. The store entirely represents Cleveland individuals though- hard working, genuine, blue collar people that the city represents. Go 216. Take a stop at The Dredgers Union next time you're on E.4th. So worth it.", "business_id": "K8bHTdwfJ0G03mnlOTJv3A", "stars": 5, "date": "2011-07-11", "useful": 9, "type": "review", "cool": 6}, {"funny": 9, "user_id": "QuZbJquRtbY9O9JrB9NpxQ", "review_id": "9Zby6cp8d_-vlMD2gf0aRg", "text": "The snowbirds are back to the Sun Lakes area in force and the inept and overwhelmed staff at this Burger King couldn't handle it.  Not that they were that busy but these guys needed about 20 minutes per order and were only hitting accuracy at about 40% or so.\n\nI haven't been to a BK in a long time so my FFF radar was down (Fast Food Fubar).  A buy one get one coupon lured us in.\n\nI actually felt bad for one guy that seemed to be in charge.  My daughter and I stood back and watched the carnage for the first fifteen minutes waiting for our order.  Then we received our sandwiches that were not the right sandwiches.  Then we returned them and waited some more.  Then we just got a refund and left.\n\nBut during that time we watched the cashier wander around and attempt to help in a hesitant fashion as if she had never been behind the counter before.  The one guy in the kitchen seemed overwhelmed, easily confused and uncertain what the difference was between say bacon, sausage and eggs.  And the guy I felt bad for kept flitting from the drive up \"Oh my God that guy has been waiting 14 minutes!\" to the kitchen \"No, this goes here.  We're out of biscuits!  Totally!\" to bagging orders \"Sir, you still haven't gotten your food?  Really?\"", "business_id": "NZP9oypyQCy-IXlzqQWvWQ", "stars": 1, "date": "2009-11-07", "useful": 10, "type": "review", "cool": 6}, {"funny": 13, "user_id": "EXKDLuYoZUKUNNNYA7TlGQ", "review_id": "9exXzDdlLDHI4WK7UqOLVQ", "text": "I was with a friend at Safeway which is where this Starbucks is located. They have a nice lounge area with tables and chairs and plenty of Safeway store flyers. I just ordered a cup of coffee while I was waiting for him to pick up a few groceries. Here's the reason for the 3 star rating. I only drink coffee hot, no iced anything, and I only like black coffee, no cream, sugar, or flavoring. I don't like cappuccino, Frappuccino, or latte. So the black coffee I got didn't taste much different than anyone else's. It was a good dark roast. The service was fast, the price was a little higher than places like Dunkin Donuts. I guess if you like specialty coffee this is a good place to go, they have plenty of choices.", "business_id": "AayXLMtlIwsX3h4br2vJtg", "stars": 3, "date": "2016-06-18", "useful": 19, "type": "review", "cool": 19}, {"funny": 5, "user_id": "YpGt3hdq5adPlEFn9fQ2Zw", "review_id": "edVFMyANIzQ0JqJVajiMfw", "text": "PROTIP: Never talk down to customers, you don't know if they Yelp. =)\n\nRecently, a friend and I made a stop here to purchase a modest amount of alcohol. Business as usual--until we were forced to wait at checkout for about five minutes. After losing my patience, I observed what was happening. The cashier had taken our IDs to two other clerks, who inspected them thoroughly. Keep in mind that my card is genuine, valid, and with a small amount of wear. The lamination is intact, and all information is legible.\n\nIt is good enough for dozens of bars, liquor stores (including chains such as Total Wine), and every other grocery store I have been to...so why such scrutiny now? Our clueless clerk, who seemed just a bit too eager and upbeat to address or inconvenience, was more than happy to answer with a smile.\n\n\"Okay, we were concerned about these IDs being fake\", she explained, citing an incident from earlier that day. \"We had to decide whether or not to accept these\". Her concern felt rather malevolent. As she reluctantly allowed me to finish my transaction, she had some final words as I took my receipt.\n\n\"ESPECIALLY yours. We almost denied it. You really need a new one.\"\n\nHad I not been with friends and had places to be, I would have asked to speak with a manager about such disappointing customer service. Clearly, they were the mistaken ones in regard to the validity of my ID. Would it not make sense to...apologize for being wrong and holding me up? At the very least, she could have briefly explained their policy on verifying age. Otherwise, it feels very accusatory and arbitrary. Minus one star for the hold up, one for having a meager selection compared to other Fry's, and minus infinity stars for condescending clerks that try to lecture me. I'll try my best to avoid this location.", "business_id": "AtBSfQPNoCnBx_YL-wUG1g", "stars": 1, "date": "2011-07-05", "useful": 5, "type": "review", "cool": 2}, {"funny": 4, "user_id": "V6PeLHJ8D1C7utl4HzjBmg", "review_id": "MmkznkvIIe8jrvM5SrGtZQ", "text": "Quality Inn in Surprise gives you the unique chance to time travel back to the 80's. The décor doesn't look like it changed at all. The rooms actually have the bathroom sink outside of the bathrooms! Once you get through the memories of childhood road trips and early 80's summer vacations, this Quality Inn really isn't bad after all.\n\nI'll start with the staff....top notch! Everyone from the front desk, to room service, to the people keeping the breakfast buffet fully stocked were awesome! We were always greeted with smiles, and everyone was so helpful!\n\nThe rooms were decent. My bed was comfortable, the A/C was a little noisy..but I got used to it, and the rooms were kept clean. Nothing too much more that I could ask for. The location of the hotel was a little isolated though. We happened to be out there on business dealing with Rangers Spring Training Baseball. Like most suburbs, you'll need a car to get to where you're going...even though it is located close to a couple of eating spots in case you get hungry.\n\nSurprise is a rapidly growing town, and the newer hotels have probably surpassed this one in popularity...but I'm here to tell you that if most of the town is booked up, and you see this Quality Inn as one of your options, go for it!", "business_id": "3zPeoY0HwIEW-HlX4iXRlQ", "stars": 3, "date": "2015-03-28", "useful": 5, "type": "review", "cool": 3}, {"funny": 4, "user_id": "iSC96O2NjQc3JExGUHQG0Q", "review_id": "-a4mqwxVXtUgRCRdMcKPXQ", "text": "I came here after CMYE with my roommate Roy E too keep the party going and the drinks flowing. I am fan of Bar Rescue show been too two other bars that been on the show. Unfortunately for Hammer & Ales felt like this bar is my least favorite Rescue out of the three I been too first hand. Not that it was all bad the things that did stand out for me was like outside of the building with the art work and like the well lit sign that can see from the road. It located in industry area one that only business other then strip club down the road open at night. So make sure look for the sign or else drive right by it. I like all the widescreen televisions that inside the bar couple of them nice size and perfect chill watch sports (last night case primetime Olympic coverage) drink beers talk stories with friends. They have separate room that has a pool table and dart board. Not sure if they do the world beer stamp card from the show. I like the chalkboard world map on the wall. The bartender she was friendly, on it came too our beers ask us before close too empty, and she has this positive upbeat energy vibe. Really in the end Hammer & Ales still dive bar for me. As for Dive bars nothing that really stood out for me thankfully bartender and hanging out with roommate made the most of first time visit. I know they serve food but after the food coma was in from CMYE last thing on my mind so never asked the bartender for the menu, She never asked us if wanted one. They do have nice selection of beers on tap too choose from although last night felt like looking at the taps few that was out.  \n\nThe area is not exactly the most safe area and coming out of the bar feel like looking over my shoulder something bad going too happen. Really in the bar if not gambling on the machines, sports fan watching games, or playing pool or darts no excitement come here too Hammer & Ales. Maybe the food but get back too you on that one. I might come back too check out the food. I think would rather stick too my normal dive bars.", "business_id": "CMJqS9j_FB_lSgMhnl_NFQ", "stars": 2, "date": "2014-02-12", "useful": 5, "type": "review", "cool": 3}, {"funny": 7, "user_id": "oxMkebNDLeRsvYib0t0W-A", "review_id": "4d-p-AFoCkJ58O0gNgUiTw", "text": "Since we saw this place on Bar Rescue a group of us decided to check it out after a Wranglers game to catch a few drinks and dinner.  The first couple in our group to arrive was advised that they don't have a cook on Sundays.  Are you kidding me?  It is football season and every bar in town, except this place, is packed on Sundays.  This place is owned by two chefs so there is no excuse for there to not be a cook there.  What a joke of a business.  Sorry to see that being on Bar Rescue is not going to be enough to rescue this place.", "business_id": "CMJqS9j_FB_lSgMhnl_NFQ", "stars": 1, "date": "2013-12-20", "useful": 13, "type": "review", "cool": 2}, {"funny": 3, "user_id": "YwaKGmRNnSa3R3N4Hf9jLw", "review_id": "AELJjoOzgtoY7vsj2Zs6oQ", "text": "There are dive bars and there are dive bars. This one seems to be in the middle of nowhere. It's easy to find if you're driving west on Russell; there's a huge sign on the side of the building facing you that says, \"The Hammer.\" Driving eastbound, I totally missed it and had to turn around.\n\nWhen I walked in, the place was completely empty. The bartender and some other employee were shooting pool. I'm not sure what kind of crowd this place attracts, but they weren't there last night.\n\nThankfully, my cousins arrived shortly after. We had one round of drinks and left. The only reason we went there is because one of my cousins knows the bartender. She seemed cool at first, but got annoying after a while. There's a fine line between playfully jabbing and being abrasive. It may just be because she knows my cousin so well.\n\nIn any case, this place just isn't my bag... baby.\n\np.s. Obviously this place is NOT closed.", "business_id": "CMJqS9j_FB_lSgMhnl_NFQ", "stars": 2, "date": "2010-11-28", "useful": 4, "type": "review", "cool": 3}, {"funny": 4, "user_id": "pzMvoRhpuwwC3jHZtZSCeg", "review_id": "-Se8nZHzrOa1zkJwjm1dhw", "text": "As one of the Las Vegas bars featured on the hot Spike TV show Bar Rescue, I really had high hopes coming into experiencing this bar for the first time. Unfortunately, it seemed to me that a lot of the improvements made to the bar can be chalked up to TV magic. Sure the bar clearly went through some changes for the better, but it seemed to look a whole lot more flattering on my television screen. The bathroom was a dump. Several beers were out of stock. From the outside, the place just doesn't appear to be a bar despite the large mural painted on the outside wall by the entrance.\n\nThe place is a dive bar, I get that, but there's just not much too it. The bartender was pleasant enough and was on top of refilling my glass, but she would not stop mentioning what time her shift ended. It was as though her customers were getting in between her and her freedom from working behind the bar. Other than that I did not get a chance to sample any of the food and may go back to do so and perhaps update this review.", "business_id": "CMJqS9j_FB_lSgMhnl_NFQ", "stars": 2, "date": "2014-03-17", "useful": 12, "type": "review", "cool": 2}, {"funny": 4, "user_id": "EcXK2bVWYME0geL1iDCdaA", "review_id": "OW3FYtUPd2wGmqZHAU32eQ", "text": "Worst bar ever- bar tender had a attitude the whole time & talk shit about the bar that he worked at and the place smelt like the sewer  never coming back (Paul and Bradley)", "business_id": "CMJqS9j_FB_lSgMhnl_NFQ", "stars": 1, "date": "2013-12-23", "useful": 2, "type": "review", "cool": 0}, {"funny": 4, "user_id": "J1yNYAjojpD_KpocG-W3KQ", "review_id": "KHMCf5v_1oJa8ZhF3U4EnA", "text": "I was referred to this office by my dentist, who I think is great.  Unfortunately, this office is not.  I scheduled a consultation in December, and received a voicemail the morning of my appointment to let me know that the Dr. was running late, and asking if I could come to the office three hours later than scheduled.  Sure, no problem.  Upon arriving at the later time, I waited in the lobby area for nearly 20 minutes and then in the dentist chair for another 20 before actually being seen by the Dr. for less than 10 minutes.  That should have been a red flag...\n\nFast foward to today.  I have a 9:30 appointment.  After waiting in the lobby for nearly 20 minutes (see a theme here?) I am told the Dr. is running behind and would not be able to see me until noon.  NOON!  Really?  You couldn't have called and told me that?  Or told me when I arrived ON TIME for my appointment?  \n\nNo, I did not want to reschedule.  Would you?", "business_id": "DraJGFZrfVARyxdD08bxpA", "stars": 1, "date": "2011-02-24", "useful": 9, "type": "review", "cool": 6}, {"funny": 3, "user_id": "oUst55rUuv2nKEQ0FgJ5GQ", "review_id": "JyJGhQdMa6IKQOAluXnJ3g", "text": "Very Cool Mom and Pop restaurant serving some delicious and very affordable middle eastern food. You can dine inside their cozy restaurant or have them fix you up for some tasty take out.\n\nBelieve or not we used to live right behind this restaurant before they built the SR51. Sure wish they were here back then. We could have easily walked right up or taken our bikes and had one of those stimulating Green Earth experiences.\n\nCame in here the first time and went with the standard Gyro combo with fries and a drink. Caught an eye of the Baklava sitting nearby and had to also get one of those bad boys. Food was very tasty and I made sure to bring the wife back for a return visit.\n\nThe menu is pretty good sized and has all the popular favorites that you can imagine. Gyros, Kababs, Shawarmas, Falafel, Hummus and then some. I also really like the take out menu. It is nicely done and has several pictures of all the different items. Nice!\n\nThe owners are both super friendly and excited when you arrive. We even talked baklava recipes for a moment while we were settling up. They make theirs the same way we do using pistachios and a touch of cardamom and a hint of rose water in the syrup.\n\nRight next to the large movie theater in the adjacent Rad Shack parking lot. See you there next time. KEEP IT LOCAL WHEN CAN!\n\n4 STARS", "business_id": "--g-a85VwrdZJNf0R95GcQ", "stars": 4, "date": "2014-06-01", "useful": 4, "type": "review", "cool": 3}, {"funny": 4, "user_id": "cBrXXLUvACzsI4Y02x9cJw", "review_id": "gEry2gghMX0hgB7N3KYAJQ", "text": "Living in Southern California, sometimes and somehow and for whatever reason I see television ads for Ruby Tuesday.  The commercials make it look like a high end burger joint and make the food look mmmmmm so good.  But the thing is.....I don't know of a Ruby Tuesday in Southern California!!!!!  arghhhhhh\n\nSo when I ended up in Arizona for my Ironman, we of course walked up and down the strip (Mills Rd) where all the college kids hang out.  We were there for a few days and so we wanted to check some places out...and lo and behold we see a Ruby Tuesday!  Because of the Ironman event the whole town was packed with tourists, families and athletes.  Ruby was not to be outdone and it too was packed.    \n\nOnce inside I realized it's more along the lines of a Chili's, TGIF type of place....ummm yeah....but since it was our first time it was cool.  Ordered a pasta dish which was good...I mean we scarfed our food down.  The strawberry lemonade was good here too.  \n\nI did come here a 2nd time before we left, so I could try their steak.  Ummm yeah it's not a great steak joint haha...I mean its edible and I did eat all of my steak...but its not some fancy place they make it out to be on TV.  :P\n\nService was average....If I was in town...i'd perhaps come in one more time just because we don't have it in California", "business_id": "6KgGE8B1RsR7jc9R5nuH0Q", "stars": 3, "date": "2008-06-18", "useful": 2, "type": "review", "cool": 1}, {"funny": 7, "user_id": "6I1KT1SCGbAaTzTIMqF_eQ", "review_id": "o34ndPFl1Bv-ung5yk_C9A", "text": "It'd been years since I'd been to a Ruby Tuesday's before last month. And since then I've been three or four times. Is it that good? No, not really. I mean, it's not bad, not as bad you probably think it is, anyway. But it ain't great. So why do I keep going back? That's a good question. Because it's not cheap, either. Probably because it's close to work.\n\nI've been making my way through their seafood options lately. The jumbo lump crab burger - it's crab cakes on a bun. That's probably some kind of no-no on somebody's lo-carb diet. Fried shrimp, grilled creole shrimp, shrimp scampi... tried 'em all, and they're all the same - not that good, but not bad. An incredibly solid three stars.\n\nOh, and they've got a veggie burger, which technically pushes them up to 3.5 stars, but I'm not in the rounding up kind of mood today.", "business_id": "6KgGE8B1RsR7jc9R5nuH0Q", "stars": 3, "date": "2008-10-08", "useful": 8, "type": "review", "cool": 6}, {"funny": 4, "user_id": "sTcYq6goD1Fa2WS9MSkSvQ", "review_id": "2BZsqJgCCsEqSGSoUo4FTA", "text": "I wasn't a very big fan of Ruby Tuesday's, but I am still sad to see it closed, just another Mill Ave memory. The salad bar was sub par at best, but they did have decent turkey burgers. They had really cheap drinks for happy hour, but the atmosphere in the place was so crappy it wasn't worth chugging them down there. I'm surprised Ruby held on as long as she did on Mill.", "business_id": "6KgGE8B1RsR7jc9R5nuH0Q", "stars": 2, "date": "2009-01-21", "useful": 3, "type": "review", "cool": 2}, {"funny": 3, "user_id": "eK6FpEPv2urKpEjWwR45QQ", "review_id": "fz9qvL9X0CYX3EI69UR4lw", "text": "Wow... just wow.  This place is heaven for non-gluten eaters.  Up until about 30mins ago I was getting a little depressed over this whole cupcake craze.  Not anymore, I just ate one of the best cupcakes I have ever had and it was gluten-free and dairy-free!\n\nThey have everything here:  cupcakes, cookies, pizza dough (they supply the gf dough to all the pizza joints in town that do gf pizza), pasta, hamburger buns, rolls, twinkies, cakes, pies, thanksgiving stuffing, bread crumbs to make your own stuffing, bagels, white bread, baguettes, I mean everything!  Oh, and it all tastes amazing.\n\nThe location is a little hard to find the first time being behind a barber shop and, like all gluten-free products, is not very cheap, but if you avoid gluten and dairy, this place is a god send.  They are very knowledgeable about their products, make everything in house, and have their products listed by allergen.... so if you don't eat dairy, eggs, or nuts, or any combination, they have it all under an easy list.  They can also special make anything for you... birthday cakes, whatever.", "business_id": "F6rZDgYtqfjs9sQC6bv81w", "stars": 5, "date": "2008-11-23", "useful": 7, "type": "review", "cool": 5}, {"funny": 4, "user_id": "CaPqjbHDripGNrS1dS3SdA", "review_id": "rZxqqOEA8jl8SZWbhEqnww", "text": "Recently I gots the allergic to wheats and the soy (teh suck!)\n\nLast week was my birthday and Michelle, my wife, bought a cake (and some other nifty creations) from these guys. I have had so many different \"attempts\" at gluten free stuff over the last couple years and let me tell you, most of it all tastes like CRAP!\n\nNOT THESE GUYS!!!\n\nI was so relieved biting into my chocolate cake, doughnuts, and bagels. Oh my gosh! It tastes good and pretty darn close to the original. I can't tell you how amazing it has been to have \"good\" baked goods again. Big props to GFC Bakery. I love you guys and I'll be back OFTEN!", "business_id": "F6rZDgYtqfjs9sQC6bv81w", "stars": 5, "date": "2009-06-02", "useful": 7, "type": "review", "cool": 4}, {"funny": 4, "user_id": "DzyBToexbfik0zt7ppky-Q", "review_id": "iMYOFA3b032-vzGh8Bijqg", "text": "I have been by this place several times now. Also now that I am far more aware of what I am eating, I pay attention.\nSo today I went in. I found out this place has been here for 10 years.\nIt is a bakery, as well as an Eat in or to go dinner.\nSo much to choose from in here as well.\nBread, cookies, bagels,Pizza dough,muffins, etc, etc, etc...\n\nI also really like that you can buy your own mixes on everything and make it your self if you so want to do it.\nMenu for meals is great and when you see all the food places they supply to you will be surprised as well.\nThe even sell all types of cakes. You can order them form the book complete with decorations.\nIt is not all too cheap in here. But, A little extra effort is worth the extra price ,I think.\nWhen we are all swelling up like Balloons changing your diet can do wonders.\nI will be happy to come back here. Yeah, for a great find!", "business_id": "F6rZDgYtqfjs9sQC6bv81w", "stars": 5, "date": "2013-05-02", "useful": 8, "type": "review", "cool": 7}, {"funny": 6, "user_id": "P1NI5QCqsFskRjucA3FNSg", "review_id": "KGXtwONCF_SajHuV0lpZ9g", "text": "It's the only place in town for everything gluten-free, and it's good. It's so good, thankfully I'm starting to find their products in other stores like Granola's on Shea near 70th. They have more of the bakery's stuff than say Whole Foods which has had their bread for awhile. Get the chocolate doughnut. Get it.", "business_id": "F6rZDgYtqfjs9sQC6bv81w", "stars": 5, "date": "2010-02-04", "useful": 6, "type": "review", "cool": 5}, {"funny": 4, "user_id": "rA97zeqOrUYuEM69n0Xn4w", "review_id": "pT4OFvwc8cnPHJzcIssW2g", "text": "GFC is absolutely a heaven sent treat from above!\n\nFor those of us with gluten intolerance, it is incredibly difficult to find bread, bagels, pizza dough, pastries, etc that do not have the fateful binding agent, but wonderful places like GFC save the day!\n\nThey are located behind an auto oil changing shop (I think Midas) at 30th street and Thomas. They close at 5pm during the week, but if you call them and let them know you are on the way, they will wait around for you! Nice service!\n\nI'm vegan so I am limited with all the items I can try, but I can tell you the vegan gluten free chocolate chip cookies are amazing AND loved by regular eaters. I don't think Brad E could get enough!\n\nThis time around I also discovered they have veggie burgers in buns! You can throw them in the microwave, but I put mine on the grill twice; both the buns and the patty. DELICIOUS!\n\nI love the onion bagels, especially with some vegan cream cheese! I also really enjoy the herb baguettes.\n\nReally cool news is that they just purchases Lulu's Cupcakes, so they will be opening in about a week (McDowell and Miller) with a small deli where they make sandwiches and they will have a retail area where you can get products from the bakery!\n\nReally really amazing place that I am incredibly thankful for!\n\nOh, and if you live by Luci's (16th St and Bethany) they carry GFC items there too!", "business_id": "F6rZDgYtqfjs9sQC6bv81w", "stars": 5, "date": "2010-05-10", "useful": 12, "type": "review", "cool": 8}, {"funny": 9, "user_id": "sw-vrx-GT5fMXm77gjck7w", "review_id": "YmpZRBICAR1gbuq2kx0ZGg", "text": "I'm a whore for bath products. Call me crazy, but if it smells good, I stockpile it and it sits under the sink for years.\n\nI just want to savor the sweet aroma longer! I say to myself.\n\nI don't want to use it all now!\n\nAnd there it sits. I suppose it doesn't help that I rarely take baths (a shower is good enough for me!), so there's another reason the bath gel lasts so long.\n\nBut then I recently rediscovered Philosophy. Being in Oregon, there aren't any Philosophy stores, but they sell limited products at places like Nordstrom. One year for her birthday, my sister got a bottle of their Coconut Frosting three-in-one shower gel, bubblebath, and shampoo. And guess where that's been? Yup, under the sink ever since.\n\nWhen she wasn't looking, I'd steal it away and use it for myself.\n\nAnd then I decided to finally shell out the dough and buy myself some. But I wasn't going to brave the mall. Philosophy's online store is seriously awesome. From the drag-and-drop shopping carts to the adorable vintagey designs. I love it all!\n\nI was sort of afraid of purchasing scents online, but the combination of customer reviews and my own good judgment (the Coconut Frosting stuff was fierce!) lead my way. Prices are on the steep side, with a 16 oz bottle of three-in-one averaging about $20. BUT I've been very happy with the promptness of delivery (and it comes in a lovely white Philosophy box) and the delicious scents (I love stepping out of the shower smelling like a cinnamon bun!).\n\nI also think they have a great business model set up. They regularly offer codes for free lipglosses and 4 oz bottles of three-in-ones, an excellent way to let customers try a product without purchasing it. They also let you choose samples at checkout. I might start buying their skincare items, too.\n\nSo, Philosophy, I'm definitely a repeat customer. Keep on doin' what you're doin', and I'll actually keep the products in my shower instead of under the sink....", "business_id": "6HM0G2UfKzzGhmvKAJ0OPA", "stars": 5, "date": "2008-12-10", "useful": 13, "type": "review", "cool": 11}, {"funny": 14, "user_id": "UmXzwFM2OkZHWJ5cJZlqkg", "review_id": "aoyoDBxj5c3AkKJ5FmrntA", "text": "On the cups it explains how they traveled the world to find the best chocolate for their frozen blended drinks. Really? The world? Not just from Reseda to Riverside? And the whip cream? Did you spend months in Wisconsin at dairy seminars? Let's be real here. First off, CBATL kicks Starbucks hairy ass! Coffees are robust without being bitter. Unlike my surly lesbian Aunt in Fargo. She? Robust and bitter. But, she is, afterall, living in Fargo. But I digress. This location has a fun trivia game each day. The obligatory living room area is cozy and offers views of Scottsdale Road. But back to the blended drinks and the world famous chocolate. I really have no idea, nor do I care, but their ice blended mochas are mouth watering, toe curling, brain freezing dee lites.", "business_id": "8Tes8QqrvginmtCeddlGMw", "stars": 4, "date": "2008-04-30", "useful": 11, "type": "review", "cool": 11}, {"funny": 8, "user_id": "5ylIKMA-zoXZvH_-X26YOg", "review_id": "NWnV5pZg1Xk335DiIoj0LA", "text": "So much fun!! I had never tried Zumba before so I wasn't sure exactly what to expect.\n\nWe tried the Zumba Lite class. Thinking that was a good place to start, right? If that's the \"lite\" class, what is the advanced class like? \n\nYou most certainly will break a sweat while dancing this funky hybrid version of latin dance and...twerking? Yup, expect to do a little bit of that as well. The instructors are very energetic and welcoming. In fact, everyone we spoke with was super friendly. Towels are provided and plenty of water is available if you need it. Once you have made it through shaking your stuff there is a nice cool down stretch at the end of the class. \n\nIf you have never tried Zumba, I suggest starting with the Zumba Starts Here class which teaches the basics, breaking down moves and repeats them so when you do start to learn routines for the more advanced classes, you have a better idea of what you are doing. \n\nThe studio also offers cardio and toning classes and they just started offering hip hop classes as well. Prices are very reasonable. We went and the drop in rate was $5 for the one class. Plus, I got a pass to come back and get my second class for free!!\n\nDance is suppose to help reduce stress, increase happiness and help your immune system become stronger. Just some of the great reasons to give Zumba a try!", "business_id": "5miinEDJS4wJMrACOOB5dQ", "stars": 5, "date": "2015-06-21", "useful": 12, "type": "review", "cool": 10}, {"funny": 6, "user_id": "vP85Nf2ts5iuCAfsgKSdiw", "review_id": "MGjmQfvxCV6j_ap0USr1AA", "text": "I live in the area, and have been to the Greenhouse Winery location on route 30 and the original location at Hazuza's greenhouse plenty of times. Past experiences have been pleasant- friendly and helpful staff, and the wine is good. We actually had two of their brands at our wedding reception. Believe me, I'm no connoisseur, I just know what I think tastes good. Anyway...\n\nTwo weekends ago, my friend and fellow yelper Carrie and I attended a murder mystery dinner at the newest Greenhouse Winery location on Pinewood Road. This was our first visit to this new location but certainly not our first murder mystery dinner, which we both love. (The husbands were left home on this occasion.) Our tickets cost $45 each, which included 5 free wine samples, dinner, and the show. This is more than any other show we've been too; most are around $32. The only difference is that they don't include the wine tasting. Since there are several moving parts to this event, I'll break them down for you as best I can:\n\nThe winery: the place is up a long winding road, on top of a hill. It's very nice and in the summer I could see going up there with lunch, playing some bocce or horseshoes and drinking some wine (like rich folk do lol). We were told that they do not make or serve food, but they do have meat and cheese trays you can buy. You are permitted to bring your own food and make a day of it. The day we were there was extremely windy and, being on top of a hill, I could see this being an issue if you planned on being outside. As mentioned, we were permitted 5 free samples of wine, which we of course took full advantage of. Of course, a sample is really like 2 sips, maybe. You could 'buy' additional sips for $1 each or choose to buy wine by the glass or bottle to take into the show with you. So, hey, buy a bottle right...because it's the cheaper option in the long run. They also provided coffee, water, and pop (soda for you non-yinzers).\n\nThe show: Fun and funny as usual. Although both of the winners were at our table and not us. Meh. \n\nThe service: Nearly non-existent. At other locations, they have wait staff coming around to check on your table, take away plates, fill up water, etc. Not here, they had someone come around twice - once to take appetizer plates and once for dinner plates. I had to go back out into the winery area to ask for more water and I was told to please bring my carafe and they would fill it up. Umm, no. Anyway, the real issue laid with the drunks at the table behind us. They were talking loudly, laughing, and just all around being jerks. Everyone on our side of the room was visibly annoyed. One of the guys at our table turned around ask them to quiet down, and the one jerk actually told him \"I will f-n kill you.\" It was terrible. And hey, I'm all for rowdiness...if it suits. This just wasn't the place for some ball-bustin, whiskey shooting, hell of a time. Feel me? They clan of 5 were finally either kicked out or asked to leave, but honestly it was half way through and already such a distraction at that point. I feel that if there were staff around more, they would have gotten kicked out a lot sooner and not cut into my $45 dinner.\n\nSpeaking of dinner. The food: the worst I've had at a murder mystery dinner. They buffet style dinner consisted of breaded chicken (which I like but Carrie didn't have so much luck with), stuffed shells (passed on those), potatoes and tortellini salad. The food was fine, there simply wasn't much selection. I can't really give the winery too much slack for this because it was catered. However, they still should have done their homework on what other locations provide. My biggest grip with this was we've paid $32 at The Lamplighter and they have chicken, fish, roast beef, ham, cole slaw, salad, fresh veggies, etc. So, we really both felt ripped off.\n\nTo sum it up, I would come back in the summer to hang out and have lunch. But, in the future, I will keep my murder mystery dinners to other locations.", "business_id": "DJTCiXnkHvcs07hBhumzEg", "stars": 3, "date": "2016-03-10", "useful": 12, "type": "review", "cool": 10}, {"funny": 3, "user_id": "PeLGa5vUR8_mcsn-fn42Jg", "review_id": "Gue0lJduKx4gSFon0TO8NA", "text": "Debra, this is an \"Athletic Club\" not a \"world class\" convention resort. Anyway, I recently toured the facilities with the intention of joining soon - I need a place to play Tennis and work out all in one location. The gym, pools, and Tennis courts may be the best in Scottsdale (that are available to the Public). \n\nThe fee is around $100 a month, but well worth it if you know what court rentals cost - Where else can you play Tennis, swim, lift some weights, shower in private, and grab a Martini for the road??? They also have meeting rooms...", "business_id": "59tL_iESG0-StWliBXktRg", "stars": 4, "date": "2009-04-07", "useful": 7, "type": "review", "cool": 3}, {"funny": 3, "user_id": "ees3c8csSWzO85GYOiNrIA", "review_id": "YDlwnl1KUJhS-By5wm50qQ", "text": "You do get what you pay for!!!.  Had a convention in Scottsdale and wanted to find something more reasonable then the Scottsdale resorts.  Happened upon the Scottsdale Athletic Club and it looked great.  The price was slammin' so I encouraged a colleague and client to get reservations.\nThe rooms had all the charm of Motel 6.  I was really disappointed and embarrassed for my client.  Found myself saying I'm sorry over and over again.  \nHope I can save some fellow Yelpers from the same experience.", "business_id": "59tL_iESG0-StWliBXktRg", "stars": 1, "date": "2008-10-29", "useful": 6, "type": "review", "cool": 0}, {"funny": 4, "user_id": "ErtKNkBDDXXynapuaZ4x7A", "review_id": "fOVUwJjRPGfa8F82XTlikw", "text": "Homeless in the park?! How unheard of! Not really, folks. It may be unappealing for you suburbanites who choose to live within the confines of a tiny box, but not for me, a born and raised city girl who has adapted to urban culture and diversity. \n\nI love this park, and have been going here for years. It's small, quiet (on most days), and green. I go there when I don't want to deal with crowded parks like Sunset. Actually, I have mostly given up on Sunset and replaced it with Paradise. :) \n\nThe way these people make Paradise out to be is totally not what it really is. I say, check it out for yourself. If you prefer grass and matured trees over the dull gravely desert landscapes found in these newer 'homeless free' parks, or you just want to get away from crowded parks, but still want to enjoy the greenery, then Paradise is the place to go. I have had a lot of peaceful picnics here. Never had a problem with homeless people (who I've barely scene) or drug dealers (who I've NEVER seen, and I've hung out here late at night to have some wine with friends.). I mostly picnic on the Northeast side of the park. Lots of shade, grass, and beautiful big trees to be enjoyed. :)", "business_id": "07F0eE_JHkH4Op0vpR_v4A", "stars": 5, "date": "2013-09-28", "useful": 4, "type": "review", "cool": 3}, {"funny": 4, "user_id": "VeYSD3Xgxd-R4yowet51tA", "review_id": "6vSLiFAQMnYjuDZJ9wr72g", "text": "Paradise Park, on McLeod between Tropicana and Harmon, has been host to, well, a host of barbecues we've thrown for the mere fact that it's close and we're lazy.  But, hey, guess what?  It works, and there's always something going on.  \n\nThere's plenty of benches and, since we're not prissy and use park grills, plenty of grills to use.  There's a covered area or two that, on the weekends, are usually reserved for parties, but you could call Parks and Rec to reserve them for yourself if you were so inclined.  The park boasts a large playground, exercise route, basketball courts, a rec center and a pool.  It's an older park, and the trees are mature, full and offer plenty of shade in the summer.  Ice cream trucks used to have little ice cream wars trying to get customers to buy their (identical) wares over their competitors (identical) confections and hopefully will once it warms up again.\n\nOf course, Tropicana and McLeod is no longer exactly the BEST neighborhood in town.  The park police patrol the park regularly, oftentimes not bothering to get out of the car but driving through the park on the grass itself.  I'm often amused by the drunkards walking home, or the crazy man urinating, or the lady with the bag on her head, but more family oriented or societally squeamish people might not enjoy that quite as much as I do.  Also, and not surprisingly because it IS a park, the bathrooms are always deplorable.  This is why we use this park because of it's proximity to home.  Of course, I let my friends drive to my house to use the restroom.  \n\nNo, you can't come over to pee.  Geez.  I don't even know you.", "business_id": "07F0eE_JHkH4Op0vpR_v4A", "stars": 3, "date": "2007-02-28", "useful": 1, "type": "review", "cool": 0}, {"funny": 3, "user_id": "iTxPwAK3uqAIg1YtB2nFKw", "review_id": "eLhQJl8mPN8f73RKE5AlWw", "text": "This is the only store where pants fit me. Size 0 SHORT. They have it. Hallelujah!\n\nI feel like everything else is overpriced.\n\nCustomer service is really good. Commission maybe? CSR showed me where the jeans are and grabbed me a couple different styles when the one I tried on wasn't fitting me the best. And she gave twizzlers to my kids (daughter was crying and she was totally cool about it).\n\nThe fitting room was GROSS. I see the pics on here from last year and it still looks they way, actually it's worse. Like they haven't cleaned them at all. I didn't take my shoes off ( which made trying on jeans super difficult). I don't get it. Every retail job I've ever had you'd have to sweep out the fitting rooms and clean the mirrors EVERYDAY. How is that being overlooked?\n\nI come here for the pants. In and out.", "business_id": "AaAur8IBJPSBLKwPg1Pnxw", "stars": 3, "date": "2013-08-01", "useful": 0, "type": "review", "cool": 2}, {"funny": 3, "user_id": "xaCU92mNCFAJ9BdtfoP7dA", "review_id": "TmAIEoKvQ04jfxIIrOiCtA", "text": "I love Hailo!!!\n\nI love it so much I'd marry it if I could.\n\nI started using the app last weekend, so have now been using it for a week. I'm still in love.\n\nHave used it on five occasions now, and have had a fantastic experience every time.\n\nThe app is free and available for iOS and Android. And it's AWESOME.\n\nIt finds you on the map (you can edit/adjust as necessary), then tells you how far away the nearest cab is. On every occasion, it was less than five minutes. UNHEARD OF!!! It's always at least 15-20 minutes when I call other Toronto taxi companies (I'm looking at you, Beck and Co-op!) so this has been life-altering!! \n\nSo once you see how long the cab would take to reach you, you decide whether to \"hail\" it or not. If you do, you will then be connected with the driver. The map will continue to show both you (a little blue bonhomme) at your location and the cab (a yellow car icon) moving towards you. It's adorable. The time continues to count down and an alert sound is played when the taxi is one minute away, then again when it has actually arrived.\n\nAnd off you go! Once in the cab, you can choose a tip amount (15%, 20%, 25%, etc. options) and watch your little blue man ride the yellow cab on the map all the way to your destination. ADORBS!!! Once payment has happened and you're out of the cab, you can rate your driver (5-star scale). A receipt is emailed to you, and the trip is saved in a log within the app. It's all pretty slick, and very impressive. \n\nYou can easily find promo codes for them online - there are $5 and $10 credit codes right now, some only good for your first ride. The most recent driver gave me some business cards to give to my friends with a $5 code on it too - sweet!\n\nIt's been a while since I've been so jazzed about a new business or service, but I love it when someone finds a way to make my life easier. \n\nThis one is going to change the whole industry. Calling it!\n\nOne last note unrelated to the review - one must mention all the political hoopla surrounding the introduction of taxi-calling apps in Toronto. I was confused about the differences. Here it is: Hailo is the only City-licensed app-based taxi service. There are others apps to connect the public with taxi drivers, but I would strongly suggest (after doing a lot of research and talking to the drivers about it) Hailo is better (safer, cheaper, more fair) for everyone.", "business_id": "IKqVo1skSa2aubLfcUUlRg", "stars": 5, "date": "2013-01-13", "useful": 4, "type": "review", "cool": 1}, {"funny": 3, "user_id": "utRlrauZEOF_2kASsIoJ7A", "review_id": "cv2Xf7JXzszPbvr48pnK5g", "text": "Herbal remedies and me go way back. Ever since I can remember in fact. If I had a cold, my mum would put a few drops of lavendar on my pillow. If I had trouble sleeping, it'd be a few drops of chamomile oil in the bath. And some rose and patchouli just for the heck of it (yes, I wanted to be a flower power 60s kid). And echinacea is my winter-time staple, with ginseng and arnica being regulars of mine too.\n\nIf you don't have a scooby with what I'm on about, then perhaps Napiers isn't for you. My one irk is when people review something on Yelp outwith its context or usefulness. If you don't believe, or use, complimentary and herbal remedy you may well think Napiers is a bit of hoo-hah and pricey to boot.\n\nBut if you do see the value, and have reaped the benefits, of herbal remedies in the past then Napiers is like a mecca for all things herbal and healing. You can generally find herbal remedies in most places now, like Boots and even the supermarkets, and the other big brand Holland&Barret.\n\nNapiers, however, only really stock their own brand products but they're none the worse for it. They have their own blends of things, so when I went in looking for arnica cream to use on an ITB knee injury (for ligament pain) they suggested a Napiers blend with all sorts of other things AND arnica I hadn't heard of anywhere else. And it really, really worked a treat.\n\nThe shop assistants are very well versed and helpful, and really listen and suggest things that might work for your ailment. There's also some lovely more indulgent products - body lotions, skin products, especialyl Dr. Hauschka which I adore, and the do some of the really tasty food products by Nakd too. But shhh they're mine! I usually stock up on 20 or so at a time.\n\nYou're more likely to get a tailored, personal service here than going into a bigger brand shop and buying the generic products. Don't be put off by not recognising brand names (like WellWomen, New Era etc.) and try their own products. Very worth it.\n\nThis branch is also in a really lovely store, and has a clinic next door which I haven't tried but looks very well equipped.", "business_id": "PJvRtkjvbvWOX7srSTdeKw", "stars": 4, "date": "2011-06-02", "useful": 4, "type": "review", "cool": 3}, {"funny": 6, "user_id": "E73xr_twLJZemdGrXWQobQ", "review_id": "A3_ZkExXwU8kF2EqUZ5gnQ", "text": "(another situation in which I wish there was a \"Zero Stars\" option!)\n\nI decided to take some old jeans here \"just to see\".  I truthfully didn't think they'd \"want\" any of them because, although lightly worn, they were older American Eagle labels, but I tested it any anyhow--mostly I wanted to see if they had anything of interest to buy.\n\nThat said... I'll outline my experience and walk you through what I saw...\n\nI arrive @ 7pm and there's a guy already in line in front of me at the \"drop your stuff off\" desk.  He's kindly and patiently waiting while the girl behind the desk looks at him, says nothing and continues to ignore him.\nFINALLY after about 10 minutes, she comes over and says \"what do you need?\"\nHe says \"I'm here to pick up my stuff or get an estimate?  My time was 7 o'clock; I was told to come back at 7.\"\nHER:  \"Name?\"\nHIM:  \"[his name]\"\nHER:  [fumbles around behind the counter] \"It aint ready yet.  I guess I could do it, but I'm really busy\"\nHIM:  \"okay, how long will that take?\"\nHER:  \"[sigh] I *guess* if I do it, like, *right now* it'll be like 20 minutes\"\nHIM:  \"Okay, I'll wait.\"\nHER:  [rolls her eyes and walks away]\n\nNow it's my turn... oh bloody, Christ... I can't wait!  O_o\n\nI seriously stood there for a looooong time before she (or anyone) paid any attention to there being anyone in line.\n\nI drop off my stuff, it was uneventful except for the fact that they ask for your ID to drop things off for appraisal.  Not a problem; however, I say to the girl, my license has my maiden name and i have my update card right here [as I'm getting it out of my wallet too].  She says \"I don't even need that so that don't getting it out\".\nShe then tells me to \"fill out this card with your info so we can take your stuff\".\nReally?  WTF?  Does this chick have ANY sort of social skills for working in a retail/service industry?\n\n\nI fill out and hand the card to her.\nShe takes my stuff.\nThat's it.\n\n\nI go back today to see if my jeans are \"worth anything\" or to just pick them up...\n\nI go in, she (the SAME dim-witted jerk of a chick) looks at me a dozen times before even acknowledging me, then.... \nEUREKA; Holy Santa Claus Shit, I'm not invisible!!!\n\nHER:  \"what can i do for you\"\nME:  \"I'm here to see about my drop off?\"\nHER:  \"name\"\nME:  \"[my last name]\"\nHER:  [looking at the shelves and bags] \"what's the name again?  I don't have that here\"\nME:  \"[my last name... again]\"\nHER:  \"when were you here?\"\nME:  \"[i tell her]\"\nHER:  [she checks some sort of manually written log book of drop-offs and, low and behold, there's NO record of me!]\n\nShe then goes to the shelves again and moves some bins and bags around and on the shelf (after she's moved some things), guess what I see?  My MAIDEN name handwritten on a drop off tag on a bag!\n\nRemember when I tried giving her my update card and she got an attitude with me?  \nYeah, Sunshine... it *did* matter because you almost screwed up pretty badly!  \nI mean... If I were an unreasonable person, I really could have just kept my mouth shut about seeing her poorly tagged work and said \"now you owe me something because you've lost my stuff\"\n\n\nOverall, now...\nPROS:\nn/a\n\nCONS:\nTerribly sh!tty staff (I cannot stress this enough)!\nIt's a huge pain in the butt to look through the racks of stuff; it's like going to a garage sale or a poorly organized clearance rack!\nA lot of the stuff is really old; I saw a shirt on the rack that was from Aeropostale that was seriously a 4 year old shirt; I know this because I bought the *same* distinctive shirt from Aero when I started a new job 4 years ago.\nVery disorganized drop off system.\n\n(and that is all that I can comment on because that's all that I've experienced).\n\n*In the future, I'd rather just donate this stuff to friends or the Salvation Army or something; it's not worth the ignorance endured @ Plato's Closet!!!", "business_id": "4POifj5aeBk4Zsjv4YZlrA", "stars": 1, "date": "2011-08-30", "useful": 7, "type": "review", "cool": 3}, {"funny": 3, "user_id": "_IgGcM8Jo07KO5Iorm7lkQ", "review_id": "SrFE0GmuZbV0drxiBxFS5w", "text": "I brought in four bags of clothes and walked away with all four bags. Oh and a whopping $5.05.\n\nThe girls working there are like 15 and of course lack social skills. Sadly, so do the older women who are trying so so hard to be 15 again.\n\nI rather donate these clothes to Goodwill than ever go to a Plato's Closet again.", "business_id": "4POifj5aeBk4Zsjv4YZlrA", "stars": 1, "date": "2011-08-08", "useful": 4, "type": "review", "cool": 2}, {"funny": 3, "user_id": "Wu0yySWcHQ5tZ_59HNiamg", "review_id": "suZWC4Ixqdojq5zT6lrS3A", "text": "Lady Yelper that FTR'd Hatam feels uncomfortable in Persian restaurants?  Now you know how Dudes feel stepping inside Cosmetic stores, Yoga studios, Spas and Nail salons.  I'm more adventurous nowadays, but years ago I keep 1km radius from those dropzones.\n\nVaziri Kebab ($10.99) \nBademjoon ($6.99)\nDoogh (Mint, Soda version $ 1.99)\nIstak (Pineapple $1.50)\n\nPolo overload for sure while my Friend quit after what she claims to be 2-mountains(?) of Persian Rice.  Her Food vocab is work-in-progress.  To speak the same linguo, I had the other 5-mountains.  Not to speak of the Raw Onion/Radish/Parsley I chowed on.  I was fully loaded leaving Hatam, to my surprise.  Definitely value-added.   3.5 *Star*\n\nKebabs showed signs of flame-marks and came with the usual suspects(Butter, Roast Tomato).  Nothing out of the ordinary except I've realized now Persian Stews aren't my go-to except when it comes with tender Veal Shanks.  The Bademjoon of Eggplant, cubed Veal, Tomato sauce and Capers didn't entice me as much as Britney Spears on Persian Television.\n\nThat casual dressed staff dude knows that we're SMART just from the orders.  Flattery got through to my Friend, except she didn't realize I'm the one who chose all the Food.   Dude calls out the order to his Dad at the back like my Persian Friend did at home to his parents.  I'm feeling the Persian-ality.", "business_id": "1Pw0sSdOWEiOE7_9rKnVyA", "stars": 4, "date": "2011-07-01", "useful": 4, "type": "review", "cool": 3}, {"funny": 5, "user_id": "QJI9OSEn6ujRCtrX06vs1w", "review_id": "2NzvNS4AOBVqbezbSBDL3w", "text": "I use this branch often.  Since it's on the way to the gym for me I like to stop here to conduct my financial transactions often.  Today I had to go inside and use a live teller.\n\nThe line was short and she was very friendly and pleasant.  I was 3rd in line when I arrived and was in/out in 5 minutes.  Awesome!\n\nNot much more to say about this branch other than it's pretty laid back and the employees are fast and efficient.\n\nWill I return?  For my financial sake....I hope so!", "business_id": "45arahaS6jTtYBw_STLDXg", "stars": 5, "date": "2010-08-19", "useful": 9, "type": "review", "cool": 8}, {"funny": 3, "user_id": "5VRkcTKUyHy39eybBBtO1w", "review_id": "8oXvYjedCztzSwSse9wKyQ", "text": "Don't waste your time. Unethical company, overpriced. Take my advice and stay far away. Legitimate businesses don't spam.", "business_id": "-P2S8aVVIjP6InbSefRrFw", "stars": 1, "date": "2012-12-02", "useful": 2, "type": "review", "cool": 1}, {"funny": 4, "user_id": "rHgT6lBbZ2PaHt0UWfTMtw", "review_id": "pNYLyUz06B0oZyc5PfrJUA", "text": "We came here on a Friday evening and 2 AYCE seafood buffet for $15 (We used the Casino Guide BOGO. Seafood buffet price for one is 10.95). Buffet comes with soda! \n\n- No cell phone reception. I have ATT and my GF has TMobile and neither of us had reception. Haha. Not being too far from Lake Mead and Hoover Dam, I'd think there would be, but this is besides the point! On with the food. \n- The buffet is an exceptional deal for what it's worth. Comparing other buffets in its category, Hometown Buffet, It's great.\n- Seafood options include mussels, clams, polluck, fried fish, popcorn shrimp, cocktail shrimp, and stuff crab.\n- Their roast beef was pretty dry, but you can put some gravy to give it a bit of flavor. \n- A must try is their chicken with artichoke and mushrooms. Possibly the best item in the buffet.\n- Solid side mash potatoes and rice. Can't go wrong that\n- I usually get soup at buffets, but didn't want to try the chicken noodle since it has a nice thick film on the top of the soup when I stirred with the spoon. Haha. \n- Their salad seemed fresh. I got some side mushrooms and olives. \n- The mussels and clams reminded of the quality at a Chinese buffet. The mussels were a bit tough and there were a lot of small broken shells when i bit into the clams. \n-Not quite a place where I would stuff my tummy and barf later. This is a good place to eat cheap when you are in the mood for a little bit of seafood variety at a sub-par taste. \n- Soft serve ice cream and cut pies. A ok. \n- Friendly service. \n- An average buffet that fits the average dive casino.", "business_id": "6usQ3JgXOv6x6JN7g8Fv1w", "stars": 3, "date": "2013-11-10", "useful": 4, "type": "review", "cool": 4}, {"funny": 3, "user_id": "EUtFaImcQQq5YDCRL1dHHw", "review_id": "76UgtGoL1wsFenjzOnSc-Q", "text": "This review will use the arbitrary rating system I use for all karaoke bars. See my lists for details.\n\nBar Zoé Karaoke Et Cocktails (etc.) is probably one of the best karaoke bars in Montreal. It does a lot of things really well, nothing really badly, and a few things...surprisingly--and comes on top in almost every respect.\n\nSinging:\n\nZoé's singing setup is the best I've seen anywhere. Singers (up to two live microphones) have a stage to themselves next to the DJ booth, and can easily read the lyrics from two visible screens. The acoustic is set up smartly with sensitive mics, invisible but powerful monitors and good instrumental tracks. The song selection is serviceable and often includes more than one version of popular tunes. If you've picked out a duet by mistake, the DJ will sing with you, even if he doesn't know the lyrics. He's a trooper.\n\nFor the best conditions in town to absolutely destroy a song, I give Zoé's five Busted Microphones.\n\nBooze:\n\nThis is Zoé's weakest point, which means it's merely good.\n\nThe selling point of their bar menu is obviously the cocktails, being in the business name and all. They're tasty, generally sweet items for people who prefer their poison colourful. The full list of available mixed drinks is quite exhaustive and you can expect to find something right for you. The beer, on the other hand, is somewhat disappointing, with a limited selection of somewhat overpriced brands on tap. Still, with such a solid offering, your friends will soon find it in themselves to belt out their best Sinatra.\n\nFor a great variety at the expense of decent cheap beer, Zoé receives four Bohemian Rhapsodies.\n\nExtras:\n\nThis is where this place really shines. \n\nLet's agree that Karaoke is a gimmick to sell alcohol to groups who normally would not be inclined to close a bar, let even go to one. Zoé recognized this and ran with it. They will gimmick the crap out of you.\n\nBefore the Karaoke starts, the bar doubles as a specialized fondue restaurant (!), and demonstrates a staggering dedication to the concept. The white tablecloths, the reusable towelettes, the wine card, the actually pretty great food and all the details I missed; it's like they're secretly ashamed of being a Karaoke bar. This makes for a mighty fine evening.\n\nThere are some other inspired decisions. The songbooks are actually computers with keyboard screwed into the walls; you can look up songs by title or artist name almost immediately, provided you know what you are looking for. Singers have their back to a giant screen where onlookers can easily read the lyrics and sing along. There is a smallish dance floor. The gambling room is entirely isolated from the main bar. The restrooms are way classier than they have any reason to be.\n\nFor outdoing themselves in any conceivable respect, Zoé gets five Awesomes out of a possible five.\n\nAs with any Karaoke bar, your night will largely by defined by the people with you. That being said, once you are ready to surprise your coworkers with that one song you sing really well, you'd be hard pressed to find a better stage than Zoé's. It's relentless assault of genuine coolness on what is essentially a kitschy activity will win the hearts of even the most stuck-up anti-singing drones. Five stars.", "business_id": "5KQrTh5gMQfZrA3yIlPrjw", "stars": 5, "date": "2011-08-19", "useful": 3, "type": "review", "cool": 3}, {"funny": 8, "user_id": "hv2FYLSr351y_XhXRXlmuQ", "review_id": "jcZfQQUIzeIxCdavreyCIg", "text": "C'est là que j'ai commis un superbe crime contre (l'humanité ?) un classique du rock des années 80 en chantant (massacrant) « Photograph », une des meilleures chansons de Def Leppard, groupe mythique qui a perdu de sa superbe après « Hysteria ». Certains de mes amis s'en souviennent encore, même si cela fait quelques années déjà. Mais je n'étais pas le clou de la soirée, l'un d'entre nous offrant une performance magistrale et troublante d'intensité (et filmée pour la postérité) de « Je suis malade », de Serge Lama. Je le revois encore, certains soirs avant de m'endormir, vivre avec passion les « je bois toutes les nuits et tous les whiskys, pour moi, ont le même goût, et tous les bateaux portent ton drapeau, je ne sais plus où aller, tu es partout... ». Allez, encore un petit bout : « ... comme quand ma mère sortait le soir et qu'elle me laissait seul avec mon désespoir, je suis malade... ». Désolé, c'est plus fort que moi, c'était franchement divertissant.\n\nMais laissons Serge Lama ou les groupes aux cheveux longs des années 80 pour nous concentrer sur le bar Zoé. Tout bon bar karaoké a besoin de deux choses : une ambiance amicale où les clients peuvent s'amuser et chanter en groupe, et une sélection très variée de chansons. Le bar Zoé répond facilement à ces deux critères (une de mes amies y est retournée à quelques reprises et m'a confirmé que le choix musical est toujours aussi excellent). L'alcool n'est pas trop cher, ce qui permet aux plus timides (ce qui est loin d'être mon cas !) de combattre leurs inhibitions pour mieux foncer sur la scène et offrir une version terrifiante d'un classique de U2 ou de Michel Sardou. Bref, un endroit idéal pour une soirée amusante.", "business_id": "5KQrTh5gMQfZrA3yIlPrjw", "stars": 5, "date": "2012-04-28", "useful": 4, "type": "review", "cool": 7}, {"funny": 3, "user_id": "ILWbq667w6aNR5d5oxeqxw", "review_id": "lzOFCNunim-MoYcEXqOfGw", "text": "When I moved to Toronto I immediately set out to get the necessities of life, which, of course, includes self-propelled commuter transportation. I didn't want to spend too much, and so I started to look for second hand bikes.\n\nIt became quickly obvious that most of the bikes I was interested in had been boosted. I know, I know -  you are all shocked! Call me old-fashioned, but having had a few bikes stolen in the past myself, I just didnt want to go that route...not that I wasn't tempted. So I headed out to local bike stores, swallowing my fears about the price. My fears about the price were not unfounded. There appear to be two main types of bike stores south of Davenport: those that are well-priced, but don't offer quality, and those that offer quality, but the bikes are almost *certain* to get stolen, because of the ginormous price tags...(I am not including the stores selling the stolen bikes).\n\nSo I ventured further North, and it wasn't long before I fell in love with a hybrid women's Trek - despite the flowered decals! (you know, it just wouldn't be a sports product for women without all that flowery shit on it). Being long in the legs, and short at the waist (sniff, sniff) a bike designed for women makes all the difference, hokey decals aside (I used similar arguments for my mtn bike and my downhill skiis, also of the prerequisite flowers and pretty colours, ugh i have no shame). \n\nSo I forked over the extra dough, and almost two years later, I couldn't be happier. Trek may not be hip, or made in the Netherlands, but I heart my bike, and it has been great. The initial service was good (they encourage you to take the bikes for a spin), and I haven't needed to go back since.\n\nAnd once the warranty is over, you can spray paint the flowers away!", "business_id": "CGpC_L37PBnIbs8TsuBEpA", "stars": 3, "date": "2010-01-07", "useful": 2, "type": "review", "cool": 1}, {"funny": 3, "user_id": "X2uF3C3YBD24xcgKA104Sw", "review_id": "czxrezYRddzWJq6stbDvqw", "text": "Now, if this was a review of the food alone, this would have an extra star, but it's not, but I will say - the food was much much better than the naff service here. It was that naff, I had to dredge up the word naff in my own personal lexicon so I could reuse it from my primary school days, just for this review. \n\nWhen the waiter looks at you, realises you are asking for a takeaway, then looks away for a couple of minutes, apparently thats a signal to start talking. When we remained silent, and not just a little bemused, he looked back at us, looked at the pad, and picked up the pen. Oh... right, we're supposed to be giving our order. OK. \n\nHe leaves, so do we, to run an errand. We return, the food is ready, and we are given a solitary bottle of warm beer. My pro-feminism wells up... but really, I don't think it mattered who the beer was aimed at, we just had one to share. For a meal for two. I'm back into a bemused state wondering who this kind of service impresses.\n\nLike I mentioned earlier, the food, it's nice enough, not too greasy either, but not memorable enough to make me want to go back to Bombay Lounge to deal with crap service again, not when there are other restaurants in town that provide better food and service. Sorry guys, your food isn't unpleasant, but you are.", "business_id": "65K_KR4eb5xpWAkYbH0j_Q", "stars": 2, "date": "2012-02-29", "useful": 2, "type": "review", "cool": 1}, {"funny": 3, "user_id": "_56O-ii3sNA_EqKUXCjHIg", "review_id": "O9UubGgTNFvjeFcYruJjew", "text": "I love the poutine here.  Although, I'm confused about the sizes.. I went a few weeks ago with some friends and the mini poutine was in a giant bowl... I got it last night and it was teeny tiny.   The taste is so consistently creamy delicious and I find myself fantasizing about the poutine on a weekly basis.  \n\nThey make a mean brunch as well which included a breakfast poutine.  I haven't tried it yet, but I will! \n\nThe staff is super friendly and quick.\n\nHeard they have Karaoke nights, bingo nights and dance nights, which all seem to be hit.", "business_id": "2tOFKXY2cBqLG8FYdaJHEw", "stars": 4, "date": "2012-10-16", "useful": 5, "type": "review", "cool": 3}, {"funny": 10, "user_id": "Wc5L6iuvSNF5WGBlqIO8nw", "review_id": "XF2EQlXBMqrS6gMQo8VeDQ", "text": "I am removing one star because the deep fried pickles and hot peppers have been removed from the menu. Unacceptable!", "business_id": "2tOFKXY2cBqLG8FYdaJHEw", "stars": 4, "date": "2012-07-13", "useful": 4, "type": "review", "cool": 5}, {"funny": 4, "user_id": "Us1y4hBCozBmfLqzvB80Nw", "review_id": "6uDgzQMUlRTdmVOxt5dOLQ", "text": "Cheap beer, greasy food and friendly lesbians.  \nIf that sound appealing to you then this place should be the place for you.\n\nI really like going here for beers after work on their side walk terrace.\nI also appreciate that the place is dog friendly", "business_id": "2tOFKXY2cBqLG8FYdaJHEw", "stars": 4, "date": "2012-09-12", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "Ga9DnmdmhE0Zzs_jRtmrfA", "review_id": "ROOHToJeXZ5qXFfovFlByQ", "text": "This is where dreams go to die. I wish that I could leave the review at that and warn you never to come here. Living close by I pass this place frequently and its aura just makes me want to run a warm bath and listen to Jeff Buckley and cry. I went in there once by mistake, confusing it for another pub and it was one of the few mid-stride u-turns I've ever done. Amusingly I wouldn't actually have been allowed in there as it's over 25's only. I think they're being a tad optimistic there, as the lowest age in there is at least double that. \n\nOutside the pub has its own mini-climate, a natural phenomenon caused by an ungodly amount of smokers puffing away consequently forming one of those cartoon style clouds over their heads. You can be guaranteed to see at least one punter storming out every few weeks with a torn shirt or something similar just generally shouting abuse, aptly confirming the name as The Grapes...of Wrath", "business_id": "EPNzKJvSSzN7U2oWGv99Dw", "stars": 1, "date": "2010-07-21", "useful": 1, "type": "review", "cool": 0}, {"funny": 3, "user_id": "oEshN5oq98_g23MvEnRc5A", "review_id": "XYpmgYFsuZXP6_bR50SoSg", "text": "If only there were a 0 star rating option...!\n\nI have the misfortune of having this pub pretty much at the end of my street, and to be honest I've put off having to review it for this long because I really didn't want to have to set foot inside. That may sound a bit pre-judgemental, but let me expand...\n\nAt any given time of the morning/afternoon/evening there will be at least 3 people over the age of 45, with about 6 teeth between them, smoking their 500th cigarette of the day in the doorway whilst already absolutely wasted. Whether they're shouting or singing at whoever happens to be unlucky enough to walk past is really anyone's guess - I think it's been a while since these guys said a sentence that wasn't all slurred into one long indecipherable word.\n\nHow this place ever got a license - it's only just opened a few months ago - I have absolutely no idea. Once you step inside, you immediately understand (and are extremely grateful for) the fact that the windows are frosted. If you've ever watched Shameless and are familiar with their local, then you'll know the sort of thing I'm on about. If you're not, you'd probably be horrified, so I'll spare you the details.\n\nEven if you're an alcoholic at risk of dying if you don't get a drink, and this is the only pub left on earth, don't do it.", "business_id": "EPNzKJvSSzN7U2oWGv99Dw", "stars": 1, "date": "2010-05-06", "useful": 0, "type": "review", "cool": 0}, {"funny": 22, "user_id": "eA8WqJj_15lWURDwE6DsKQ", "review_id": "DJWGsL-Cy7v4hWQ3l3Gxhw", "text": "A work dress of mine was damaged while at Green Clean. \n\nI called the manager/owner, Luis, nervous and expecting a \"Not responsible for damaged garments!\" response I know is standard  from other dry cleaning companies. \n\nNot even close! \n\n\"Bring it in, Meagan, and we'll take a look!\" \n\nBrought it in, and not only did he take a look, but had the seamstress repair the split hem at no cost to me, no questions asked.\n\nNow THAT is just one way a business can create and retain loyal customers. \n\nFavorite shirt dress damage aside, customer for life. \n\nThanks for continuing to take great care of my clothes at an affordable price, Green Clean crew!", "business_id": "FJTru-pQKKxRHpAHK_9NoQ", "stars": 5, "date": "2015-11-12", "useful": 42, "type": "review", "cool": 38}, {"funny": 3, "user_id": "s4O8baEyijx68SOrz668rg", "review_id": "CtxJQ2BlGv16cgihJsOzZQ", "text": "won some money at the tables earlier and I said \"what the hell\", maybe I should eat something.\n\nThat something turned into the $24.95 1lb burger at Sugar & Ice cafe inside of Wynn's Casino.\n\nThere were approx 50 customers, 49 of which ordered either ice cream or something sweet.  I walked up and said \"1lb burger, medium\"\n\nThat poor Asian lady behind the counter gave me a double take, I said \"yes I'm sure I want the 1lb burger. Oh no thanks, I don't need any extra plates to share, just me\"\n\nThey took what, 10-15 minutes to make this thing?\n\nhttp://www.yelp.com/biz_photos/L-zHt7gZITG1z8l7TZ4dUg?select=QzqxyTP-hLIc0rJoUvwiAA\n\nBurger was served on a cutting board so I sliced the burger into halves for easy handling and processing.\n\nhttp://www.yelp.com/biz_photos/L-zHt7gZITG1z8l7TZ4dUg?select=dT_-zMvshLJHqZTrf15u5Q\n\n5 minutes later I was done.\n\nwho's next?", "business_id": "L-zHt7gZITG1z8l7TZ4dUg", "stars": 4, "date": "2009-08-10", "useful": 1, "type": "review", "cool": 2}, {"funny": 3, "user_id": "RBZ_kMjowV0t6_nv2UKaDQ", "review_id": "NSbWrAn0-lPgsKQT4JKILw", "text": "My sweet tooth thanks me for finding this sweet shop. I found myself coming here every morning during our weekend stay and enjoyed way too many pastries and hot cocoa. But my favorite part about this little cafe? The outdoor patio that sits against the backdrop of the man-made (yet spectacular) waterfall. There's something serene about enjoying hot cocoa and a pastry in this setting while everyone else is still passed out from the night before. There had some amazing looking paninis that I didn't get the chance to try as well as ice cream, but if those are anything like what I had, I'm sure they are good. Not only is the Wynn a beautiful place to visit but do yourself a favor and indulge your sweet tooth at this little cafe.", "business_id": "L-zHt7gZITG1z8l7TZ4dUg", "stars": 4, "date": "2013-10-08", "useful": 7, "type": "review", "cool": 6}, {"funny": 9, "user_id": "TbhyP24zYZqZ2VJZgu1wrg", "review_id": "U8_08tV1Su8lgCEWBhrsHg", "text": "If you can really bring yourself to eat at a place called NUMBER TWO Restaurant (dear Lord help us), then you might be pleasantly surprised with this place. Solid 3.5 star but I'm rounding it up because I feel generous today.\n\nI have been eyeing Number Two (somewhat hysterically, because of the name) for weeks and it opened sometime over the past few days.\n\nNumber Two is definitely a Chinese restaurant geared towards whiteys. Or at least it's trying hard (and succeeding) to be \"whitey friendly\". (Who can blame them, really? We order ridiculous quantities of food, rave about how delicious it is even when it's not, plus generally tip generously! Bring on the whiteys!)\n\nHowever, when I was there today I was the only whitey amongst a half-full restaurant of asians. \n\nThey had all day dim sum which was highly tempting, but Jennifer K lectured me via bbm to order a Chinese dish, so I picked out my favourite - Moo Shu Pork. The menu is giant and has all your usual Chinese food dishes as well as a separate dim sum menu.\n\nI was really impressed with my Moo Shu! It was giant (for $9) and it was the healthiest restaurant Moo Shu I have tasted. Every time I get this dish elsewhere it is greasy as f*ck! (Canton Chilli, Lee Garden and Swatow are all entirely guilty of making it with far too much oil). Not here, it was nice and light.\n\nThe service here was really friendly and genuine. English spoken to varying degrees but the manager was very fluent. He came over to introduce himself.\n\nThe place is clean and they have clearly done some reno work to make it look slightly more modern than most of the other Chinatown haunts. Real linen (not plastic!) tablecloths, new chairs and tables, blue and white mosaic tiling at the bar/service area.\n\nOpen until 5am on weekends and 4am weekdays!", "business_id": "Ed5EiltgiPVaIKPHILRd8g", "stars": 4, "date": "2011-08-31", "useful": 8, "type": "review", "cool": 5}, {"funny": 4, "user_id": "0tvCcnfJnSs55iB6mqPk3w", "review_id": "IErB91vO9jYQE9MXxDmczQ", "text": "3.5 STARS \n\n  Las Vegas is a melting pot of restaurants from all over the World. Recently Graeter's Ice Cream, a popular Cincinnati ice cream icon opened up in the renovated Caesar's Palace food court. The company boasts that this is the first location West of the Mississippi River. \n\n The Vegas Strip is a grown up Disney Land. When I am in Disney Land I want to get ice cream. Our original intention was to stop at Ghiradelli in the Linq. Unfortunately this location falls far short on sufficient seating. So, my brother recommended Graeter's Ice Cream in Caesar's Palace. \n\n  Graeter's Ice Cream is incorporated in the Caesar's Palace food court next to Starbuck's. Because of its small size, I regard this more of a Graeter's Express than a full scale ice cream parlor. When I researched the company online, Wikipedia showed a sundry of flavors. However, at this food court location I saw ten signature flavors on the overhead menu. They were black raspberry chocolate chip, caramel gelato, chocolate, mint chocolate chip, dark chocolate gelato, mocha chocolate chip, lemon sorbet, double chocolate chip, vanilla bean, and salted caramel. I could write that it is quantity over quality with an argument that Graeter's specializes in a French pot method of ice cream making that is supposedly so good that they process it two gallons at a time. \n\n Just like Disney Land, prices in many of the businesses throughout the adult Disney Land are ridiculously expensive. For the price of what a couple of scoops cost here, unless your on a diet, it is worth it to go all the way for a sundae. \n\n  I ordered the strawberry shortcake sundae. It was two scoops of black raspberry chocolate chip and mocha chocolate chip ice cream in substitution for vanilla covered with strawberry topping, whipped cream and a cherry served in a paper bowl. The ice cream was delicious. But why don't they offer strawberry ice cream? It is only fitting that a strawberry shortcake sundae would go along good with strawberry or strawberry chip ice cream. Regardless, the sundae was delicious. \n\n  Regarding Graeter's, I  scream that their ice cream is a delicious treat if you are in the center of the Las Vegas Strip.", "business_id": "LgjI2iZlryV0bX5mwSgXEg", "stars": 3, "date": "2015-04-01", "useful": 4, "type": "review", "cool": 5}, {"funny": 6, "user_id": "NwVyki35xOcaxhMzHNtHDQ", "review_id": "faz6NnZaq0x6Y1qpe9_TtQ", "text": "There is something seriously awesome about being on the hunt for a really good pen, then having a lightbulb moment that there actually is a shop in Stockbridge that exists to sell stationary. Also, I'm quite thrilled to have reached a point in my life where I'll only write with a decent pen- obviously I've taken this to mean I'm a mature adult (who is delighted to buy a pen from a stationary store). \n\nSo yea, this place is great! It's nothing uber fancy, but you'll certainly get decent brands of stationary, more so than you'd get from your general grocer, but less than you'd find at a staples.  It's conveniently located in the heart of Stockbridge and staff were friendly and helpful. \n\nI'll certainly be back, mostly because I'll need some ink to refill my pens but also because the service was just fab. Colour me impressed.", "business_id": "AMqsJgQ7BxxHDVkEqcDW-g", "stars": 4, "date": "2016-08-19", "useful": 14, "type": "review", "cool": 9}, {"funny": 7, "user_id": "-XctJtbxJKRf84VKlQ0EPA", "review_id": "mLhpsYkJqhgTmgyR4DRxuA", "text": "This homeowner's \"management\" company can only be described as pitiful and horribly unorganized. I've spoken to just about everybody, and apparently nobody over there can find the 'customer satisfaction' or 'competence' buttons. Put it this way - they lost my HOA payments, credited the wrong amounts, credited someone else's check to my account, charged me rebill and late charges when none were due, etc. I don't know who the principals of this firm are, but they should be shot. Out of a cannon. Twice.", "business_id": "5aYBdm3meMqyKkzJV72Uqw", "stars": 1, "date": "2008-07-07", "useful": 12, "type": "review", "cool": 3}, {"funny": 3, "user_id": "bLbSNkLggFnqwNNzzq-Ijw", "review_id": "n-gL4klz2DWy7eI-aYkhOw", "text": "Health Hut is just what it sounds like: a small locally-owned vitamin shop. Ownership is Asian with religious statues and offerings by the door, and some medicinal herbs available. By and large, this place is reminiscent of nearby J&J Health Foods on Lake Mead. Selection is limited, they offer more niche or specialty vitamins that emphasize purity and come with a larger price tag: saw bottles ranging from $16-30 , which I felt was a bit pricey unless you specifically need a particular vitamin blend or brand for whatever reason. I was sad to see that they have a very limited protein selection, none of which are hemp-based.", "business_id": "Nsj6iz4bQFFAO4LuQHfhow", "stars": 3, "date": "2015-06-18", "useful": 4, "type": "review", "cool": 6}, {"funny": 3, "user_id": "utRlrauZEOF_2kASsIoJ7A", "review_id": "MLXcVHHIdu6TggTg5y3W8g", "text": "What pretty wee things! This lovely shop at the bottom of Broughton Street sells an array of things you don't need, but you can't live without once you see them.\n\nCards, notebooks, candles, local Edinburgh designer ditties like stags heads, prints from local artists with scenes of Edinburgh. I went in and immediately picked up about 4 things but put them all down again when I realised it was all impulse buying.\n\nThey also have some beautiful jewellery that I kind of want, a lot. But again, impulse...\n\nThe perfect place to come for a wee card, gift or even a special something for a special someone.", "business_id": "5cWnpI6y8n-L8v4zT1Mq7A", "stars": 4, "date": "2013-05-10", "useful": 5, "type": "review", "cool": 3}, {"funny": 5, "user_id": "3nDUQBjKyVor5wV0reJChg", "review_id": "ykwyaygrZdFYOJ_aovrXVw", "text": "YELP 365 CHALLENGE 2014-(188/365) \"BBQ & Slush Puppies!\"\n\nWe would constantly pass by this street vendor, and after a few weeks passed, we decided to give it a go. Situated on an open lot at the corner of N. Grand Canyon and Horse Drive off US 95, you can't miss the huge white trailer or the signs advertising BBQ and SLUSH PUPPIES!!!(yup, he has a Slush Puppie machine inside the trailer)\n\nWe were the last customers of the evening(about 9 pm) and by then, Mr. Jorgenson had already run out of ribs and brisket, but still had burgers, hot dogs, hot links pulled pork, and of course SLUSH PUPPIES! His Hot dogs and Links aren't made from scratch, but his meats, burgers, and sides are. Meats are either sold by the pound, or you could get them in a sandwich(brisket, pulled pork) We decided to split a Pulled Pork Sandwich and a Smoke N Pig Burger at $7 each and two SLUSH PUPPIES!!! We chose Grape and Sour Apple, $3.50, 24 oz. He also has Cherry and other flavors too.\n\nConversating with Mr. Jorgenson while making our order, we found out a few things-\n\nThis man is very passionate about his barbecue, very personable too...\n\nMr. Jorgenson is kinda like MacGyver....He was out of hamburger buns, so what does he do? Sandwiches the burger and Pulled pork with two hot dog buns! Love It!\n\nHe's known to have off the menu specials every once in a while\n*He recently had Baked Spaghetti that he sold out of...\n\nHe also accepts credit cards-suh weet! most Street vendors are cash only\n\nHe is one of the last (if not, the only) vendor in Vegas that has SLUSH PUPPIES!!!\n(Sorry if you don't get the nostalgia behind it...:P)\n\nThe Pulled Pork was nice and juicy without being too fatty with a nice smokiness to it, and the sauce is a combination of sweet, tangy, and smokey with a little kick at the end. The burger which is his own blend of chuck and brisket was done over an open flame grill to a perfect medium rare/medium with a nice char flavor with lettuce, tomatoes, onions and your choice of cheese. Wifey went with the Jalapeno Havarti as suggested by Mr. Jorgenson. We were very pleased with our choices, but would ask for more sauce on the pulled pork and to toast the buns for sandwiches/burgers.\n\nHis business hours vary...He opens at 5 pm, closes between 9 and 10 pm, depending on business, availability of items, and takes two days off a week.\nIf his trailer isn't there, he's off doing a pop-up service at a local business in town.\n\n*The best thing to do before taking the drive out is call to check hours, availability of items and location so you won't be disappointed. Definitely looking forward to returning much earlier to try Smoke N Pig's Ribs, Brisket, and sides!  ALOHA!!!\n\nShaka Meter:  \\uuu/  \\uuu/  \\uuu/  \\uuu/  4", "business_id": "GsXmR2sfhxj1mH18pTwuPw", "stars": 4, "date": "2014-07-25", "useful": 6, "type": "review", "cool": 3}, {"funny": 11, "user_id": "qygModUyyK_Hi_b1uxSLFA", "review_id": "x4jLzspD3mbWkk9J8331bA", "text": "Going to Midwestern University for treatment is like taking your dog to the vet for a hair cut.\n\nThere is a 75 percent chance you will not see a doctor. Instead, you will see a \"student doctor\", who will poke and prod you too hard, read a bunch of items off of a checklist, and then hurriedly and nervously leave the room to fetch the real doctor when they run out of things to ask you.\n\nAfter fifteen minutes or so of waiting, the real doctor will come in and sit down with you (while the eager student taking notes or something), briefly explain to you why you're feeling what it is that you're feeling, write some prescription in handwriting not even the pharmacist can read, and then leave you to your fate.\n\nI once went in to have blood work done, as I was experiencing intense mood swings that coincided with constant hunger pangs. Although my test results indicated I had \"high liver function\" (the kind that you get when you have an alcohol or tylenol problem, which I didn't have), I was given anti-depressants on the sole basis that I had admitted to the doctor that my parents were in the middle of a divorce. \n\nOh, and as he handed me the prescription of anti-depressants, he mentioned that there was a good chance I would experience night terrors and noticeable weight loss as a result of taking them.\n\nWho the hell gives a drug that will instill weight loss to someone complaining of hunger pangs?\n\nIf you must go here, avoid making an appointment on Thursday. It's admittedly their busiest day of the week.\n\nOne of their former Board of Directors was just released due to an impending malpractice suit.\n\nAnd their choice of magazines suck.", "business_id": "Av5sQ23lGXmKVsvB2UMM3A", "stars": 2, "date": "2008-06-27", "useful": 7, "type": "review", "cool": 5}, {"funny": 3, "user_id": "-FZBTkAZEXoP7CYvRV2ZwQ", "review_id": "H8h_hTvJk8hQ_gRQsNTvew", "text": "As I'm nearing the last leg of graduate school and looking into professional schools, I am weighing all my options before applications are sent out on June 1st. A doctor friend of mine did a post-bacc program here, and he recommended I come and check out the campus and speak with the staff members.\nThis campus is pretty big, and their facilities are very modern. When my friend came to school here, it was before all the construction took place. Now the brand new facilities house students in their DO, PA, DVM, and post-bacc programs.\nI sat down with some of the faculty member here and inquired about their admissions criteria, their match rates, and where my application stood. So I have a good application thus far, but the MCAT will determine it all. There are good post-bacc options: the 1-year MA program, and the 2-year program with an emphasis on research. They are good feeder programs to the professional school on this campus. A good option to keep in mind.\nThe environment itself is good for studying, as there are no distractions and the students are very focused. \nWill I end up here in the next step of schooling? Time will tell. But I am impressed by their school, and it's only a 6-hour drive from LA.", "business_id": "Av5sQ23lGXmKVsvB2UMM3A", "stars": 5, "date": "2016-02-07", "useful": 9, "type": "review", "cool": 6}, {"funny": 3, "user_id": "5jJjY5_R06Og56VfjIc66A", "review_id": "06yGJ_lxBTA7xHgMVwzG3Q", "text": "Want to dine like a rock star??! Follow these four simple steps\n1) Buy a competition dining ticket\n2) Roll up to the front door of Bonterra, hand your keys to the valet, wink at the paparazzi\n3) Order some drinks or wine from the list of 200 and make it rain, as you're seated and greeted by the talk of the town\n4) Open an enormous can of Holy Crap NC Competition Dining Awesomeness and enjoy!!\n\nTonight the Mandrake and Dogwood crews competed for bragging rights, entry into semifinals and a $2000 check. Each team made 3 courses: a starter, main course and dessert. And the secret ingredients were ... drum roll...Organic Arugula and Calvander cheese from Chapel Hill Creamery. First you sample the ingredients in their purest \"naked\" form and then the dishes start flying out of the kitchen!! After each dish you rate it on a smartphone app based on everything from Presentation to Aroma to Use of Secret Ingredient. Votes are tallied in real time, separated by the Pros and the Joes, celebrity guests and chefs like our own CM Nikki and people who just like to eat. At the end the teams come out and run through the crowds soaking in the glory, until one is crowned champion! Tonight Dogwood Southern took the prize handily. Both teams had some amazingly creative dishes with spectacular flavor combinations that included uses of the cheese in everything from grit cakes to ice cream, and the arugula in everything from Spaetzele to gelato!! Wow! This is quickly becoming a \"must do\" annual event here in Charlotte!!\n\nOh and almost forgot step #5 - \"accidentally\" swap valet keys for the Maserati parked out front and drag race on South Boulevard...just kidding!Or am I??", "business_id": "Jo1t0_Tl27ejGQO9g3GDQA", "stars": 5, "date": "2015-04-08", "useful": 3, "type": "review", "cool": 3}, {"funny": 4, "user_id": "Zk95TMXDx0zMUhYq5u8pxw", "review_id": "gx6J75UmmhdQsJQcNA9i5g", "text": "Nursing the ailments of a late night out with some complimentary Starbucks (pays to have a wo-man on the inside!) my friends and I began discussing the hideous condition of our feet and making plans to remedy. All it took was a glance up from our lattes, and we saw it: the Hollywood Nails sign; the $35 Mani-Pedi sign; the 10% all services sign. DING DING DING DING.\n\nWe went in and requested an appointment so all three of us could get our services done at the same time; we returned at the time of our appointment to see that all chairs were full, and they took us in one at a time. So much for the appointment, but there was some overlap and the three of us got to sit next to eachother in uncomfortable massage chairs reading awful magazines.\n\nMy pedicurist was clearly not having a good day, and spent a while hiding in the back before she finally came out to seat me. She worked quietly, breaking the silence only once to roll her eyes skyward and let out a huge sigh --hey, lady, my feet aren't THAT bad! She also argued with me about my thumbnail, refusing to cut it how wanted it. I have to give her credit though--she literally CREATED a pinky toe nail for me! \n\nHer mood improved drastically when she sliced me and I told her not to worry about it ... she even lied to me with great enthusiasm that I had great nail beds! \n\nMy toes looked excellent and are actually still in tact a month later. Great price, and I now have TEN toe nails instead of eight! What a deal, I'll be back.", "business_id": "5IEmInzR6tlsyAuOPzmvNw", "stars": 3, "date": "2012-10-12", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "MMf0LhEk5tGa1LvN7zcDnA", "review_id": "JIqvkOWWAnJiuIMQ5to32A", "text": "The premade sandwiches at the deli are pretty good. To be honest I was pleasantly surprised.  In fact, that sandwich was one of the better ones  I've had in a long time.\n\nIn addition to great sandwiches I usually can find everything that I need with no problems. The sales associates are very polite, friendly, and helpful.  The prices at Fry's are competitive in comparison with other grocery stores in the area. \n\nThe Deli  service can be slow at times but is worth the wait. If you ever need a six foot sub Fry's has a really nice selection to choose from and they all are delicious and reasonably priced", "business_id": "PB3Y13jd4gFUBxkAg-XwMg", "stars": 3, "date": "2016-08-05", "useful": 6, "type": "review", "cool": 5}, {"funny": 5, "user_id": "hjcOqlZLCvOQvwMdLsiOcw", "review_id": "4ZtWx55I0kwopTxM_I27PA", "text": "roar boom fireballs \nwow wow - this is how we kill \nrecruiters wet dream. \n\nSorry, but all of these multimillion dollar death machines creep me out.\n\nCarry on.", "business_id": "O5rigVcF_67GsPlXVi_zVQ", "stars": 1, "date": "2010-09-05", "useful": 3, "type": "review", "cool": 4}, {"funny": 3, "user_id": "mdmFPUq98OtP8BQ4fCs8wA", "review_id": "KzwDHDovGWw5hW0o7_4oAA", "text": "Fried food, funnel cakes, grilled bratwurst, grilled everything, lawn chairs, large crowds and lastly, hundreds of port-a-potties! Sounds like a typical festival with the addition of aerobatics. I loved the energy and the atmosphere. There were activities for kids -- bounce houses, rock climbing, mini golf and toy souvenirs.\n\nI'd think that the best way to do this would be to bring your own lawn chairs and sit in that grassy area right behind the more expensive box and VIP sections for the best views. The box sections themselves are on top of the baking hot pavement and the seats there consist of folding chairs that will not be as comfortable as your own lawn chair. This is indeed a case where the cheaper ticket is the better ticket and that extra $10 for the box section might be better kept in your wallet. There's really no need to be in front, because the air show is, well, up in the air.\n\nI had a nightmare involving portable toilets that night. I won't elaborate. Overall, it was great for kids and a fun family weekend activity that trumped my mortal hatred of, um, portable toilets.", "business_id": "O5rigVcF_67GsPlXVi_zVQ", "stars": 4, "date": "2014-09-01", "useful": 1, "type": "review", "cool": 0}, {"funny": 4, "user_id": "Wt7EzEJSgFLnmVsaA28ADA", "review_id": "0PzNwAb9RzGu8S0oLxBRQw", "text": "The Willow House has lots of unrealized potential.\n\nIt looks like a hostel as much as it does a coffeehouse from the approach.  I was expecting to see a garden variety of drifting McCrustersons sprouting from the porch and was queerly disappointed when there was not.\n\nThe interior is run-of-the-mill ordinary.  The menu is pretty lean for breakfast; muffin, bagel, or something like a muffin or something like a bagel.\n\nMy friend and I got bagels and cream cheese. Her with coffee and I with earl grey.  The bagel was not really toasted enough and the cream cheese was 2 prepackaged \"PHILADELPHIA\" pouches dropped on my plate.  Jen said the coffee was ok and I suppose I could say the same about my earl grey--simply a tea bag in a mug of hot water.\n\nDespite the subparness of the eats and drinks, there are a few things that are really positive about The Willow House.  Such as:\n\n+++Free Wi-Fi+++\nNot only free, but blazing fast Wi-Fi and no silly password or time limits.\n\n+++Vinyl Digging+++\nTheir is a coat closet filled with 12\" albums covering a good range of musics and qualities POOR to VERY GOOD and maybe some NEAR MINT if you really dig. The price was reasonable too with $1 per one or $6 for an entire crate (50+ LPs)!!!\n\n+++Local Resource+++\nThe local rag is there as well as flyers for DIY shows and even a Crispin Glover speaking event.  This is pretty ordinary, but still always commendable when these types of resources are getting fewer and fewer with big box infiltration.  Not every biz allows free advertising space for DIY artists and musicians.\n\n+++Outdoors***\nRed picnic tables are scattered around in the side lawn of The Willow.  True that in Phoenix, comfortable outside dining time is limited. Near these tables there is also this wall comprised of beautiful metal panels all colorfully weathered, rusted, and corroded.  Perhaps I am biased with my unorthodox rust-belt view of what true beauty is.--But I find it so and i write so and so it is.\n\n***Cats***\nI am a gigantic catfag in every way.  Outside, next to the picnic tables there was a concrete garden bench and under this bench was. EEEEEKKKK!!!  A mussy mess of black and white cat keeping her cool.  She was a very skanky looking cat and I was smitten.  I instantly made her a little song as I sung to her and took photos . I think, \"Dusty Desert Skanky Cat\" was part of the lyrics and it was a tad Pete Seger sounding.  I later learned that that was a momma cat that the employees of The Willow House named Thundercat and there are other cats that climb a tree to bathe in the morning.  Yeah, I can see myself returning for the pussy and pussy alone.\n\nI hope that The Willow House uses these posi things to build themselves a better tomorrow.", "business_id": "0q8A_jB8ft7vExBQpxL2lg", "stars": 3, "date": "2008-05-03", "useful": 2, "type": "review", "cool": 1}, {"funny": 3, "user_id": "1vuWvfjdGF106in2K1z-VA", "review_id": "EIKE77avyaEAlnlSG9mibA", "text": "I will do anything or use any excuse not to go to this place. I hate dealing with all the people here and the staff. If I wanted to be judged, I would rather go to church.", "business_id": "0q8A_jB8ft7vExBQpxL2lg", "stars": 1, "date": "2007-12-26", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "qnbh2dQj-RaICIk-nr-B_A", "review_id": "XIFf23Nvv7jqmRLbaoRFNw", "text": "Now, just wait a minute, Tex.  I had NO idea this place was so good.  Brand my ass with a \"B\" and call me Buford, I just LOVES this joint.\n\nEaster, just before high noon.  After our hike, we wander around, thinking about having some ice cream, but you know.  I'm really thinking about something more substantial.  We were actually looking for a different place, but when we saw Longhorn, never having been to one, we took a shot.\n\nGreat people.  The chef came out, twice, to talk with us.  FOUR people checked in with us, but never obtrusively.   The waiter did rattle off the prepared speech when he found out we were Longhorn virgins, but it was handled professionally.  (No hugs, no high-fives, no tongues.)  The Child Who Walks As A Goddess ordered an obscenely large dessert, and when we commented on the massive size, not complaining mind you, they comped it.  First time there, they wanted to keep our business.  That's very good management.  (And she'll be eating if for dessert for several more days, thankyouverymudge.)\n\nOkay, the food:  I just had to get a steak, just a little one, nicely seasoned, very much to my order of done-ness, with a sweet potato topped with butter and cinnamon.   Just perfect.  The ladies had a salad and a kid's meal, both just right.  The Salad Lady is oh-so fussy about her greens, and she raved.  \n\nIgnore that this is a chain, and that it is in mega-mall land.  I recommend this one very highly.  (Were I still able to sit at a bar and drink while watching some mind-numbing sport on TEEvee, I would land here.  What a great place.)", "business_id": "3R6UGi7SU-rHc8FO2VZ29Q", "stars": 5, "date": "2010-04-04", "useful": 2, "type": "review", "cool": 1}, {"funny": 3, "user_id": "NfU0zDaTMEQ4-X9dbQWd9A", "review_id": "byssZ8QR0aD_Y7ZXhdglXg", "text": "Another great experience and I didn't totally screw over my diet!\n\nI had a chili cheese dog, no bun and my man had a breakfast dog. Holy breakfast dog--get this thing, like now. A fried egg, bacon and cheese all on a dog? You bet your ass.The chili dog was great, even without the bun and the chili itself was very meaty with what I think were black beans. I also ordered a salad and skipped the fries. \n\nThe owner is awesome, the bartender was a peach and the drinks are cheap. \n\nLove this place!", "business_id": "C7dj06ZUM-5P-_DMLckcVA", "stars": 5, "date": "2013-02-27", "useful": 5, "type": "review", "cool": 3}, {"funny": 3, "user_id": "ner9UIIzqU_0B0yktQCOFA", "review_id": "0yynIPtDe83kkEolMzyKGg", "text": "Jason is ALWAYS completely creative, and awesome! \nBiker bar meets executive chef? And fabulous food of course :)", "business_id": "C7dj06ZUM-5P-_DMLckcVA", "stars": 5, "date": "2012-11-07", "useful": 2, "type": "review", "cool": 2}, {"funny": 4, "user_id": "3gE3_MDUsCg-Tay4t1R5nA", "review_id": "IMpO8qN8E6X3Qtsrlg_syw", "text": "So, being from Illinois, I'd never had a \"ripper\" which it turns out, is a deep-fried hot dog and in this case, smothered with fantastic slaw and all kinds of other delicious items which I can no longer recall. The perogis? Exactly right. Giganto potato wedges with ballpark mustard? C'mon. \n\nLion hosted a fantastic weekend of Mods vs Rockers complete with a giant parking lot for the meet-and-greet plus a huge menu with something for everybody (I wasn't feeling too adventurous when I got into town so they whipped up a simple mushroom/Swiss burger for me) and an equally huge beer list from cheap to not cheap. There's a ton of space for your friends, lots of space to park your motorcycles and scooters and a really long bar to prop you up as you go.\n\nIt's been added to my \"Cleveland Rocks\" destination itinerary. Thanks, Lion.", "business_id": "C7dj06ZUM-5P-_DMLckcVA", "stars": 4, "date": "2011-08-23", "useful": 7, "type": "review", "cool": 6}, {"funny": 4, "user_id": "qlC607Cyp0Mj91vDFvkp3Q", "review_id": "TTy4Lshfd_sLJm-DwX3AJQ", "text": "As others have mentioned, it does seem a bit creepy deepy to a) review a cemetery and b) also see the categories for this location as \"Funeral Services & Cemeteries\" AND \"Active Life.\" However, that's a perfect description of Elmwood Cemetery. It is a stunning space of lush green grass, ancient trees and flowering bushes and home to some of the oldest resting places in Charlotte. \n\nDuring the daylight hours, this space is a breeding ground for dog walkers, joggers and pensive, respectful photographers. The winding roads are great for anyone who needs a bit of exercise and many of the gravestones are quite beautiful and interesting. Many of the folks buried here were from the same well-established (old money) families who still reside in Charlotte today. \n\nWhile it may seem odd to schedule a run in a cemetery, I promise that you won't regret it at Elmwood Cemetery. It's picturesque, interesting and, of course, quite quiet!", "business_id": "AAT50SSFgYWh4ntRAnxwuA", "stars": 4, "date": "2011-04-10", "useful": 5, "type": "review", "cool": 2}, {"funny": 4, "user_id": "8-c_N_vSkwVieg8sHn_Ppw", "review_id": "vqQN3IwihxtIS6Uw_JMMhA", "text": "I think of this cemetery as a park. And as parks go, it is really nice. It has lots of paths, trees and flowers, which draw joggers all day. It less than a 10 minute walk from the center of Uptown, which is close enough to be convenient but far enough that you can see a spectacular skyline.\n\nAnd most of the residents are very very quiet. They hardly ever crawl from the ground as reanimated specters of their former selves and pursue you with the familiar zombie rallying cry of BRAIIIIIIIIIINS. Still, I wouldn't hang out here after dark. The neighborhood is so-so even without the living dead.", "business_id": "AAT50SSFgYWh4ntRAnxwuA", "stars": 5, "date": "2011-04-06", "useful": 1, "type": "review", "cool": 0}, {"funny": 5, "user_id": "Uwu72w77MPox942_GnCS7g", "review_id": "iOgZUXemAfcOu3G0q4FDGQ", "text": "I'm totally crushin' on Yogurty's. Like, to the point where I want to send it secret notes that read AVITANIA + YOGURTY'S = LOVE 4 EVA. \n\nOf the FroYo joints that have popped up in Toronto as of late, Yogurty's is the only one that comes close to competing with the chain that's nearest n' dearest to my heart, Yogurtland in California. The consistency of the FroYo at Yogurty's is consistently silky smooth and light (but still being substantial). This is in contrast to Toronto's other popular FroYo stops like Menchie's (large ice crystals in the yogurt), and Yogurt Spoon (slightly runny). The selection of flavors is large, and includes Tart (my favorite; it's a little milder than most \"tart\" FroYos), Honey, Chocolate, etc. The Vanilla is rather cloying, though. \n\nI also like the huge topping bar at Yogurty's, which includes the usual staples: fresh fruit, sprinkles, fruity popping boba, chocolate chips, cereal, etc. However, they also have options I haven't seen anywhere else, like River Rock candy (which I think is a little gross, but hey, it's your sundae), chocolate-covered pretzels and Cookie Dough. You got that right. COOKIE M'FING DOUGH. Nom, nom, nom. They also have a \"cheesecake\" topping that you put on to your FroYo with a scoop, but to me it looks like egg salad, so I pass on it. \n\nThe bins for the dry goods at the topping bar (cereal, candy chips, etc) are rather small -- which is good since they have to be replaced/replenished often, but also bad because they get a little difficult to maneuver around, and as a result the floor around them always seems a bit sticky. \n\nThe price is a little bit higher than similar shops, but it's worth it for the bacchanalian selection of yogurty deliciousness at your fingertips.", "business_id": "7w1jHGZ3kBYuTHa9nmjRyQ", "stars": 4, "date": "2011-08-31", "useful": 6, "type": "review", "cool": 4}, {"funny": 12, "user_id": "hjcOqlZLCvOQvwMdLsiOcw", "review_id": "X9Ggp7IbklhQrCF_QfyAhA", "text": "I WILL CUT YOU BI@TCH!\na straight razor - l think they\nthink it.  me likey.\n\n\nShave and a haircut... 52 bits. Worth it. Great haircut, straight razor shave by hot latinas. Awesome. \nUPDATE 18 hours post shave, just a hint of stubble. \n\nNote to self: there is something oddly arousing about having a latina hottie snap your head back and put a straight razor to your throat. \nI'm just sayin...\n\nCarry on.", "business_id": "P4L8rl5_q6XrVhNq_AMufw", "stars": 5, "date": "2009-08-04", "useful": 8, "type": "review", "cool": 8}, {"funny": 3, "user_id": "aLvxbF2DueKFOqul9eVWCw", "review_id": "G4qT_AXGdiQWNoRGZ5XjuA", "text": "Oh boy, what can I say about this place. This 241 location is just...Gross. That pretty much sums up the experience here. \n\nThe food itself is what it is...decent take out pizza and panzerotti - which is what I regretfully ordered after having to eat the whole thing with my bare hands, due to not wishing to use the dirty cutlery given to me. \n\nMy hands covered in grease is one thing, but watching the lady behind the counter pull out the plastic knife/fork from a dirty bin on the bottom shelf, casually wiping them off with a towel (though still leaving dirt stains on it) did not help with the appetite. Also quite unappetizing, seeing the lady behind the counter place pizza toppings into the dough with her bare hands, meanwhile taking a moment here and there to wipe her runny nose! \n\nThis entire location is just dirty. As soon as you walk in, you will see the stained and damaged floors, the uncleaned counter, the unhygienic area behind the counter, and the unkept display shelf where the pizza lay. I didn't look for it, but am VERY surprised that this place passed its Health Inspection. Will not be back.", "business_id": "7m0SawviknWDpUlmtZLrQg", "stars": 1, "date": "2016-03-05", "useful": 4, "type": "review", "cool": 3}, {"funny": 3, "user_id": "jGbj8fl575EIQJcfaA1FKQ", "review_id": "tyeo67Fr90GsINjuWr3QEA", "text": "My tongue beat my lips to death.Can we have a Amen ? Why is there not more people here? A Great location . Yumm Yumm I am glad this place is not closer I would be mopping the floors for free. Look  do not take my word for it  fight the traffic losen your belt get a spoon and pray for another cup of that creamy heaven. And my point is...  Mikey tried it and he likes it he likes it...\n I need a larger spoon.", "business_id": "BEpUZHL0FdBWa4egx1r2LQ", "stars": 5, "date": "2013-05-31", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "htiVdsiY_rBmJc65aZ3YAA", "review_id": "YmA4Ngsu_KJLSUPvof6qvA", "text": "BLAH!!!  When will frozen yogurt places get it????  We want DIY and we dont want your stupid TART frozen yogurt!!!!  What a disappointment this place was!  I was here a few weeks ago - totally jacked about a new frozen yogurt place and I should have listened to Tiffany!  This is NOT my kind of place.  I dont need some pimply-faced queen in training to be my YUM EXPERT (as he called himself) and try to explain how to build a treat.  I know what I want and I know the right portions of which topping grrrrrr!!!!!  The yogurt was pinch in the back of your mouth tart and the toppings (although plentiful) were all in different proportions as to what I would have preferred but since I didn't want to be in there for an hour explaining this to my YUM EXPERT I let him do it and of course it wasnt right and not worth the money.  TCBY me anyday!!!  Bleh!", "business_id": "BEpUZHL0FdBWa4egx1r2LQ", "stars": 2, "date": "2011-07-12", "useful": 2, "type": "review", "cool": 1}, {"funny": 3, "user_id": "l-tDF960t9BakjyH34XfTA", "review_id": "es6Kke_at43hAr-ti4jerA", "text": "I was stoked to finally try the much hyped Pinkberry. Paris Hilton likes it so it has to be good right? Well apparently no. I went this afternoon where it was insanely packed which I can handle but was expecting more of a selection flavor wise. I got the pomegranate fro yo topped with blackberries, kiwi and fruity pebbles and it was good but I've had better. I would rather go to Yoforia, mix and match and have it weighed. Also, I'm a pretty happy person however the happy happy joy joy act was a bit too sunshiney happiness up my butt for me personally. But then again, I was hungover so......\n\nIt wasn't horrible but definitely didn't live up to the hype. I would go again but definitely won't be having a Pinkberry craving anytime soon.", "business_id": "BEpUZHL0FdBWa4egx1r2LQ", "stars": 2, "date": "2010-08-28", "useful": 2, "type": "review", "cool": 2}, {"funny": 4, "user_id": "gru76BjkRY6UQVcw_yAxiQ", "review_id": "9YYZTM6nQz-af0ESgcMZxQ", "text": "Well, hello Phoenix Yelpers. It's certainly been a while since my last review (maybe a confession is in order?). Well, even though I have lots of recent business experiences that I could have chosen to write about as part of my triumphant return, I think I will (re-)start by reviewing a local business run by hard-working people committed to quality results. What could be better than that?\n\nMy husband, Myles M, found Angel Eye on Kudzu.com, which is great but not as great as Yelp, of course! Now that I'm reviewing them on Yelp, it should be even easier for people to find them, which is a very good thing for the following reasons: \n\n1. They respond to inquiries really promptly. I emailed them for a quote and had a well-written, detailed response in my inbox just an hour or so later. \n2. They confirmed with me the day before and morning of my first scheduled service. Life gets hectic and there's nothing better than a reminder (or two) of an upcoming appointment. \n3. They arrived promptly without calling fifty times for directions. We've hired service providers who have called asking for step-by-step instructions for arriving at our home. That's what Google Maps is for. \n4. They asked for clarification. As any teacher, parent or boss would say, it's better to ask and do something right than to not ask and do it wrong. \n5. They got the job done and did it well. In just four hours (keep in mind we have a fairly large house that hasn't been cleaned in, say, 9 weeks), our house sparkled from top and bottom. I almost didn't want to cook a meal or walk around for fear of dirtying the place! \n6. They were upfront about their rates and didn't try to upcharge when the work was completed. We all appreciate honest and fair dealings, especially in this day and age. \n\nAfter seeing the results of their first cleaning, I hired Angel Eye to come back for bi-monthly cleanings. I look forward to having a great relationship with them (and a very clean house) for years to come!", "business_id": "1dCPyRx2sLSMP34T49a_wQ", "stars": 5, "date": "2009-07-17", "useful": 16, "type": "review", "cool": 9}, {"funny": 4, "user_id": "6rGVoAI0Bl8ZEbMNJWOK3w", "review_id": "hxpwQuGBBoFPPJSwo6qWLQ", "text": "What do they fill the windshield washer bucket with? Swamp water? Port-a-potty \"juice\"? I'm all for recycling but this was so disgusting.  My husband spilled one drop on his shoe, and even though he wiped it immediately with some baby wipes we had in the car, it didn't matter.  As we drove away from the gas station I was noticing the skunk scent, I couldn't stand the smell.  I made him turn around and go to the grocery store bathroom to wash his shoe.  YUK!  Those shoes are going in the dumpster.", "business_id": "3xMIe_qz6wKBrbThXdMiMA", "stars": 1, "date": "2013-04-28", "useful": 3, "type": "review", "cool": 1}, {"funny": 3, "user_id": "QJI9OSEn6ujRCtrX06vs1w", "review_id": "OaxlEKjKVzlM0A9vfIAsVA", "text": "On the drive back to Vegas from Scottsdale, this is the gas station where I fill up the car.  It's on the way to Carefree Highway and has nice wide lanes and an easy in/out to Scottsdale Rd.  The convenience store also has a nice selection of snacks to load up on before the long trip.\n\nReturn Factor - 90%", "business_id": "3xMIe_qz6wKBrbThXdMiMA", "stars": 4, "date": "2011-03-30", "useful": 5, "type": "review", "cool": 2}, {"funny": 3, "user_id": "4Q6IMr3hkYuKV02VrhXWLA", "review_id": "ePxD5wmkMDMsWrqrfo83kw", "text": "The only reason why I go to Circle K's is for the Soda Fountain (Polar Pop) station, so that is the focus of my review. \n\nThis Circle K is the gold standard for it's Polar Pop station. There are lots of options to suite even the pickiest person (me). I made me happy to see they had several caffeine free choices, two kinds of ice, I think there were over 6 different ICEE choices, and 6 different flavor additions. Everything was full and in working order and clean. My selection of the day was crushed ice, Caffeine-free Cola, lemonade, a bit of raspberry ice-tea, with lime and vanilla syrup, and a B-12 boost. It was pretty good, but a little on the sweet side. I feel like a made soda scientist. Can't wait to go back to see what concoction I can come of with next.", "business_id": "3xMIe_qz6wKBrbThXdMiMA", "stars": 5, "date": "2013-04-27", "useful": 2, "type": "review", "cool": 2}, {"funny": 3, "user_id": "QJMOgjRYeogK43kyfX6PKw", "review_id": "TWaXbGxKAE9HQlYo1QsrKg", "text": "Smell that familiar whiff of smoke? You bet. That means a casino is right around the corner. On top of the engulfing odor, I wish this place had more lighting to it. There's actually quite a long hallway leading up to the casino from where we entered (from the indoor garage parking - so you can imagine how strong the smoke was) and the way the hotel's been designed belittles its meticulous details of art on the walls and anything that would make it stand out. In short, it felt a little dark. \n\nIf it were food, I'd call it bland. Nothing special. Nothing worth your time to be brutally honest, maybe except for that cute little dog that takes pictures for tips - Jojo. I was hanging out with my friend's family after attending a home based business seminar at the Convention Center about an hour back and while we hung around the wine cafe, this Rod Stewart look-alike dog was chilling in its little cushion that sat on wheels while its owner pushed him around. We called them both over and asked to have a picture taken. I was asked to place my elbow in a mini cushion next to the dog and Lo & Behold, the new profile picture. \n\nYou know a hotel doesn't really do much good when the only highlight from it was when you took a picture with a celebrity look-alike canine.", "business_id": "GoX_nYEEn8C9mDSX_a2l9g", "stars": 2, "date": "2012-06-02", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "qygModUyyK_Hi_b1uxSLFA", "review_id": "Estg8IaUDY_KUv-2w_kgJQ", "text": "Here it lies. The nail that beckoned the proverbial banhammer.\n\nThough it was more like a breakup than a banning, I guess. It was done discretely, over breakfast at Waffle House. After I had footed the bill, that is.\n\nYou broke my heart, Homme. I'm not sure if I'll ever be able to trust another club again.", "business_id": "Ha1Pa5ihg5fthh3RlUQm-Q", "stars": 3, "date": "2008-08-27", "useful": 6, "type": "review", "cool": 5}, {"funny": 7, "user_id": "EMbSCscjmEr7JebHjj-8vg", "review_id": "Ea072_5YWupoIwjvo7Tj8w", "text": "Just the Facts, Ma'am; A no nonsense list about Homme:\n\nPros: \n* It's usually clean. \n* Pool table.\n* Smoking patio.\n* Shiny stuff in the ceiling. \n* Cheap-ish drinks, depending when you go.\n* Not hard to get a bartender's attention (except on event nights)\n\nCons:\n* This place is tiny/cramped. \n* Homme lacks a cohesive identity and changes it's vibe as often as some girls change those Days of the Week panties. \n* Event nights are dangerously packed - We're talking hard core claustrophobia induced panic attacks.\n* Oh hi, can we have more bathrooms? \n* Slow nights are slowww. Like slowcat is slow. \n* Parking on event nights blows. You're better off with a taxi. \n* This spot is way too hetero to be a gay bar.\n* This less than glowing review may get me banned.* \n\n*I hear that's been happening, although that's NOT confirmed. Maybe we can consider this an experiment. Yelpers need to be free to yelp the truth.", "business_id": "Ha1Pa5ihg5fthh3RlUQm-Q", "stars": 3, "date": "2008-08-25", "useful": 6, "type": "review", "cool": 4}, {"funny": 4, "user_id": "VbhQF98kILGyc_-YHrysRw", "review_id": "okLtu4B0qINTcgscHB55UQ", "text": "Oddly, Stevey and I went to the same party and had very different views.\n\nHomme's drinks are cheap when they're on special. The bartender really pissed me off by charging me $1 for a vodka drink at 10:45 p.m. and charging me $4 for the same drink at 11:02 p.m. \n\nIt's not my fault you're slow, and I just tipped you $2 for the previous drink. Would it kill you to cut me some slack?\n\nFrench Kiss is a pretty weak party. It doesn't come close to Faux Show at Glam, its direct competitor.\n\nAlso, Stevey noted the diversity at Homme. I call it a lack of identity. The bar lacks a distinct character, and the crowd reflected it. It was too hetero to be gay, too mainstream to be edgy and too unattractive to be fashionable.\n\nI doubt I'll hit Homme again unless its for a goth/industrial night.", "business_id": "Ha1Pa5ihg5fthh3RlUQm-Q", "stars": 3, "date": "2008-01-22", "useful": 4, "type": "review", "cool": 4}, {"funny": 14, "user_id": "uqJ0kCrmZOEZzbt4qV3ODA", "review_id": "bS_xISNRdYs4zniIYy6VHA", "text": "This review is for Friday nights - an event called Party Foul. \n\nhttp://www.myspace.com/partyfoulaz\n\nAs the website says... \"bloghouse/ bmore/ remixes/ hip hop/ retro/ hyphy/ straight up fuckin bangers all night\"\n\nIf you like that loud new school dance-punk indie-electro techno-infused music that goes beep-beep and a hyperactive, slightly crazed party crowd, this night is for you.\n\nI invited a friend recently, who asked what the crowd was like... Here is the convo:\n\nFriend: \"what type of crowd?\"\n\nMe: \"Hipsters homos dance music scenesters trannies drug addicts drunk people and assorted perverts.\"\n\nMe: \"You'll love it.\"\n\nFriend: \"oh yes... my type of peeps.\"\n\nIf you found that amusing and intriguing as opposed to totally repulsive, go. You'll thank me later.", "business_id": "Ha1Pa5ihg5fthh3RlUQm-Q", "stars": 5, "date": "2008-09-30", "useful": 13, "type": "review", "cool": 13}, {"funny": 3, "user_id": "Z0GA65zCMI4ska4iHRr8Bg", "review_id": "L7LFWcLlPbLvkp_MGKBGeQ", "text": "I hate this bank, they always act like they know what there talking about, but they don't.  It dosn't matter if it's over the phone or in person.  And everyone gives you a different story!\nSo check this out.  We have several accounts.  I have one, hubby has one and we have a joint account. So I closed my account.  They want to start charging $10.00 per mo.  Sorry, I'm not going to pay that.  That's $120.00 per yr.  So I closed it.  Ok, so now I don't have access to this closed account anymore right?   So a few days later, I go to the joint account to pay a bill and to transfer money from the joint account to another bank.  So I didn't see anything pending in the other bank.  hummmm, so I call.  They can't tell me anything, I call the other bank, they say it's not on there in, and give it another day.   Now I'm getting pissed.  So I call Armed forces bank.  Ohhhh some how they took money out of the closed account,  huh?  How the heck did that happen, and I don't have access to that account.  Well bill pay, did it.  Ok, I need $ transferred to that bank, and you guys need to get that $ out of the account it was transferred to.   They said oh after a certain amount of time they system will catch it.  We will do a free transfer to your other account.  You should have it in a few hours.  Ok cool.  So anyway to make the story short.  I was on the phone with them all week.  No one knew anything, no one can see that I had double the $ that was transferred to that account.  I was so annoyed.  Finally, I got a phone call from the bill pay.  I told them I had been on the phone with AFB all week, and they couldn't tell me to call bill pay (your company)  Also come to find out from the bill pay guy.  That on the AFB if you have more than 1 account you have to go in and delete that account!  Ok, I don't freaking work for the bank.  Why couldn't they tell me when I closed that account that, that is something that I need to do, instead of causing all this confusion!  Ya'll need better training!  I'm done!", "business_id": "-nClpn9Z4uFk6h5f39yaDg", "stars": 1, "date": "2016-08-21", "useful": 3, "type": "review", "cool": 2}, {"funny": 4, "user_id": "EyLVCFOKltmlMg7XcRxU9Q", "review_id": "JKSO-23SAKtPnF09VgYK1A", "text": "I come to this Fresh & Easy when I just need a couple items and don't feel like dealing with the hassle of a busy Fry's or Safeway.  I don't think I have ever stood in any kind of line at this place, it is never very busy.  It is also good for a cheap workday lunch, and sometimes I'll take a gamble at the \"expiring today or close to it\" manager special section.  My cup of tortilla soup cost a dollar and has lasted me 2 meals!  \n\nWhat I do knock a star off for is the pretentious \"reserved\" parking.  Not for folks with handicaps, but for what I assume are for people with kids?? (The picture has 2 big people and 1 small person).  That isn't a handicap, sorry.  From what I hear these \"reserved\" spots vary by store location, I've seen another store with Hybrid Only parking.  If I get around to reviewing that store I will be sure to knock of 2 stars.  No need to make smug folks feel more entitled by letting them park 10 feet closer than me.\n\nBut, I overlook the parking space outrage and keep coming back.", "business_id": "EzjdzHIiBw98pbOUnB21Uw", "stars": 4, "date": "2010-07-29", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "maK3UBQczh33NuDjBYeHrA", "review_id": "xwkFpklQObFSe6n_dMmJPw", "text": "Fresh and Easy sells their own brand of produce,meats,condiments, desserts,dairy, and prepackaged food at an affordable price. They also sell a few brand name products that you would get at any other grocery store. Everytime I come here I load up a small basket and I never spend over $30. If I went to Fry's I would have spent $60 easily. The prices are great and they do not skimp on quality. I love that I can try new things without breaking the bank!", "business_id": "EzjdzHIiBw98pbOUnB21Uw", "stars": 4, "date": "2009-11-03", "useful": 3, "type": "review", "cool": 3}, {"funny": 4, "user_id": "4UlC9tI9DmsTgRb9XibrYA", "review_id": "hAeu9XHFld1hRgk2RGsk8w", "text": "-Convenient.\n\n-Quality produce and food.\n\n-Quick self-check out.\n\n-Friendly and helpful staff.\n\n-Excellent mark-downs (these go quickly).\n\n-Good prices.\n\n-Easy parking.", "business_id": "EzjdzHIiBw98pbOUnB21Uw", "stars": 5, "date": "2010-09-17", "useful": 6, "type": "review", "cool": 5}, {"funny": 7, "user_id": "M-RKuwyjIsgY-w9TGLKNSA", "review_id": "GoMyyQd4-vIx1BULX0TOsw", "text": "i wasnt going to do this, cause this is my favorite bar in the city and i felt i should keep some things to myself. but last week the bartender gave us a 'special' shot. it was so special that i wondered what part of the car it came out of as i ran to the one toilet there is with vom in my mouth. then i vommed in the toilet as the non locking door swung in the wind before a nice older woman came in, looked at me like i had vommed on her face, as she watched the rest of my vom show.\n\nso i guess what im saying is that to punish that shitty bartender for giving us insta-vom-a-shot,  i will now hopefully fill the place with any american who may be coming here for the festival as said bartender would hate me for it- especially when the entire bar sings \"sunshine on leith\" (the highlight of every closing weekend night)\n\nwhat im also saying is that despite my recent vomathon, it is still my favorite bar and it will be yours too. its the diviest bar in town, with the best weekend dj in the city.\nit is a must do- and bring every american with you.", "business_id": "B7NHWdkt4oFlbCuPl92Lqg", "stars": 5, "date": "2009-07-11", "useful": 3, "type": "review", "cool": 3}, {"funny": 11, "user_id": "ZeiM3Uspn6CUThUBt03JSw", "review_id": "zaanVUf2M8drCPOuJ-Nz4g", "text": "Doesn't get much better than this... Cough! \nClientele are a bit rowdy but the beer is good and cheap. \nWatch your back going to the toilets though... Its like trainspotting.", "business_id": "B7NHWdkt4oFlbCuPl92Lqg", "stars": 4, "date": "2009-01-08", "useful": 9, "type": "review", "cool": 10}, {"funny": 3, "user_id": "nXIX_l2EVoYsiTmwGuERng", "review_id": "kvUw6VeXBuXGRXfnbwWQrw", "text": "The absolute worst dining experience food wise. However gave it one start for the gut renching laughter we experienced, the server we had, and the manager for comping the bill. We had the French dip, the meat looked like leather. There was a twist tie in our burger, my chicken was grey, and the ribs looked fake. Everything at the table was returned and even the chef agreed that he should have never served it to us. I feel bad for the staff, because again they were very friendly and super nice- but in wouldn't consume anything from that kitchen if it were my last meal on earth.", "business_id": "EvDUi_H6-JG3QfGWiInAlw", "stars": 1, "date": "2014-04-10", "useful": 3, "type": "review", "cool": 3}, {"funny": 5, "user_id": "nUN2FOWj4G3ZmyCeDkq-FA", "review_id": "vxnNuk_NwlIuGIefk1MIEA", "text": "MY HOME GYM!!!!\n\nOfcourse I'm biased to everything that's up with this place.\n\n2 squat racks only though. The testosterone levels in the weight area increases during rush hours at 5PM and the battle begins towards the racks! HEY BRO, HOW MANY SETS LEFT?\n(Turns around) 100 MILLION 55, FACK YOU when my preworkout cease to exist, K?\n\nJOKING ASIDE, everyone is friendly as long as you don't hog any of the machines, you wipe em after every use, say please and thanks and spot whoever asks for your assistance and not the ones YOU THINK needs it! Life lesson for you today. I've seen many bruised egos expose muscle men to thinking they're not BIG ENOUGH because Larry from spinning class decides to spot you on your first rep, WHAT DAISY DUKE? THIS IS MY WARM UP!!\n\nGreat staff and positive vibes! 2 HR PARKING LIMIT  so word of advice : The walk is about 5 mins to and from parking so plan your strategy wisely or you pay $3.50 if you go over by even a second and the 'parking lot guys' can only take my eyelash batting ways about 5 times before they figured I was being cheap. So don't be me! \n\nHappy work outs world!", "business_id": "DsMtVCQxQHNyqUz9YN8OYg", "stars": 5, "date": "2015-09-04", "useful": 4, "type": "review", "cool": 3}, {"funny": 4, "user_id": "QuZbJquRtbY9O9JrB9NpxQ", "review_id": "MfSjgEg8IH21o7PPlgaRAg", "text": "::::::\n      ::::::\n            ::::::      \nWe looked at our entertainment book for pizza coupons and came across Domino's in some cruel twist of fate.  Since we hadn't had Domino's in easily 10 years and it was a pretty good coupon we decided in what later seemed a momentary lapse in judgement that we would use the coupon and give them a shot.\n\nIt will likely be at least 10 years before we try them again.\n\nPizza that was on a par with those frozen ones from the grocery store and a free sandwich we shared that left us with tummy aches.\n\nDespite the coupon savings it's no deal for poor quality food.", "business_id": "7f2lYQac9MOZDSaQbMs-Vw", "stars": 1, "date": "2009-12-13", "useful": 8, "type": "review", "cool": 4}, {"funny": 4, "user_id": "_SEBcjCwgneOV1VV_vESfQ", "review_id": "adi0V2aqsYfF6gnmwv5-fQ", "text": "Michael's Bar was the first bar I went to when moving to the Cleveland Area and looking for housing on the West Side.  Turns out that it's not the closest bar to my house....yikes.  \n\nFood is pretty good here.  I enjoy his wings, $5 mussels (simple keep in mind), the pasta dishes are great, sandwiches are good, but understand that this is a bar / restaurant not heavily advertised nor does Mike truly care how outdated his menu is, his lack of a happy hour, so-so music on the juke, and his late 70's decor.  He will be the first to tell you 'Eh, it is what it is' in his Italian accent.  \n\nI like the place for a few reasons.  Mike is always there and he is always happy to see new faces.  They have photo hunt and I can ALWAYS get a seat.  Mike's GF Joyce is also usually bartending with a quick witted comment to all the regulars that grace their presence on a daily basis.  But most of all, they know me, like me, and it's comfortable in there.\n\nAs stated before, there is a juke and there is some good music on there, just have to look.  Lots of Sinatra because even if he doesn't admit it, Mike is a huge fan.  There is a pool table in the back too.  I think he has a dart board but its not put up, just need to bug him about that.  He occasionally makes some of his famous popcorn which is from a real movie theater style popper.  He has nice size tv's in each corner and will always have the game on.  I personally made him a hockey fan during the playoffs.\n\nIf you are tempted, stop in, go for some wings and try a pasta dinner or one of his sandwiches.  I personally like the turkey, mushroom, cheddar or swiss melt.  Sit and play some music or try and beat the top score of photo hunt, the names should contain jeff/alison/thomas or something like that, although he may have reset the game.  If that's the case, we'll see you at the top sooner rather then later.", "business_id": "DWeW4PKZQkXhgKdLtRsmFg", "stars": 3, "date": "2010-10-19", "useful": 4, "type": "review", "cool": 2}, {"funny": 14, "user_id": "BmGKtjhYkFvMR13-RubrOQ", "review_id": "1NoKU0iSFQpkirQIbXZD_A", "text": "Have you ever walked into a store and had to pinch yourself to see if you were dreaming? I had a variety of life-threatening emotions overcome me upon entry to this store. \n\nMy blood pressure rose, my pulse quickened, I caught a fever instantly and I nearly collapsed from hyperventilation. In the words of Julian: Not good. This store is AMAZING. \n\nHigh-end designer gowns with New Year's just around the corner? Must try on fast! Vintage leather, bake lite and tortoise shell hand bags? Ladies, I will cut you if you try to beat me to the register to buy them all. \n\nLeather, and embroidered coats? Good Lord, I might pass out. Then the I see the price tags. \n\n$11. for a patten leather bag from the 1060's?!!! Where am I? Heaven? Am I a goner? I don't remember dying but surely this store is too good to be true. \n\nWith the aid of two employees, we heaved piles of dresses into the fitting room. Like a wolf protecting her young, I hovered over my enormous pile of goodies. \n\nThe darling girls made sure that I had a stool in my fitting room so that I could try on my many pairs of platforms. They even let me take my gloves, hats and purses into the fitting room to be sure that no other women would be stealing my rightful claims. \n\nI took out a handkerchief from my pocketbook and dotted my brow. I hope that Secret really is \"strong enough for a man\"! Even the memory if this store is causing my pulse to skyrocket.\n\nI spent about two hours in this store. Every time that I thought I was finished, I spotted another gem, brooch or scarf. I bought a camel-colored butter-soft leather trench coat covered in white embroidered butterflies. Price tag? $42.00!!! *small heart attack* \n\nAn unreal tortoise shell handbag with a wooden handle from the 60's Price tag? ONLY $11.!!!!!!!!!!!!!!! WTF?! And a couple bags filled with cute stuff. But wait. Two HUGE bags filled with party dresses and beautiful vintage finds? Less than $200. total. One of the luckiest shopping days of my life. \n\nIf you don't love it? Leave it for me. I'll be back my every future trip to Vegas. If you come the same day that I do? Watch your back. It will be on!", "business_id": "BmB8HXVG3n8oJ3c4pv8hCA", "stars": 4, "date": "2010-12-19", "useful": 16, "type": "review", "cool": 13}, {"funny": 3, "user_id": "iqQBsjqOF9xgIAbsZ2sAZA", "review_id": "zUZSkHRgrIuYk-Jeu_wLuQ", "text": "Let me preface the review by declaring my love for the Fleury West neighborhood in Ahuntsic.\n\nThe streets are peaceful,  lots of trees and beautiful homes. Pretty close to central streets too.\n\nThere is a Parc nearby to enjoy a latte or just to take in area.\n\nThe prices are pretty reasonable but I have to try some of their other offerings.\n\nMost surprised to find the apple muffin was still good 3 days later after I forgot it in the car.", "business_id": "4WBj2ob4tEle1-4AZdB5pQ", "stars": 4, "date": "2014-10-22", "useful": 3, "type": "review", "cool": 4}, {"funny": 3, "user_id": "CxDOIDnH8gp9KXzpBHJYXw", "review_id": "1n3MOJ8Csp7ohrulDuD0pg", "text": "Yuzu Izakaya opens till 3 am.. Seriously? \n\nGreat for late night snack and drinks!! \n\nThis place so new I can even smell the fresh paint... \n\nSkewers $3 for 2 not a bad deal..... We tried the Pork Neck and Beef. Pork neck is well flavored, great bite and really porky. Love the hot peppers! \n\nWara-Yaki Beef Tongue ($10) was meh for me unless you love the charcoalness.. The texture was way too mushy for my liking. I feel like I just smoked a cigar after eating that!\n\nBeer selection is so so Coors Light? Meh", "business_id": "996axDvF9P8zxB9MJA52Xg", "stars": 3, "date": "2013-04-17", "useful": 3, "type": "review", "cool": 2}, {"funny": 3, "user_id": "mdmFPUq98OtP8BQ4fCs8wA", "review_id": "5auZcoSKq0nNES8azCKoQw", "text": "What's a Stromboli? It's like a Calzone. The only difference is that, um, well, I really don't know. The only thing that mattered is that when I tasted it, it was delicious! Frickaccio's is located at the southern wall of the West Side Market. They also sell pizza bagels, pizza and all sorts of Italian savory pastries.", "business_id": "F2MJ61d9jDOiY9-Naa8I7Q", "stars": 4, "date": "2014-12-04", "useful": 4, "type": "review", "cool": 2}, {"funny": 3, "user_id": "74vQRzh-duzm7zQuvhRVuQ", "review_id": "m6hinGYUEV8XvxEE94GUvQ", "text": "This review is only about the service I received at the store, not about the products.  As a previous lover of Kiehl's products, I am on the mailing list.  Occasionally Kiehl's sends out e-mails enticing you to come in with the offer of a free lip balm.  On this occasion Kiehl's had sent a reminder the day before to go pick up the lip balm. Now, I like lip balm, of course I do, I'm a girl and I love free and I love Kiehl's, so off I went.   I wasn't just going to show up and ask for my lip balm and not buy anything.  I grabbed a bottle of my favorite moistuizer and walked up to the cash to pay and redeem.  My presentation of my coupon was met with disgust by the salesperson.  She indicated they were all sold out.  Hmmm, there was a large container of lip balm in my line of sight.  Perhaps, they were out of the ones they felt like giving out.  I indicated that I had been reminded the day before to come in.  She responded, oh well that may have happened.  Uh thanks. She did reward my business with a free sample of some other moisturizer.  Great. : p", "business_id": "2LwD2kptBJxGrIO7zm9EMQ", "stars": 1, "date": "2010-01-10", "useful": 6, "type": "review", "cool": 2}, {"funny": 8, "user_id": "JnPIjvC0cmooNDfsa9BmXg", "review_id": "HfUbTuR1m9YxN2OxLHbUpw", "text": "Fact: Kiehl's is a gateway drug. If I were you, I'd be wary of even walking through that front door, because once you claim one of their products as your own, you'll never settle for anything else. And with only one Kiehl's (as far as I know) in all of Toronto, it's a dangerous addiction to have. \n\nSome evidence...\n\nThe \"Supremely Gentle Eye Makeup Remover\" is the only makeup remover that will ever touch my eyes. It's a lotion-based makeup remover, unless some of the grotesque oil-based removers out there that leave your face greasy and necessitate tugging. It's smooth, easy on your delicate eye area and doesn't smell weird. I wear dramatic eye makeup most days and this gets all of it off in a snap.\n\nMore evidence...\n\nThe \"Creme de Corps Soy Milk & Honey Body Polish\" is the only scrub I'll ever use. Once you use this scrub, any other exfoliating scrub will seem too gritty, dry or wimpy for your calluses. This is the real deal - it gives you an unbeatable scrubdown and it smells like honey. Oh, and it has jojoba oil in it, which is essential what the sub-species of Humans  With The Softest Skin On Earth™ swear by. I've tried other scrubs from Aveda, Philosophy, etc. and I always come back to this one because it just gets the job done, pure and simple.\n\nOK fine - a third piece of evidence...\n\nAre you using eye cream yet? And if not, why not? You know you should be, if only to start preventing those pesky signs of aging. The \"Creamy Eye Treatment with Avocado\" has a really unique texture and a small container of it, while a little pricey, will last you forever because it goes on really thick. The only thing that could make it better would be SPF 30. \n\nWhen you visit, make sure Zach's working. You'll be able to spot him because he'll be jamming to Lady Gaga, Britney Spears or Kylie, and he'll rush up to you and say \"Oh my god - have you TRIED the new [fancy, convoluted product name that of course you didn't know about but are like, so ready to try like this very instant] yet??\" You'd think Zach was a descendant of the original founders of Kiehl's back in the 19th century; he just knows everything about Kiehl's and its products to a terrifying degree. \n\nThe store sometimes has special makeover nights and product launches, so get on their mailing list so that you'll get invited to them. Another win about Kiehl's is that they're very generous with their product samples, and some of them are good enough to last you months of sampling. It's nice to be able to try stuff before you buy, especially since they have a pretty massive arsenal of products to offer.", "business_id": "2LwD2kptBJxGrIO7zm9EMQ", "stars": 5, "date": "2009-07-06", "useful": 11, "type": "review", "cool": 7}, {"funny": 7, "user_id": "zo2vscKNvDzXWj7YOrdJVA", "review_id": "zYWzxZJ-ohjdk60-NijeIQ", "text": "I can see what all the fuss is about!\n\nGreat spot for brunch.  Service is amazing, cute and cozy interior, and a great location.  I love restaurants on a corner - all that extra light!\n\nI had their infamous pancake.  I was expecting a standard pancake.  Oh, was I trumped and pleased by the flapjack of goodness that arrived before me.  This puppy was dense, moist, flavourful and very filling.  With the maple still glistening and the lavender on top making sweet love to my nose, I dove in.  Bless you Mitzi's for opening my mind up to a more oatmealy textured pancake.  It was fantastic!\n\nAs a person with a huge sweet tooth, I also absolutely loved their maple latte.  No Aunt Jemima knock off syrup in this stuff!  I think I should check for a maple tree out back!  It was too sweet for my buddy Chad B, but it was perfect pour moi.  \n\nI will be back to try all the menu.  I may even stop by and have just the latte....it was that good!", "business_id": "PFPUMF38-lraKzLcTiz5gQ", "stars": 4, "date": "2010-11-27", "useful": 9, "type": "review", "cool": 8}, {"funny": 3, "user_id": "_MfYDCxHmMIQtrIIUBPW5Q", "review_id": "oECJLps1iYraP6NkidOXOg", "text": "We were on our way to the famous Mitzi's location on Sorauren Ave., dreading the line-up, but craving a delicious brunch, when we drove by a sign just past Ossington that read: Mitzi's On College.  I don't think I have ever pulled over so quickly.  \n\nWe had heard rumours of this additional location, but we weren't sure when it was opening.  It turned out that it was only their second day in operation.  The interior was not as homey as the original Mitzi's, with their collection of vintage kitchen tables, but the same prints by a local artist hung on the walls.  The entire layout was more hip, more minimalist, more \"College St.\", with a definite touched-by-an-interior designer feel.\n\nThe menu was brought to us printed out on white paper.  We were used to peering up at the blackboard at Mitzi's for the day's menu, as it changes all the time.  I'm not yet sure if this new Mitzi's will follow the same system, but I can't imagine they wouldn't.  Half the fun is anticipating what amazing combinations and flavours will be available for brunch next weekend.\n\nI ordered the oatmeal buttermilk pancake, with fresh cream, blueberries, pernod custard, and the usual spiced potatoes and garnish fruit.  I would never order pancakes normally, but I decided to be adventurous.  I don't generally enjoy pancakes, and I find them heavy and bland, but the aforementioned description of the dish sounded too good to pass up.  I am so glad I didn't.\n\nI have never enjoyed a meal at Mitzi's more than I did that day.  I always ordered French Toast, or Poached Eggs, or something with lentils and Indian spices, and while they were rave-worthy dishes in the past, they were now put to shame by the oatmeal pancake.  It was so moist, light, and delicious, it barely needed the cream or custard.  That being said, the Pernod custard complimented the fresh blueberries so unbelievably well.  Every bite was perfect!\n\nThe wait-staff was incredibly polite and friendly, and we still received our coffee in eclectic mismatched mugs.  I loved all the flower boxes surrounding the patio. I know it won't be long 'til we're waiting in line-ups at this location as well.  It's just fantastic having a Mitzi's so much closer to home.", "business_id": "PFPUMF38-lraKzLcTiz5gQ", "stars": 5, "date": "2009-07-13", "useful": 10, "type": "review", "cool": 7}, {"funny": 5, "user_id": "QJI9OSEn6ujRCtrX06vs1w", "review_id": "4F7aW37liSKTGgJkdt92ew", "text": "It's been at least 5 or 6 years since the last time I visited this joint.  I worked at the Eldorado Casino back in the mid 90's and this place use to have decent food......that was back when it was named \"Cactus Joe's\".  It's really gone downhill since those days.\n\nI happened to be in the area and stopped by for lunch with my Mom.  I ordered the Nachos w/o Meat and Mom ordered the Fish & Chips special.\n\nAfter a short wait we were served our food.  I was disappointed to see that the Nachos were Chips, Cheese Whiz, Tomatoes, Onions on a plate with a small bowl of Beans, cup of Guacamole, cup of Salsa, and two packages of Sour Cream on the side......what the ___?  Was I suppose to create this thing myself?  Where did it say that on the menu?  I know why they did it.....to save money.  There's less food waste when you do stuff like that, but seriously?\n\nAs a fan of Nachos it was a huge letdown.....plus they didn't taste good at all.  The Chips weren't fresh and the flavors were just strange.....unappealing.\n\nMom enjoyed her Fish & Chips, which were really Fish & Fries.  She liked her Fish and I tried a few Fries...they weren't bad.  Maybe I ordered the wrong item?\n\nOverall, the service was good and since Mom enjoyed her dish I'm giving this place 2 Stars instead of 1.\n\nWill I return?  Someday I probably will for the sake of nostalgia....but I predict it won't happen any time soon.", "business_id": "AVhYkxAqQSFqYMSa01hPbQ", "stars": 2, "date": "2010-11-29", "useful": 7, "type": "review", "cool": 4}, {"funny": 4, "user_id": "yZpzRSK00hFeLNnwOf8R1g", "review_id": "bm8qpaQuW-MHCBbkqpHlog", "text": "Awesome playground! This park is so nice to walk around...\n\nThis is where I typically do my jogging and it has amazing trails for light jogs and long walks! Everything is nicely maintained and kept up by the city! All of the lights work, the playground equipment is clean and the walkways are clear. \n\nThe location is easily accessible from multiple places. \n\nIf you have a family and you want to go to a very nice park...this is your place! \nIf you are looking for a place to exercise with awesome scenery...then this is your place! \n\nEnjoy", "business_id": "RORj058dhJGPOvoOMDU8rg", "stars": 5, "date": "2015-02-26", "useful": 5, "type": "review", "cool": 4}, {"funny": 3, "user_id": "cJh4F1zFNJb2wXCNT1uNWQ", "review_id": "PvOqobbRaUyjzCtaY9Ixlw", "text": "Angel Park! I love it here!! We live walking distance so on cool nights we come and play here!\n\nWhat I really like about this park is that its upkeep is very good! I never ever see it dirty or ?tagged? up like other playgrounds. Its spacious and has that bouncy corkboard type floor which is great on the feet and also if a child falls, no boo boos! Lol.\n\nThe playground is compatible for both small children and toddlers on up! It has a great jungle gym for the bigger children and a pretty stellar one for the younger ones as well. Typically you sre one slide for the 5 and under but this one has 2! A straight one and twisty one! \n\nIt also offers a climbing wall-esque thing and some baby type swings. It also has surf boards you have to try to balance on and these cool twisty seats!\n\nHere they have many seating areas for the parents as well as water fountains, and even a water fountain for the doggies!\n\nThe only downside is there is no bathroom, but thats pretty much it! \n\nCome here to have a nice non crowded place to bring the chitlins!", "business_id": "RORj058dhJGPOvoOMDU8rg", "stars": 5, "date": "2012-04-25", "useful": 6, "type": "review", "cool": 4}, {"funny": 4, "user_id": "pJYRi9MB06aiuL-w8Ms-Og", "review_id": "6a58qUMYDQbynq1O1zU5Jw", "text": "If you're looking for a relatively healthy fast food option, there aren't too many choices in the neighbourhood, or anywhere in general.  I do come here for the slightly over priced \"bangkok\" burrito (Brown Rice, Roasted Chicken, Carrots, Cucumber, Mushrooms, Bean Sprouts and peanut sauce) for $7, which is tasty for the most part, but nothing to write home about.\n\nI don't get coming here for a salad when there are several markets in the vicinity.  But this place is busy during lunch hours and there is usually line up of girls coming out of their yoga classes.  \n\nThe frozen yogurt is ok, but there's homade icecream just around the corner at xococava!  Yeah yeah.. it's not frozen yogurt but it's a billion times yummier.\n\nIf this was a singles pick up joint, I may give it a higher rating as it easily has a ratio of 3 to 1 women to men, but it's not so it gets a Meh.", "business_id": "AnE8XM7U07BI09lJH1WLbw", "stars": 2, "date": "2010-06-18", "useful": 2, "type": "review", "cool": 2}, {"funny": 20, "user_id": "0kSXMbNFo7mdwTPj4iQv9A", "review_id": "jBChKge_qcGufUz7UpddRg", "text": "I love the Swingers Club in Las Vegas. Due to the name, you'd think there was some kinky stuff going on here. But do not come here expecting your wife to get her Latin fetish out of her system, while you experience your first interracial experience since that black sock in high school.\n\nThe Swingers Club is just pure silly fun in the heart of Old Las Vegas. Come here with some friends, grab a table, order a round, and see where the night takes you. It was great way to spend the final night of my 11 day work trip to Las Vegas.\n\nThe Swingers Club has a pretty cool layout. It has a long central bar, large open dance floor, and an elevated stage. The staff is awesome. They are hardworking,  friendly, and keep your \"spirits\" up, in more ways than one. Due to the golf and sex theme, the men wear kilts and the girls wear school girl outfits. Please free to read that line again.\n\nFor entertainment throughout the week, they have flip cup tournaments, comedians, dueling pianos, and indoor mini golf. But I went on a Thursday, so it was karaoke night. And well, karaoke is the best way to get the party started. Well, besides cocaine. Duh.\n\nI rocked the stage pretty damn hard. Eventually, some locals models wanted to hang out with us. And since we weren't creepy (mostly older married men and a young nerd in myself), they were willing to buy us a round or two. Not sure. I lost count. I should paid more attention to Sesame Street.\n\nAnyway, the rest of the review I have to omit. I do not want to be part of any divorce proceedings. I guess some of my coworkers took the name of the joint literally. \n\nWhat happens in Vegas, stays in Vegas. Unless I want to use the videos on my iPhone for job security.", "business_id": "7Zn-bvB2Tu15HTFbCP32LA", "stars": 4, "date": "2012-05-22", "useful": 16, "type": "review", "cool": 14}, {"funny": 3, "user_id": "E19IMURE4WEoCnvDx-bylg", "review_id": "DUbuuaBuhG06VCl3Bc8tCw", "text": "It doesn't exactly tip the scales to balance out Fremont Street.'s Westside against Fremont East's DCR, Insert Coin, Vanguard, Beat, Don't Tell Mama etc. But they certainly put up a good effort to do so. How many piano bars do you know have a 9 hole miniature golf set up? Exactly.\n\nIt was pretty empty when me and the homie visited but we could see it as an alternative hang out spot and easily envision Fridays and Saturdays being crazy busy. Cool waitresses in their Brittany Spears schoolgirl uniforms, 5 cent beer @ happy hour, beer pong tables, DJs (certain nights), being able to scrawl on their walls helped bump Swinger's Club fun-factor up a star. While Fremont East is the trendy, hipster hangout, Swinger's serves as the perfect place for, the *ahem* \"wholesome\", working class, or mid-western visitors seeking an older or different vibe.\n\nHowever, I definitely don't wanna be there though when the wise-azz, belligerent, drunktard decides to take a heavy swing on the putting green only to have his ball ricochet off a wall and pop someone upside the head. Aside from that and the funky, \"haunted Dead Zone\" 9 hole and I believe the quirky 7 hole (you'll see what I mean when you visit) I wouldn't mind comin' back to work on my stroke at this swinger club.", "business_id": "7Zn-bvB2Tu15HTFbCP32LA", "stars": 4, "date": "2011-10-08", "useful": 2, "type": "review", "cool": 3}, {"funny": 3, "user_id": "rdysF0ymVkMX82Bu_8x3nA", "review_id": "j7LCMrzzKCZxob6saMdt5A", "text": "Honestly, the bartender was kinda rude and the drinks weren't what we ordered. We moved to a table where a server brought us drinks, then held her hand out for a tip. I slapped her hand, finished the drink and left.\n\nNeat place, poor service :(", "business_id": "7Zn-bvB2Tu15HTFbCP32LA", "stars": 2, "date": "2012-01-14", "useful": 2, "type": "review", "cool": 0}, {"funny": 4, "user_id": "reQnzHXtLdhvVYOIRjCDTw", "review_id": "DXlJWHOd64vkkS8sQgaaBA", "text": "There is no option for no stars ? I went there in an emergncy when my own eyebrow person was not available. I specifically told the lady, I guess Jana.. to remove the extras only and explained her that i have a very strong arch which needs to be taken care of while waxing. \n\nShe was like \"ohh honey, i understand\" and next thing I know she totally ruined my left eyebrow, it was totally flat. I told her ohh god you waxed on my Arch.. she was totally horrifed but still kept on saying ohh honey you still have the arch.. i'm sorry i will take care of it in the right one. \"Yeah like that will fix everything\"..\n\nAnyways i was upset, i asked how much, she said \"although i take $20, but i think you are upset so i will take $15\" I gave her a $20 bill and she had the nerve to ask me \"do you want the change\", Really you think i will be giving you a TIP on such a bad job.. I said \"Yes i want my change\" I stormed out the place.\n\nFor the next 2 weeks i was sketching on that missing hair area with a pencil..\n\nWill never go back there again.", "business_id": "FFxpiWz05dEiqh8-5v5shw", "stars": 1, "date": "2011-04-12", "useful": 1, "type": "review", "cool": 0}, {"funny": 6, "user_id": "SrF972IxsELYQ3eaWB5X4A", "review_id": "SPRixFLxyceLUnhAzAYiZA", "text": "The Beautiful Carin and I needed some new TV's for the new place at the beach.\n\nWhat...did you think we were just going to sit there and watch the ocean?\n\nNo, we need our TiVo, our college football, our Hawaii 5-0 and our MadMen, just like everyone else.\n\nAnd we need them wirelessly in every room, with incredible sound and in 3D/HDTV!\n\nSo it was time to re-up on the television front.\n\nIt turns out that it's actually cheaper to buy the TV's and all the attendant crap here in Arizona (and have our mover take them along), than it is to buy them and have them delivered in California!\n\nI know, it seems crazy to me too, but when you are buying four of these bad boys at one time...well, the discount did not hurt my feelings, one iota!\n\nWe dropped by this location after breakfast on Sunday...\"just to look over our options\"...but I'd already done my research, done a little online looking, dropped by Best Buy, Fry's and Costco and I knew what I wanted and about how much it was going to cost me.\n\nImagine my surprise, when Chris, the nice sales guy ran the numbers for us and the total turned out to be about $1,000 less than I thought it was going to cost me!\n\nDelivery was right on time, everything showed up intact and as soon as the installers finish and we finish our move, I won't need to look outside for anything...ever again!\n\nThe whole world will be available in 3D-HiDef...all 13 movies of currently available 3D content.\n\nIn a final \"nice touch\", I had no sooner gotten off my plane today than my pocket rang (and vibrated...I do so enjoy my very smart phone)...it was Chris calling to make sure that the delivery was smooth, and that I got everything I had purchased...going the extra mile!\n\nUE made it easier to part with my money...easier, not \"easy\".", "business_id": "DiZ2rabncBaCrNG3OB-CBA", "stars": 5, "date": "2010-10-20", "useful": 7, "type": "review", "cool": 7}, {"funny": 5, "user_id": "rCWrxuRC8_pfagpchtHp6A", "review_id": "vMC2Cul9uwPjZUiEZ1QnOQ", "text": "With over 700,000 members strong, the almost 7 decades-old United Steelworkers is the mightiest industrial labor union in North America, and its master headquarters has a Pittsburgh address.\n\nUnions were assailed then and are being assailed now by regressive, laissez-fare capitalist forces that bow to the unholy, unstable power of markets and stomp on the dignity of working people. USW is biggest David we have in the battle against the Goliath of Greed that is Corporate America. \n\nThe USW was founded in the blood of those who toil, those whose fingernails have soot under them, those 146 garment workers who died in the Triangle Shirtwaist Factory Fire of 1911, those whose muscles ache at the end of their day, those who make society function, those who produce, those who forge, smelt, lift, climb, rescue, and nurse the injured and sick back to health. \n\nUnions are imperfect, but without them there would be no rights for those who work, and the few in power who scheme, gamble, downsize, and profit would be unstoppable in their economic campaign of terror. Realize where your interests lie. Realize that the USW's issues of universal health care, unfair trade practices, outsourcing, job security, living wages, protecting/bolstering Social Security, a clean environment, and the simple right to organize are your issues too. \n\nI'll leave you with a few quotes from current USW president Leo Gerard.\n\n\"All we want to do is sit down and negotiate. Negotiation is the cornerstone of democracy as well. And I've threatened and challenged to debate people. Show me a country on earth that is a democratic country that doesn't have a free, strong, independent labor movement. If you crush the labor movement in America, you crush democracy.\"\n\n\n\"53,000 factories have closed since the Bush years, since the collapse we have 27 million unemployed and underemployed. Let's be clear -- this mess was not caused by workers, but by corporate thugs on Wall Street.\"\n\n\"How many companies have to go under before Washington gets the message? How many American workers and communities will have to be devastated by the predatory practices of foreign governments before Washington realizes that the country's economic and national security is being totally undermined for the sake of protecting trade policies that have patently failed.\"\n\n\"Anything Goes capitalism is something that must go.\"\n\n\"GOP governors from Ohio to Indiana to Wisconsin have claimed last November's elections gave them a mandate to decimate worker rights. But numerous polls, from those sponsored by the New York Times to USA Today/Gallup, have shown that these Republicans are wrong, that the public is not with them. Consistently, 60 percent in the polls say they oppose legislation terminating worker rights.\"\n\nThey don't want corporations and they don't want governments to return to the days of the Triangle Shirtwaist Factory, when young women, without a union and without an effective collective voice, labored in a fire trap that eventually killed them. They don't want government to give itself or corporations the unfettered ability to exploit workers again.\"\n\n\"No matter how better educated American workers get. No matter how much more innovative. No matter how much more productive. No matter how many tax dollars the government spends on research and development, if the corporations that benefit move manufacturing overseas, the American workers who paid for it will suffer.\"\n\n\"An ordinary American dreams of a family-supporting job, owning a home, saving enough to pay for a child's college education, helping to build a safe community. Corporations aren't Americans, no matter how often the U.S. Supreme Court grants them rights that the U.S. Constitution guarantees to human beings. Businesses aren't citizens. Their allegiance isn't to America. It's to profits. They dream only of dollars. They concede no responsibility to family, community or country.\"\n\n\"Without the slightest regret or hesitation, the rich are killing the great American middle, rendering it a casualty of their shirked social responsibilities. Their campaign has been abetted by Republicans since Ronald Reagan. The Gipper contended slashing taxes for the wealthy would increase revenues for the government. Republican George H. W. Bush rightly ridiculed Reaganomics as voodoo.\"\n\nRun, Leo, run, for POTUS that is.", "business_id": "-Q9-WQWcfDVTooqxzPiuBA", "stars": 5, "date": "2011-03-14", "useful": 13, "type": "review", "cool": 14}, {"funny": 3, "user_id": "HFECrzYDpgbS5EmTBtj2zQ", "review_id": "qto7YRda7xrZf5kpGaHt2A", "text": "For much of  my 30+ year career as a Health and Safety professional, I have worked in a petrochemical facility whose hourly workers were represented by a Union. And whether they are part of USW or previously PACE, they are always the Oil, Chemical, and Atomic Workers (OCAW) to me.\n\nAs a member of \"Management\" and considering the type of work I do, my relationship with my Union colleagues can be complicated, sometimes spirited, and often satisfying. As a result, I firmly believe that without the Union, my Plants would be a much more dangerous place to work. I also know that some things like my health insurance, safe working conditions, and other benefits that I sometimes take for granted were first won at the bargaining table. This is \"Trickle Down\" economics of the best kind.", "business_id": "-Q9-WQWcfDVTooqxzPiuBA", "stars": 4, "date": "2011-03-17", "useful": 12, "type": "review", "cool": 12}, {"funny": 10, "user_id": "lxt4LomsbAjBvk5POhDTEw", "review_id": "zQrsdDKuN7-byjyvkfbNpw", "text": "Unions--such hot topics, always.\n\nI'm generally a supporter of unions.  From a historical perspective I certainly view United Steelworkers in a positive light; however, I have issues with this union in the present.  \n\nI very rarely call out other Yelpers in my own reviews, but...\nTo elude that the life/job of a steelworker is one of ease due to the presence of a union is hilarious.\nTo say that steelworkers \"can hardly be fired for anything short of heresy against the company\" and then that \"the shop steward can get them their job back\" is preposterous.\n \nThe job ain't glamorous, and I'm willing to bet that my father's case is the current rule, not the exception.    \n \nMy father is a steelworker.  Has been since he was 20 years old.  He worked for J&L for X years, Republic for X years, and LTV for X years.  Want to guess what sort of pension he received after each of those mills declared bankruptcy and/or merged and laid him off?  None.\n\nMy father works hard labor in miserably cold (wintertime) and miserably hot (summertime) temperatures and has developed carpal tunnel, yet he can't get time off work to have his hands surgically corrected.  I've lived in California over 4 years, yet my dad still hasn't been able to get time off work to visit me.  \n\nUnited Steelworkers has served both of my retired steelworker grandfathers well, but where has the union been for my father?  Times have changed.\n\nI wonder if I'll be Yelping years from now when my dad is finally able to retire and, if so, if I'll have a reason to bump this review up to 4 or 5 stars.", "business_id": "-Q9-WQWcfDVTooqxzPiuBA", "stars": 3, "date": "2011-03-17", "useful": 19, "type": "review", "cool": 17}, {"funny": 5, "user_id": "nf7dY3evihisaWf1xgKKwQ", "review_id": "NHBsm4wg2I1wlkZmcoZqwg", "text": "I was captivated when I saw a Groupon for a Walking Farms Pony Gram. Actually, you had a choice between the Pony Gram and Donkey Gram (the latter being perhaps the most genius way to break up with a person...kind of like a text message on crack.)\n\nThe premise is exactly as it sounds: A pony (or donkey) is delivered (with a handler) at your choice of location. They come decorated as appropriate, and deliver a message.\n\nThis is ideal for any child because who would not be thrilled to see a beautifully decorated PONY show up at their doorstep? And yes, a pony ride is included. \n\nBut, if you think outside the box, this is also ideal for anyone who is hard to shop for, because like I said, who would not be thrilled to see a pony at their door, with streamers carefully braided in their mane and adorned with a birthday hat?  I immediately knew that this was the perfect gift for my mother's 60th birthday. She is incredibly hard to shop for but enjoys public displays of craziness that would embarrass anyone else, including myself.  However, I sucked it up for her big day and had the pony delivered to her favorite restaurant as we sat outside on the patio.\n\nThe surprise was slightly foiled when she saw the huge horse carrier drive past in the parking lot...but that was no fault of the farm, I should have had my mother facing the opposite way!\n\nShe loved the spectacle and I loved the super friendly and gorgeous horse. The handler was equally friendly, very punctual, and let multiple people ride the pony.  I would recommend this to anyone who is looking for a unique and rememberable birthday gift -- or an odd yet thoughtful way to end a coupling.", "business_id": "8eR20ZCeCKuPE8Z-pWItjA", "stars": 5, "date": "2016-01-25", "useful": 5, "type": "review", "cool": 5}, {"funny": 3, "user_id": "dmRueUwj0JMTlNZfTj3ZWA", "review_id": "OY0BlC9RgJyDFk_E809nSA", "text": "We had a good stay here! Since we don't spend a ton of time in a hotel room in general, we were happy with our latest choice. Typically, we stay at the nearby Courtyard, but because it was all booked up, we decided to try this Hilton Garden Inn instead. I'd say that it is pretty on par with the other HGI that we've stayed at throughout North America.\n\nFor $95 CAD with AAA discount for a Saturday holiday weekend, the price was great. Some other locations were looking at over $120 CAD/night. Access to the hotel is easy right off of Highway 7 and Commerce Valley Drive. There is a lot of construction going on right now, so be prepared to get stuck between the exit off of Highway 404 and Leslie St. if you're arriving around late afternoon-dinner time. As an alternative, you can head west and turn right down Warden and take the back street to bypass it.\n\nThe parking is plentiful and free, and so is the wifi. You can also have wired access if you prefer to be sitting at a desk. Our room was the basic King Room, and it was very large and spacious (around 375 sq. ft. maybe more). The decor is a bit dated with an ornate headboard in a maple wood, and similar nightstands and armoire. The 32\" flat-screen TV was decent, and nice that it didn't have a delayed response. The window coverings were a floral forest green/ivory color combination; again reflecting an older style.\n\nHowever, the bed was surprisingly comfortable. We had stayed at another HGI in New Jersey, and don't recall the bed being this comfortable. It was slightly firm but mostly soft, but most importantly, when one person moved, the other didn't feel it. Yay for no wiggle! :) You sure won't have any slumber issues because of that! The added convenience of a mini fridge, microwave, coffee maker was nice and they were all clean. Washroom was a good size for 2 people, but the door when opened blocked the entryway and there's no fan. Water pressure was great, though the water was evidently hard, thus making for dry skin.\n\nHousekeeping was a little scatterbrained as we had to tell 3-4 ladies that we did not need housekeeping as we were checking out. Each time we told a different lady, they would go back to each other and start bickering. However, each were sweet in personality. The front desk crew could use a little bit more pep in their step but they were pleasant. Breakfast is not included, and is a la carte starting at $8, and buffet is $16 CAD. With all the nearby eating choices, you're better off eating out.\n\nOverall, we had a pleasant stay, and would gladly return. Good value, easy access off of Highway, and about 20 minutes from Downtown Toronto. If you prefer the quiet, request a 6th floor room that faces the back of the hotel. Highway 7 street noise tends to get a little intense especially during peak dinner hours.", "business_id": "TGDCii6alNZQf5SP9mNsHA", "stars": 4, "date": "2013-05-30", "useful": 4, "type": "review", "cool": 5}, {"funny": 4, "user_id": "Ae4uXwFHp-5fGrt6OONaXw", "review_id": "_UcVXXeq7cYzuvohP7Sdlw", "text": "When it comes to doing Vegas right, many people believe in the power of the pre-party. For those that are not aware, to pre-party means to purchase cheap booze from a grocery, convenience, drug or liquor store and proceed to get buzzed in your hotel room or the parking lot of the venue you are going to... \n\nWhen it comes to the Hard Rock, the best place to get your pre-party started is St Tropez Convenience Mart. Part market, part liquor store, all cheaper then what you will find in the hotel, which is right across the street.\n\nThe last time I was at St Tropez they were out of what I was looking for, but I was able to find other libations easily. The shop is a little on the small side but they do cram a lot of product in. Employees have always been friendly. I'm a fan!", "business_id": "114mOuMrfBPNiADyfVag2Q", "stars": 4, "date": "2010-12-29", "useful": 5, "type": "review", "cool": 4}, {"funny": 8, "user_id": "o6__ZWGttmlxG87FuHcF0w", "review_id": "FQFjcrYX94kXjmZ_zDZEiw", "text": "_ Randy Abdin is one of the best Real Estate Specialist that I had the honor to work with, and I had gone through alot of other agents that were just a waste of time, pushing me to see homes that were nowhere close to the description of what I had described initially!! \n    Randy Abdin had the patience, professionalism and drive to help and successfully find my new home!!!!! \n*Time after time, I would tell him what I wanted and I was super picky, as a First Time Home Buyer, as well as a single home buyer. He was of great help during they entire home buying process/experience, and believe me it was a bit stressful at times, with the gathering of paper work, making time for the home showings, making offers to preferred homes, looking at short-sales, the whole thing. I had this experience a while, while back in about February of 2010 was the start of it and I thankfully had the luck of closing on a home that I really liked, this was in May 21, 2010 and I am proud to say still gladly satisfied with. The process was smooth, easy, as well organized.     * * * Randy always went above and beyond with what I needed, helping me find the perfect Broker and best deal!!\nI am eternally thankful and so is my family, since he had also helped my family on our previous home purchase years before!! \n       I had no other way of showing all my gratitude than providing him a basket full of cookies for all his dedicated hard work, he is a truly great person and Real Estate Specialist and I would recommend him in a heart beat. \n                                                              *** Best of Luck!!!!!!", "business_id": "8IvQuR_f14MkiqLsir9DqA", "stars": 5, "date": "2013-01-23", "useful": 11, "type": "review", "cool": 11}, {"funny": 3, "user_id": "qlC607Cyp0Mj91vDFvkp3Q", "review_id": "UYbTeUeaw_nkKwrMdR4_gA", "text": "I vacillated between 3 and 4 stars for the Breakfast Club...but, ultimately, is you're having a) bachelorette bar crawl, b) an '80s night of any kind or c) it's super late and you're jonesin' for some Michael Jackson tunes...Breakfast Club nicely fills the void. \n\nI don't go clubbing. I really don't. Because my alcohol tolerance is (now) that of a 65 year old, sometimes it's just better that I have a drink or two and get home by midnight. Therefore, I'm not going to compare Breakfast Club to any other club in CLT. Plus, it would be unfair. \n\nThe pros: Fantastic '80s music and videos. Plenty of space to dance. The venue is incredibly unique, kitsch-ly decorated and BIG. A really great place to bring a bunch of guys or girls and celebrate a fun decade. \n\nThe cons: Some other guests can be overly drunk and, therefore, douchy. Drinks are expensive for what they are. I recall paying $8 for the tiniest of tiny rail vodka soda. The cover can be high. \n\nIf you're bopping around the Charlotte club scene, bar scene or you're just looking to try something different, Breakfast Club is a must visit...even if just once per year!", "business_id": "WnVllr8An68UaMcmOR5ajg", "stars": 4, "date": "2011-08-22", "useful": 3, "type": "review", "cool": 2}, {"funny": 6, "user_id": "MkFySOILZ4yhADa-0tZWZw", "review_id": "0xifKjnRT8fm1UVJz-odGg", "text": "Ex-Toggery is one of the original high end consignments shops to open up in Toronto. Yes the layout is very eighties, but instead of parachute pants and leg warmers, you can expect to come across some incredible finds.Brands like Missoni, Armani and DVF, hang on the racks but I'm on a mission for what else but shoes! \n\nI spy a pair of killer Gucci 2004 f/w Tom Ford era caramel colored gold studded pumps for $199 behind the front glass counter, which is where the REALLY good stuff is kept.  I remember frothing over the same pair back in '04 at the Gucci store when they were originally $750!  The shoes had nary a nick or scratch on them so I decided to give them a new home where they could have many, ohh so many other shoe friends to reside with...sorry I get a little crazy talking about shoes...\n\nThe help is very friendly, and even the patrons shopping there are great as they give me nods of approval and great compliments on my taste in shoes, heck one customer even convinces me to try on the Balenciaga slingbacks too...whew thank goodness they didn't fit, that would have been another $250, which is a great price but with my shoe count ever nearing infinty plus, I don't know if the universe can allow for one more pair!\n\nThis location is actually great as many of the consigners live in the nearby affluent neighbourhoods and regularly bring in their $$$ goodies. The merchandise is for the most part in terrific shape and the pricing is very reasonable. The nice folks at Extoggery can also add you to their notification list for new shipments.\n\nIf you enjoy consignment shopping while friendly locals chat you up about their shared love of label whore-ing it up, than Extoggery is a great place to get your shopping on!", "business_id": "PQuPLNkdc6_iSBqlBoxWMQ", "stars": 4, "date": "2011-08-24", "useful": 4, "type": "review", "cool": 4}, {"funny": 3, "user_id": "8ifOe57JHVEIzmTRt-0VuQ", "review_id": "-ofyM8phd2qK-i58_gYNbw", "text": "In my opinion Coldstone is one of the best places to get a cold refreshing ice cream treat. A favorite of locals and visitors alike, they have a variety of ice cream and toppings, and sauces to make your own creation. This time I chose butter pecan ice cream mixed with caramel and pecans. It was so very good! They have the option to create tour own, or they have their signature creations as well. There are three sizes to choose from and also waffle cones, waffle bowls. This location is clean, and the service is friendly.", "business_id": "RpOOtC0PM8w-1gAJI9k6mg", "stars": 4, "date": "2016-03-31", "useful": 5, "type": "review", "cool": 5}, {"funny": 5, "user_id": "AlXx0P-OhUylep0jNi773g", "review_id": "WBpTm0D8QGbjZRCuQocp3Q", "text": "Reliably mediocre.\n\nWhy do I keep eating here? I always ask myself that when I leave, because it's never very good, but I know I will always come back. It isn't bad; it just isn't good.\n\nA detailed breakdown of 'inoffensively okay'...\n- There is no more $10 pitcher deal.  It's $13.95 now...  Still a pretty good price but, it's no doorcrasher deal... (the best doorcrasher ever was futureshop.ca having 80gb hard drives for $100 on boxing day in 2004, FYI.) \n- The beer list is acceptable. They have Tankhouse, Creemore and Welly (and Sapporo if you're into that sort of thing) as far as \"better beers\" go (still $14)\n- The pho is okay... it's not as good as Pho House next door (but they don't have beer)\n- They take debit... but there is a 50c fee, no matter how much you spend (does that cancel out actually taking debit on the scale of good to bad?  Is taking debit with a fee just high enough to make you go 'hmm' worse than not taking debit?  I don't even know.)\n- The chinese donuts are okay (see video here: http://vimeo.com/18392242)\n- The hot plates are actually pretty good (skillets of meat and veggies) but they're expensive for the portion size compared to other options... they seem to be of higher quality though than some of the other things I've had the misfortune of ingesting (see lame duck here: http://www.flickr.com/photos/sarahlindsay/5392962451/)\n- slightly alarming that everything comes out 10 seconds after your order it (see lame duck photo) noted exception is the hot skillets [did you know that microwaves make your food hot with radiation?  yeah!]\n\nOverall, I will definitely eat here again, not even reluctantly, mostly due to proximity to my house and affordable but not brain-explodingly-cheap beer prices on decent but not-my-favourite beers.", "business_id": "0yZkGtnjZYxdW39aaKKzQg", "stars": 2, "date": "2011-02-01", "useful": 6, "type": "review", "cool": 5}, {"funny": 3, "user_id": "ETYqQCCB1TkiWP_jsRUSrg", "review_id": "9ed04-XzhygnSTbTrVISyg", "text": "I love this store. It stands alone here. For a city with a major university, Champaign has very little to offer in terms of shopping. If that sounds snotty to you, I ask you to look down at the ketchup stain on your Tasmanian Devil tee and reevaluate your priorities. You're better than that, girl.\nThis having been said, I will disclose that I love this place more when my mother is in town. Although I'm in my 30s, she continues to feel guilty for living so far away from me - and that's as good as gold. Literally, she spends a bar of gold on clothes for me at Circles. Am I ashamed? Yes, but the feeling is overcompensated by wearing a Skunkfunk dress over jeans under a smart Skunkfunk coat. That's how I sleep at night. In my Skunkfunk fancies.", "business_id": "8d30a9Af9XJ8c8TafRDcfA", "stars": 4, "date": "2014-01-17", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "OrecZAo5K2qBM6Yvg8-bpA", "review_id": "rJ3zoO-fh9GJSnns6DNP-w", "text": "The owner, Danielle, cops a bit of an attitude if you happen not to be the most snazzy dresser in town.\nIf you happen to walk into her store with flat sandals and shorts, she and her right-hand woman will give you a staring treatment and monitor your every move.\n\nIt's uncalled for, and it's stupid. I don't get it. \n\nHer stuff is very pricey, and I swear I have caught her following me from a distance and \"keeping an eye\" on me just because I like to take my sweet time to look at and compare clothing. Or is it that I get special treatment because I have a bit of an accent?\nIt's demeaning and unnecessary. It's not worth the visit. Bella is more professional.", "business_id": "8d30a9Af9XJ8c8TafRDcfA", "stars": 2, "date": "2010-08-11", "useful": 3, "type": "review", "cool": 0}, {"funny": 3, "user_id": "AIHzJz0AvTq0FxCLtBhOZA", "review_id": "ttGlpNaVrQtIxBJV_yQGQg", "text": "Location really is the top benefit to this station being my close to exclusive fill up joint.  It's on the corner of Roosevelt and 7th Street with good access from either street.\n\nThey charge like $.10 more if you use debit or credit, which doesn't seem to motivate me to keep more cash on me.\n\nAll in all, this Shell is convenient, clean, and safe.", "business_id": "R4IF-sJui0AjrAZgEPgw6g", "stars": 4, "date": "2012-01-20", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "PEkp7T-uOgUq5AIQ5obt2A", "review_id": "lzaLYhjOpruzNs6O18u4Ug", "text": "Was not impressed. The hotel is IN the student union so it is ideally situated to campus. Parking is fine if you find a spot and then never move. \n\nMy biggest complaint was the room temperature. It is controlled by the student union building masters, which is to say there was little to no heat in my room. My vent was actually blowing out cold air and there was nothing I could do to stop it. When I complained they informed me it was a university building and nothing they could do about it. I was so COLD at night!!! Plus, there was a flutist in the next room practicing for what must have been a grad school audition. Felt like I was staying in a very nice looking dorm room!", "business_id": "5lXhJe7gob74m93eyjyp3A", "stars": 2, "date": "2013-01-29", "useful": 3, "type": "review", "cool": 2}, {"funny": 3, "user_id": "o0WGr8L3BWfH2Bslpnqw6g", "review_id": "PM-ryX6dEBt6tC7tNT2hQQ", "text": "Ok, I hear what Gavin M is saying, but you have no idea how good a girl feels when she knows her 'assscrack' smells like roses. Seriously, it's like walking on sunshine.\n\nThey have amazing scents in here, and all of them leave you smelling like you're just fallen into a fluffy rose cloud with sunshine and puppies. Unlike similar products, soaps and lotions from Crabtree hang around for hours so you can always remind yourself of how good your asscrack smells.", "business_id": "3RcE9Ni50NWUJL0gb3cF9w", "stars": 4, "date": "2010-07-15", "useful": 0, "type": "review", "cool": 1}, {"funny": 5, "user_id": "ipDzjJyxrCQNNA2n434mqQ", "review_id": "325jFtJlEvRygRw5cqTSZQ", "text": "I wanted to try this place out because I'm a huge fan of the motion picture film Blade Runner. Normally I don't need to get my hair cut. I'm genetically blessed with smart hair follicles that sense when my appearance needs a tweak and they automatically put themselves in order. I have noticed that it is usually a lesser grade of human that requires this hair cutting nonsense.\nHaving recently moved to the area , I decided that despite my superior genetic make up, I would try and relate to the little people and get my \"hairs cut\".\nMy girlfriend and I walked in, we were not greeted at the desk. Not even so much as a glance in our direction. I know that we are both very intimidating, its obvious that these people have never been confronted by two more perfect specimens of both genders. I could go on but i wont...\nI'm sure its a swell place, but if you are under the age of 400 and may have additional things to do in your 24 hour period, you may want to try elsewhere.\nP.S. some creepy dude with open toed sandals was just sitting in one of the chairs reading a magazine. Get a pedicure you monster,......gross.", "business_id": "GajAnaJo37MXUyKBsW80Gg", "stars": 1, "date": "2014-07-15", "useful": 1, "type": "review", "cool": 1}, {"funny": 7, "user_id": "qibGLHABNReGeJr2w4_8yQ", "review_id": "H-039Er3zanvAxTj3Sh6CQ", "text": "I came here because I was in desperate need of an alcoholic beverage. I was actually trying to find 4 peaks, and ran into this place instead.  I pulled up and noticed that its not like the other places out there.  Colorful, eclectic, with an island kind of feel.  Very open and airy.  There seemed to be a college kid aurora, but I did notice a few adults there drinking as well.\n\nPlace is colorfully decorated, with great drink prices.  I guess they serve food too, but I didnt eat here.  Great alternative to your typical place.", "business_id": "3TxhQKVNLKqRKITPrZQlGg", "stars": 4, "date": "2010-04-03", "useful": 9, "type": "review", "cool": 6}, {"funny": 3, "user_id": "sYQyXDjGaJj7wfaqz5u8KQ", "review_id": "e78vuGoKRlpT3jPIEHozNg", "text": "Went here the other day...reminded me of my carefree college days.  \n\nWait...carefree?  Homework, papers, tests, two jobs....hmm, maybe they weren't so carefree after all.\n\nAnyways, it's always fun to go back to my old stompin' grounds, but I never went to this Dos location as much as the old one right on Mill.  And although it's waaaay bigger now at this location, it's just not the same.  \n\nStudents still flock here, corona's still flow freely and tacos are consumed by the thousands, but I prefer the old, dirty Dos to this new multi-level locale.  There was just something great about ditching class to go day-drink and eat at Dos.\n\nOne trip back to Dos was enough for me though.  I saw frat boys pounding beers, girls frolicking around in tiny skirts and pervy old men at the bar watching it all.  It's back to Scottsdale for me.", "business_id": "3TxhQKVNLKqRKITPrZQlGg", "stars": 3, "date": "2007-06-27", "useful": 4, "type": "review", "cool": 3}, {"funny": 4, "user_id": "0Ci6ezkahP8spfd2Rx6Cug", "review_id": "pRmzh3zNfI3G4_Ucke-00w", "text": "Thursdays there blow my ass and let me tell you why. First straight bars need to stop charging men more than women, its bull shit, especially with all the muffin topped heifers that I saw grazing at this place, or at the least only charge the gays like me the same as the girls cuz trust me I didn't come here to oogle some fat bitch's feedbags. The drinks where cheap and shitty, the staff surly, and the bathroom line was in-fucking-sane, this is why other places have a doorman for the bathroom, it was push your way through to get to pee, luckily i'm not a tiny fairy fag so i got through easy enough but still a very dangerous situation. And in case I didn't mention it, loaded with fat ugly cows in tight clothes, was like watching 15 pounds of shit being shoved into a 5 pound bag.", "business_id": "3TxhQKVNLKqRKITPrZQlGg", "stars": 1, "date": "2010-08-08", "useful": 0, "type": "review", "cool": 0}, {"funny": 3, "user_id": "ens0W1AzB5ogdKSaTVd38g", "review_id": "-MS2X9GJQiskqj_atbRH4g", "text": "Yes, I am giving this place 1 darn star!! Let me explain why..\nThursdays, 50 cent drinks until midnight.. nice.. but NOT worth it!\nFirst off, it's so packed! And sweaty! \nEveryone is totally s*faced and there is always bound to be drama!\nI got kicked out of there once when I was not even making a scene, ugh.. \nMy phone was stolen there, seriously, why??\nMy mp3 player was stolen there.. wtf?\nSome guy stole MONEY from me there and no one did a thing when I told security. \nThe guys there look like they all have two baby mamas and live at home.\nThere are always random fights breaking out. \nI don't know, I'm sooo not into this place, it was a true nightmare and I'm scarred for life from my experience there.. be careful everyone!", "business_id": "3TxhQKVNLKqRKITPrZQlGg", "stars": 1, "date": "2010-02-23", "useful": 2, "type": "review", "cool": 1}, {"funny": 14, "user_id": "rA97zeqOrUYuEM69n0Xn4w", "review_id": "CRYzEdn_C6bTL2LxqpCGNQ", "text": "I cannot believe I am giving Dos Gringos 5 Stars, but you better believe I am. Why, you ask, is this Cenpho junkie giving an EXTREMELY Tempe bar five stars? \n\n1. The one and only fight I have ever been in took place here. (yes, I won) \n2. I got trashed the other night for $5. \n3. You are inside and outside at exactly the same time. \n4. They have ample bathroom stalls in the women's restroom. \n5. There are bowls of limes on the counters. I hate asking for lime. \n6. I get hit on at least three times before I finish my first drink. \n7. They have live music. \n8. You can get molested in public without being arrested \n9. I always get carded.", "business_id": "3TxhQKVNLKqRKITPrZQlGg", "stars": 5, "date": "2009-03-03", "useful": 9, "type": "review", "cool": 9}, {"funny": 3, "user_id": "uqJ0kCrmZOEZzbt4qV3ODA", "review_id": "ppD6eoStf2fPa2pREfa5Ag", "text": "Location: Awesome.\n\nDownscale, intentionally shitty and cheesy, decent food, excellent happy hour, set up like a giant courtyard,  the perfect place to get sloshed outside in the AZ summer. Or winter. Or whenever.\n\nPlus, think about it. It has the words Gringo and Trailer Park in it's name. \n\nWhat could possibly go wrong?", "business_id": "3TxhQKVNLKqRKITPrZQlGg", "stars": 4, "date": "2008-09-11", "useful": 1, "type": "review", "cool": 3}, {"funny": 5, "user_id": "Yej5B4nd8PqpHMQcmCTDrg", "review_id": "aKMXBBsqtUjSxYD5ZVN3WA", "text": "Dos Gringos is definitely bringing trashy back.  And I think the whole trailer park theme has really gotten the best of them.  Two cases in point.\n\nA) Drinks are EXTREMELY weak.  They give you tall glasses, but have very thin pours of liquor.  Thinking maybe it was the vodka, we switched to rum, but alas, the trailer park was just being cheap. \n\nB) The vomit stench wafting from the mens restroom really takes the trailer park theme a little too far, right?  After I reported to staff that puke was all over a men's urinal, it was still there an hour later.\n\nDoesn't that make you yearn for the good old college days??\n\nGranted it was a Sunday afternoon and all, and the DJ and crowd was fun.  A definite fun place to day drink, and bring the pooch.  Call me an old-fashioned prude, but the puke-fest and sucky drinks kind of killed the mood.  And believe it or not, I didn't have the appetite to try any of their award-winning tacos.", "business_id": "3TxhQKVNLKqRKITPrZQlGg", "stars": 2, "date": "2007-04-03", "useful": 3, "type": "review", "cool": 0}, {"funny": 3, "user_id": "NG8e2fv9CjjOCY1JaX_27Q", "review_id": "9ASZM_HcyMbSCR2RFgJwaQ", "text": "Two shawarmas for 6.99? Sign me up! \n\nThe shawarmas are not that long, but they are thick! Like a soup can. Packed with filling. I get two chicken shawarmas with my girlfriend, she loves them. I almost wish I was single so I can have both for myself.\n\nTried the gyros meal once. It wasn't the greatest. The gyros looked it like came from a package. It was served on top of the rice, smothered in tzatziki and hot sauce. It looked like a melted strawberry sundae, and tasted just so-so. Whatever, this place is about the shawarmas!\n\nThe owner is friendly and always has a huge smile on his face. It's kind of creepy, but who cares. His shawarmas are da bomb! (For the price)\n\nIf you're in the area and got a shawarma craving, check this place out.", "business_id": "BpUM6tIvWnrZX6sT7aaZKA", "stars": 4, "date": "2013-09-12", "useful": 3, "type": "review", "cool": 1}, {"funny": 5, "user_id": "rCWrxuRC8_pfagpchtHp6A", "review_id": "T_16OPvF0wvQqd6krMHpHA", "text": "Note #1-This place is strictly TAKEOUT ONLY. There is no dine-in, no delivery. \n\nNote #2-Their menu only consists of square pizzas( 6 different combos including white pizza), calzones, pepperoni rolls, and breadsticks. This location has no wings, hoagies, or anything else. \n\nThis has been a lost pizza parlor to me for many years as it lies on a stretch of road I rarely find myself on these days. I used to forget the name of it but knew there was a pizza place here...somewhere. I had a heckuva time trying to research the name, but after trying many different variations, I came upon DiCarlo's. In finding the name, I also discovered that they are a chain with a baker's dozen of locations throughout Pennsylvania, West Virginia, and Ohio and have been in business since 1949!  Hmmm. \n\nDiCarlo's puports to make a pizza that is \"indescribable.\" As someone who aspires to write, I shall accept the challenge. \n\nIn watching the pizza beig made as I waited, I can say that it's a pretty spiffy looking pie, like a picture framing some sort of modern art piece made of pepperoni, mushroom, sauce, and a little cheese. That's until they pile even more cheese and pep on top of the pizza right before boxing it up. Looking for a meaning? It means \"bloody well good muthaf**er!.\" That's what the artists were trying to convey. :D \n\n\nSo yeah, this is similar to a Beto's pizza with the unbaked cheese compounding the toppings that are already on it.  \n\nAnother interesting thing about DiCarlo's pizza is that they use provolone instead of mozzarella, and it works exquisitely. The pepperoni is smoked, tender, fresh, and the mushrooms are finely cured. The sauce has a citrusy flavor to me. But that crust...\n\nI could eat that golden, buttery, crispy crust alone, naked. The crust I mean, not me. Well, you know what? I would eat this crust in the nude! It's that good.  The crust was so good, I was thankful for how it extended beyond the pie, again, framing the whole thing and giving me the chance to taste the crust by itself.  \n\nBtw, that cheese was melted perfectly when we got it home, and like a Beto's, you can always pop it in the oven if the unmelted cheese is just too far out for ya. I kind of dig it as is though. \n\nTake Beto's pizza and mash it up with DeMino's in Brookline, and you'll have a DiCarlo's pizza.  And it doesn't taste like it came from a chain either.", "business_id": "1n8bvxpBoUOAJsC5csuV3Q", "stars": 4, "date": "2010-08-14", "useful": 7, "type": "review", "cool": 6}, {"funny": 7, "user_id": "37HswRimgBEf7_US-c3CDA", "review_id": "0p5ncirEcJANvgZaKFG_Wg", "text": "The only 4 words you need to know are: Spicy Pimento Cheese Sandwich\n\nAt the suggestion of a work buddy, we came here for sandwiches & salads & given her highest recommendation was the Pimento Cheese, who was I to argue?\n\nThis sandwich was phenomenal!!  Creamy cheese spread w/ little shreds of cheddar & red peppers ( aka, *pimentos* ) w/ a nice, spicy kick to the mix....all thickly schmeered on a Cranberry-Walnut-Wheat Bread & then grilled so it's all hot & gooey & toasty & melty!\n\nThis was out of this world!!!  So much so we all came back the next day for more!\n\nAnd upon the next work trip, you'd better believe that sandwich will be on my list - I'm still drooling......", "business_id": "-rdjYy7_iqDoylkUpdolDQ", "stars": 5, "date": "2015-03-11", "useful": 11, "type": "review", "cool": 13}, {"funny": 3, "user_id": "j6wLUT0ZXi-x0otelYIFpA", "review_id": "iILVx7cjJ8oKRd6VZ2tOrQ", "text": "I've never been in this store before, thinking that the styles on the mannequins were too teenagerish. The Hubster convinced me by saying \"Wow, $30 for dresses.\" \n\nI went in and found some great fashions for adults. I picked up a few of good dresses (party and work) while the Hubster tried on a couple of jeans. The change room line was long, but the person managing it had everything under control and it went by pretty quickly. Two of the dresses fit really great and came to $33 each. The Hubster was out of luck with the jeans since he doesn't think he can pull off the tight tight \"Hey everyone, this is EXACTLY what my junk looks like!\" styles that the kids are wearing these days.\n\nWhile checking out, I noted that none of the dresses had belts in them on the rack, but they all had belt loops. The checkout person showed me to a drawer full of belts and let me pick one for my dress. I liked that.\n\nI'll definitely be back next time I'm in the market for clothes, but I probably won't be back on a weekday.", "business_id": "4JT8hmfMZCpAnk26CdbTSg", "stars": 4, "date": "2013-02-25", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "qoS4nIc5MlfF_j8DkYHBgw", "review_id": "UMdLL25UCX2GadUEV-jdfg", "text": "Forever 21 I used to walk by all the time and think who in the world would shop there, umm me!\n\nThis place is always very organized and there is clothes all still neatly sitting around that looks like a hundred million people haven't touched yet!\n\nThis store is big and they keep it well organized and together even when they have cheap prices and decent looking clothing, you would think there would be clothes all over the place and crazy Chic's in here digging around looking for the prefect outfit.\n\nThe dressing rooms are big, too, and you can bring everything you wanna try on in with you, instead of only being allowed a couple items. \n\nThey have clothes for everybody if you ask me, why does it matter who you are to be able to wear clothes from here, if you like it and you look good in it, wear it, buy it!\n\nThe shopping experience is so relaxing when everything is where it should be and you don't have to hunt around for your size because it is hanging in another location where it shouldn't be, very well organized indeed!!", "business_id": "4JT8hmfMZCpAnk26CdbTSg", "stars": 4, "date": "2010-09-10", "useful": 6, "type": "review", "cool": 4}, {"funny": 3, "user_id": "H_-K6erSJYtzg3ZEvOg3EQ", "review_id": "29TdXKVdzyx9tIDa_sQLRw", "text": "If you are looking to make a good impression with someone, whether it is a date or just your mom, you should bring the person to Three Birds in Lakewood on a nice evening and sit on the patio. If you have already had dinner, try their desert or martini list. This place has serious ambiance and it will definitely lift the mood, and your status! It is the type of place where experiences are made. If I were you, I would save this secret weapon for a hard to impress date. It will knock his or her socks off. And if you own a dress, you should wear it.", "business_id": "GDflEuJRmQwUha0vuGJJiQ", "stars": 5, "date": "2009-02-23", "useful": 5, "type": "review", "cool": 4}, {"funny": 10, "user_id": "5jJjY5_R06Og56VfjIc66A", "review_id": "SA32qETYk5tsJkF5MdgUgQ", "text": "*** It is now a Marathon Station*** Same address and phone number. Even though I've submitted the changes to Yelp and they've \"made changes\" they can verify, it hasn't been changed. I verified the changes myself by standing next to a sign that reads \"Marathon\" and a simple Google search. Hmmm. Rocket science. Anyhoo.... Very convenient location adjacent the Concord Mills Mall.  It's in the parking lot, so once you're in the parking lot, it's fairly easy access. Busy but tons of pumps. Just be careful exiting - it's super busy and incoming mall traffic will not yield.", "business_id": "35Vy7DmrPpSfqsJUg2h9dA", "stars": 4, "date": "2015-11-03", "useful": 10, "type": "review", "cool": 10}, {"funny": 3, "user_id": "PSI7wvuqEhhV9Jh_fP2eZQ", "review_id": "ESY3i-Xctu_-CkEP8YVTKQ", "text": "What has two pinball machines, a billiards table, a seated Pac-Man machine, and a menu of gourmet sandwiches and salads? The answer is Taste Market & Deli, located on the ground level of The Market LV inside Tivoli Village. I brought my husband here on a Sunday morning specifically to shoot a few rounds of pool in a family-friendly, smoke-free environment, only to find the table in need of repair due to a cue ball malfunction. Luckily, other entertainment options, including a stash of board games and two TVs showing sporting events, were available.\n\nTwo friendly ladies working the counter were very helpful by explaining the menu and making suggestions. I tried a cinnamon hot chocolate with espresso that they recommended. I'd order it again, but with an extra shot of espresso. My husband ordered an egg white omelet (cooked to order, but needed a side of toast or something) and I chose to build my own sandwich from a wide variety of toppings. Starting with rye bread, I requested burrata cheese, lettuce, fresh basil, roasted tomato, organic mushrooms, avocado, pesto, and a touch of homemade mayo. For $5.95, this creation easily put any $5 footlong to shame. Every individual ingredient was fresh and of excellent quality. Sandwich breads are baked by Bon Breads. The mushrooms appeared shiitake-less in favor of small pieces of chanterelles and other exotic varieties. Large chunks of avocado were incredibly buttery! I even detected a few large grains of sea salt used as seasoning. A small side of homemade pickles seemed to disappear from my plate while I was distracted by the second half of my sandwich.\n\nTaste is a large space with many tables. The layout, with its colorful, mismatched chairs and staircase in the center of the room, reminds me of Michelle Bernstein's trendy cafe Crumb on Parchment, located in Miami's Design District. Baked goods include croissants (served with homemade pear or tomato jam), coffee cake, and mini fruit pies. I didn't confirm where the pastries are brought in from, but square scones always seem like a Chocolate & Spice signature to me. The market area offers some unique coffees, gourmet condiments, and various items, but doesn't really capture my attention. Beer (PBR) and wine are served on tap, and bottled beers are available in a refrigerated case. Rounding out the selection with a cider would earn bonus points in my book!", "business_id": "Opxi_-aCcn6S-dj7JzRE2Q", "stars": 4, "date": "2013-01-14", "useful": 4, "type": "review", "cool": 3}, {"funny": 4, "user_id": "qewG3X2O4X6JKskxyyqFwQ", "review_id": "jjsHDugRhGDRBgCKmGma6A", "text": "Pinball, pool, Pac-Man and plates of food- yes, there's puh-lenty to enjoy at Taste. The menu features sandwiches, salads and soups, the perfect options for a casual lunch. I popped in to have a meeting and wasn't really starving, so I opted for a bowl of chili. It was delicious, so my only complaint is that they should have put more of it in the bowl! (Seriously, the serving was a little on the small side.)\n\nI was surprised there is no WiFi, but perhaps they just want you to focus on eating and partaking in a game or two. It may be the only lunch spot I've seen with a pool table! It also seems like a spot that should have juices, smoothies or some other creative, freshly brewed beverages, but their drink selection is largely bottled. They do have adult beverages though, wine and beer. \n\nOverall, a very favorable first impression thanks to the whimsical details and obvious commitment to fine ingredients. Make it a lunch date.", "business_id": "Opxi_-aCcn6S-dj7JzRE2Q", "stars": 4, "date": "2013-02-12", "useful": 13, "type": "review", "cool": 11}, {"funny": 3, "user_id": "9sldtsoM9MFEyPEss0L9kA", "review_id": "EaPiPY1pcAPhuaEpZDVGYA", "text": "I never intend to, but somehow, each year I manage to ruin major holidays by gorging all the See's Candies before anyone in the family ever gets to sample any.\n\nAt first I'm all, \"I think I'll skip breakfast today and have one with my coffee.\" Then another, and another, and after a while, I'm like, \"Aw, fuck it.\" \n\nI don't know what happens, but once I eat one of See's 'Nuts and Chews', I lose my motherfucking mind, slipping into an eating frenzy so pronounced I practically want to devour the box.\n\nAnyway, they cost a small fortune but are worth every penny. \nI bought a one-pound and a two-pound box a couple days ago, the price tag was fifty three bucks. \nIf you do the math, that works out to just under 4 cents a gram, which compared with coke at $40  a gram, is quite the deal. \n\nIf you have an addictive personality, you may want to glom onto this See's thing. Just up your workout regimen a tad and load up. Try about a dozen with a couple of Monsters first thing in the morning and get ready to kick some boo-tay at work.\nAt least for a couple hours anyway.", "business_id": "3YR3V1fuYu7UEzDyTVb0lw", "stars": 5, "date": "2013-11-27", "useful": 4, "type": "review", "cool": 4}, {"funny": 9, "user_id": "Rzf35jKV8e8EJdssrae_AA", "review_id": "Crfs8aJGbxyJ8TqDD8Mpmw", "text": "All you chocolate elitists can turn your noses up at See's all you want.  I love it, and I always will.\n\nSee's was the \"special\" candy my family tried to order every Christmas.  Back in those days before the internet (we still had 8-track tape players) at a time when no one really knew anything existed other than what you had seen, there was Russell Stover, Whitman's Samplers (that my cheap ass uncle was fond of giving in lieu of a real present), and See's.  There was no comparison.  See's was it.  I didn't even know they had stores then, much less stores that give out free candy just for coming in.  Kind of like a test drive without the pressure.\n\nAnd I still prefer See's over it's closest competitor to me, location-wise, Godiva.  Why?  Well, the free candy for one.  Number two, it doesn't cost $60 a pound, more like $16.  Granted, Godiva has prettier packaging and perhaps a better product, but not enough to compromise my loyalty.  \n\nI was recently saddened to see the store at Fashion Square close, but luckily, this one is nearby.  Much larger and easier to shop in, but my only complaint is that I had to stand in line with people hand-picking their boxes to pay for my pre-packaged items.  But since my husband was one of the pickers, I wasn't going anywhere until he was done anyway.  And his box was for me:)", "business_id": "3YR3V1fuYu7UEzDyTVb0lw", "stars": 5, "date": "2011-01-21", "useful": 10, "type": "review", "cool": 9}, {"funny": 4, "user_id": "3xORNxbKdd08LUf0tclx3A", "review_id": "FqFof3Q5ONfFnBx_QdPD9Q", "text": "One giant YUM! While venturing out for lunch I stopped by See's because really, who doesn't love chocolate? The allure of free samples speaks to me! Holy moley! The truffles are magnificent! If I lived anywhere other than the hot desert of Phoenix and assuming I had someone to share truffles with, I would have picked up several. But alas, I settled for two...however the experience was great and I will definitely be back to gather more bait for women...what's the shelf life on a truffle??", "business_id": "3YR3V1fuYu7UEzDyTVb0lw", "stars": 5, "date": "2009-09-09", "useful": 4, "type": "review", "cool": 4}, {"funny": 10, "user_id": "SrF972IxsELYQ3eaWB5X4A", "review_id": "uCygeqA__cXcfXiY6QBwzg", "text": "How can they keep giving  away candy?\n\nThis place is an anachronism...a look back at better days...easier days:)\n\nA step back in time to the days when you could sit at the lunch counter at Woolworth's and have an open face turkey sandwich at the counter, brought to you by a nice lady in sky blue waitress uniform:)\n\nHere the uniforms are white and the ladies behind the counter aren't bringing turkey sandwiches...they are handing you candy...sweet, sweet candy:)\n\nHow could we not love them and their sweet and clean candy stores?\n\nI know I'm not the one to resist them and their proffer of delightful and chocolaty treats.\n\nWe still had a \"hankerin'\" for a little something after lunch today and strolled up the street to See's.\n\nWe were just going to look...in theory...but the problem is, that when you walk in, you smell the chocolate, these angels in white offer you chocolate (sometimes more than one:), and the next thing you know, you are walking down the street with 6 lb's. of Bordeaux creams, truffles, peanut butter crunch and fudge:)\n\nYou've been hypnotized by the clean white store, the uniforms, the aromas and free samples:)\n\nAre the chocolates Knipschildt, DeLaffee or even Godiva, no...but they are good and  none of those other guys have the ladies in white handing out samples:-)\n\nSwing on by and have a free sample...you know you want to:)", "business_id": "3YR3V1fuYu7UEzDyTVb0lw", "stars": 4, "date": "2009-08-16", "useful": 9, "type": "review", "cool": 11}, {"funny": 7, "user_id": "qewG3X2O4X6JKskxyyqFwQ", "review_id": "sFTFBmuExakPcRf90TWjzg", "text": "I have been wearing make up since I was in 3rd grade. Yes, I had a permissive mom, and I grew up in the South. When skate night rolled around, I could be found in green eyeshadow and bubble gum pink lips. Granted, I don't really indulge my love for make up as much these days, but deep down inside is a 3rd grader who wants to get dolled up for any and every occasion. So, when I heard about Mixt I really wanted to check it out.\n\nIt is a self-described \"beauty boutique.\" I went in for a browse, and the shop is adorable! The sales associate who was working that evening was a doll! Much nicer and more approachable than the ladies at the other Boca boutiques. (She's from Virginia... it's a Southern thang.) I was impressed by their darling accessories (necklaces, bracelets, earrings), all reasonably priced. There was also a small selection of clothing. I was tempted to purchase one of the 5 or so fragrances of a shea lotion stick they had on display, but I resisted. It would be a perfect stocking stuffer! I also noticed some bedroom eyes eyeshadow sets for $10, which seemed reasonable! However, I was surprised not to find more make up items. I wanted more of the kid in a candy store effect.\n\nThey also offer some beauty services, including eyelash extensions and of course make-up application. I didn't partake in any services, so I feel it is only safe to stay with 3 stars. However, I definitely think Mixt is worth checking out!", "business_id": "0ox0u3k-I0XEqU_P6wJB3w", "stars": 3, "date": "2010-11-22", "useful": 13, "type": "review", "cool": 8}, {"funny": 11, "user_id": "A0j21z2Q1HGic7jW6e9h7A", "review_id": "ZRgiqJEayalCqWaFjx4qPQ", "text": "Is there a Food Court in America that doesn't have a Sbarro's?  \n\nI remember when we first stumbled upon Sbarro's on Lexington Avenue and 58th Street, oh so many years ago. I believed this was the family's first store in Manhattan.  The food now, as it was then is somewhat respectable east coast Italian pizza.\n\nDon't get me wrong, it's nothing special.  The pasta has been pre-cooked and is just sitting there waiting for it's final watery bath before being served to you.  I have never been a fan of this eeck. \n\nBut the pizza is not bad for what it is, somewhat above the freezer case variety.", "business_id": "HH26SnOm2Ab7UfkNhQU66A", "stars": 2, "date": "2013-06-18", "useful": 14, "type": "review", "cool": 13}, {"funny": 3, "user_id": "kubSOPtHMMe_CdxaFV1R4g", "review_id": "vuW8kNDZq2mXma-N95SuLQ", "text": "Not only does Tiffinday serve up some amazingly delicious food, but it's completely vegan, and delivered directly to you! \n\nEssentially, it's like this:\nTiffinday - Hey Kevin, I was thinking about cooking some delicious food\nKevin - Yeah, and...\nTiffinday - And then delivering it to you directly around lunch time.\nKevin - ....YOU ARE MY GOD!\n\nIn case I'm not making this clear enough:\n\n(Good Food + Delivery)\n------------------------------ = Happy Belly * (Laziness [Squared] )\n             Week\n\nI'm not great with math, but I'm pretty sure that's the equation (Note: I really wanted to add the \"2\" for squared, but it won't let me). \n\nSo I'm sitting there, at work, working away, and BOOM! there's my lunch, sitting right next to me. It's so easy too, just create an account and select the food you want for the week/month, pay for it online, then try and contain your excitement for the tastiness headed your way. They mostly deliver to the downtown core, so make sure you check the delivery zone before ordering. \n\nTake note every-other-restaurant, this is how food is meant to be enjoyed.", "business_id": "3stSrS4DE1SeYMC6usnbbg", "stars": 5, "date": "2011-08-31", "useful": 1, "type": "review", "cool": 2}, {"funny": 3, "user_id": "mr_ojEBsruwpAKIKNY_sdQ", "review_id": "zceuK5Qqx0m8qpFm02ROoA", "text": "seriously, this place is the worst.  i took my son in there and the lady gave him the worst haircut i had ever seen on anyone.  i could have done a better job, and i am not a hairdresser.  everyone i know that has gone here, has never gone back, and i won't either!", "business_id": "BhLWxpYB3zFSkYnPRJR0iw", "stars": 1, "date": "2014-08-27", "useful": 2, "type": "review", "cool": 0}, {"funny": 3, "user_id": "UJ34ulNl8mDraF4Sn9cySA", "review_id": "R--FnEBOJ4fMonwcPsTRLg", "text": "The owner waited on us and was very friendly and accommodating.  Food was fresh and good but not the pho.  It was powdered chicken broth.  I would go back for the make your own rice paper rolls with the pork sausage.", "business_id": "2D2NpSJDyQCBKPRboUcKWQ", "stars": 3, "date": "2009-02-04", "useful": 2, "type": "review", "cool": 2}, {"funny": 3, "user_id": "Wc5L6iuvSNF5WGBlqIO8nw", "review_id": "x5pL_cn4vJPNXAy0I1_V7w", "text": "Vegetarians avert your eyes. Quebec pork is some of the best in the world and Porcmeilleur in Jean Talon Market just does do pork better. Lardons, ribs, chops, home maple bacon, all from animals raised and prepared by this small team of Montreal meat pros. Exceptional, delicious food from a tiny, super clean little storefront in the Market.", "business_id": "QEtp3ed3o6FWHEPhmqxhvA", "stars": 4, "date": "2012-01-29", "useful": 2, "type": "review", "cool": 4}, {"funny": 3, "user_id": "NfU0zDaTMEQ4-X9dbQWd9A", "review_id": "Bpvl23DfXiSeUj-Q4IsIQg", "text": "There's not much I can say about Cranky's... in fact, that surprises me since I can almost always find something to say about everything. \n\nIn my opinion, this bar is in a very strange location. It's off by itself in a semi-scary section of W 25th, not quite convenient enough to attract much traffic. This shows. I'm not one to ever judge a bar by the size of the crowd, but every time I've been there for shows, there have been maybe 8-10 people inside. \n\nNot only is the neighborhood mildly terrifying, the building itself is just a little seedy. I don't know why but I'm always feeling a little uneasy when I'm at Cranky's. I'm far from a bar snob, trust me. I'll sit in the grungiest dive, eat greasy food and drink cheap beers happily. My uneasy has nothing to do with the interior or clientele, it's just one of those places that doesn't sit well with me. \n\nI do think it's a good place to catch some live music, not the best venue or the worst. The bar selection is decent and I get a kick out of some of the old, hipster beers they have on hand. (Ummm, hello miniature High Life bottle?!) \n\n... and that's pretty much it. This has to be up there with my top 5 crappiest reviews. *Sigh*\n\nOh, they have their own parking lot! That's a plus! I \"heart\" free parking.", "business_id": "9t6_OqGMVtqRTLkQAwIj_w", "stars": 3, "date": "2010-11-30", "useful": 4, "type": "review", "cool": 1}, {"funny": 3, "user_id": "AKXqbuifvfvNEpr3Qs51hQ", "review_id": "CwO6G-xLp5XMeLT7ak_ssw", "text": "How is it that the MetroCenter Trader Joe's seems to be better stocked than the one at Town & Country, even though it's like half the size? Logically you'd think it'd be the other way around. \n\nMinus a star because I think it could be bigger (esp. their produce area) but bonus star for the the lady who does all the food demonstrations. She knows me and all my digestive issues well. \n\nI just walk in through the door and all she has to do is:\n\nA) Look at me glumly (therefore I know to head straight to the aisles to look for my lunch)\n\nor \n\nB) Look at me and smile (and thus I know the food she's preparing will be pain-free and I loiter around the pseudo tiki hut for 15 minutes devouring triple layer hummus on organic water crackers, chasing each one down with a sip-sized cup of lemonade, before realizing that crackers and hummus don't really constitute lunch). \n\nI mean, how many Trader Joe's give you specialized customer service like that? \n\nYeah, I didn't think so.", "business_id": "4Xw-4qC0zY7HI8ZlxNL49g", "stars": 4, "date": "2007-09-15", "useful": 3, "type": "review", "cool": 3}, {"funny": 3, "user_id": "j4SdOoAfQr_PbyDS6RBMSQ", "review_id": "aE0BmNGSns2hrS2iqQGFEQ", "text": "The only reason that this theatre is getting 2 stars and not 1, is due to the ticket prices and that's it. Also, I want to add one thing about the prior reviewer stating that the refreshments at this theatre are cheaper; it's simply not true. Even if there is a certain item that is cheaper, the small sizes of everything they sell are a complete rip off. \n\nYeah, so anyways; Let's start off with the militant old woman that runs this hole of a place. Her friendliness reeks disingenuous as she greets you, and then gets on her walkie-talkie to radio the undercover creeps at this theatre watching your every move. She states to them how many tickets were purchased and for what film. Yes, I feel justified calling these people creeps, because that is exactly what they are, creepy. You are treated like a criminal upon entering this theatre, or maybe they just profile people like me, that look different. Either way, there is no excuse for this place. \n\nSo on to the concession stand were we paid $4 for a pretzel with cheese. Thank God there was cheese because this nasty, huge, tasteless piece of microwaved dough in plastic, tasted horrible. We also bought a medium Pepsi and a small popcorn which all totaled about $11. The amount of soda was that of a can and the popcorn had some weird generic taste to it. The girl working the stand also came off as disingenuous. I just can't stand fake smiles. \n\nSo here is the kicker of it all; I go back out to the concession stand before the movie and ask for a courtesy cup. They charge me 25 cents on top of what we already paid! That's not the kicker though. Are you ready for this? She has the AUDACITY to ask me what the cup was for...? Are you splitting popcorn or your pop? Uhhh? Are you serious! She's lucky I was in a good mood, that's all I can say. I should of ripped her head off verbally. This place has no right to ask such things. None what so ever! Let's move on.\n\nThe theatres are actually very small and that of the 90's. If you sit behind someone then you won't be able to see. There is also a very odd, mild scent of dirty toilets that lingers through the theatres. This is the third time I have been to this cinema, and the people there always talk and are rude during the film. You would think they would monitor the auditoriums also, but no such luck. What I thought was really hilarious, was the amount of people who had snuck stuff in. You heard all kinds of pop cans and bags opening exactly as the previews started. So it looks as if all their Barney Fife tactics fail in the end.\n\nLast but not least, they have plain clothed people standing around hiding their walkie-talkies when the theatres let out, to ensure no one sneaks into another film. They stare at you, as if they are mentally warding you off.\n\nSo needles to say at this point, this theatre is HORRIBLE. I only recommend going if you are dirt broke and want to see a new release. If you're not broke, go somewhere else and spend the extra 2 dollars; Because this place is not worth it.\n\nP.S. What movie theatre has Pepsi over Coke? That's just un-American.\n\nP.S.S. I changed my mind...1 star.\n\nP.S.S.S. These other reviewers are either simply delusional, liars or were paid off. This theatre is atrocious and should be condemned.", "business_id": "0hOumV2_pUhxgwqkBiUTdw", "stars": 1, "date": "2013-04-21", "useful": 4, "type": "review", "cool": 0}, {"funny": 3, "user_id": "2DECrukmumziXTBI20idTA", "review_id": "YeFT6K_CXmoBe1BbgozgSw", "text": "As a general rule of thumb I'm pretty lenient on Chinese restaurants, especially the ones with great service. Mostly because I've never been to China and I'm not Chinese so I have never felt I had the authority to articulate why one place is better than the next.\nBut...I'm going to go ahead and just say this place sucks it. I don't know what it is about the Southwest side of town but it's like there is a vacuum here where decent cheap Chinese food just can't exist.\n\nHere's the BAD:\nFried Rice...doesn't this usually have a few items in it other than rice?\nGeneral Tso's chicken...I don't usually order this but i just had a taste for sesame chicken one day, and settled for this.\nI think the secret recipe for this dish is sweet and sour sauce and KC masterpiece.\nMongolian beef...This is not supposed to be that spicy and the sauce wasn't even cooked in to the meat. It was like they cooked the meat in the wok for 30 seconds leaving it too tender but also sinewy and the sauce was tossed on as an after thought. Also the whole order was made up of about 9 giant pieces. I felt like I was eating an entire flank steak with chop stix.\nService...Hey guy, can I get a little help?...I can't choke down your crap without a drink refill. And \"yes, I WAS done with that crap, but next time ASK to make sure.\n\nThe Good(Acceptable):\nThe lady that works here is an absolute sweetheart.\nThe lunch specials are a great price and unlike most places you will be full when you leave.\nThe little kid who sometimes runs to the front door brandishing a transformer, and stares at you as you are leaving.\n\nIf you have to eat it (as I sometimes do) get it to go. I'm sure there is something on the menu worth $6-7. So I'll let you all know if I find something.", "business_id": "Q-HDnjHCywb65thAB-f0nw", "stars": 2, "date": "2011-03-27", "useful": 2, "type": "review", "cool": 0}, {"funny": 6, "user_id": "AFwdbeSX0CLsu_15shQxiw", "review_id": "RAKff1rLHKU1l0uzuvyMuQ", "text": "Okay, I will give in and give it the extra star to push it to A-OK but it really is just OK and I have had better.  Came here for St Paddy's day as I was starting a week of hitting spring training. \n\nThe patrons are what were tripping me out the most.  It's Mullet Hunters Paradise.  Locks of love should send out a mobile unit and roofie these hill billys and take their hockey haircuts from them.\n\nSeveral patrons struck me as particularly odd.  The girl who came in and EVERYONE was staring at her.  She got all dolled up and was ready to rock Surprise AZ.  She was the hottest chick in the town.  You could tell everyone in the room was thinking it..... Except me.  She had a circa 1986 feathered hair style, and some flash dance style dress with these goofy looking boots.  \n\nOr the lady that was totally fine with letting her kids sit at home starving while she got drunk.  She told her Brother \"dont tell the kids I am at the Bar\"  classic.  Brother felt bad and took them Mcdonalds and came back.\n\nBartender was a really cool lady that hooked me up with some corned beef and cabbage.  \n\nIt was close to where I was staying and since it was St. Paddy's I wasn't venturing out but next time I will.", "business_id": "9A_G9fqev0JctviowRoBDw", "stars": 3, "date": "2011-04-08", "useful": 4, "type": "review", "cool": 2}]